/*===============================================================
+																+
+			Title:	 AMDTCTRL-C1Hソフトウェア				    +
+																+
+				date:		1th Apri,2017						+
+																+
+  	 	Copyright (C) Aoyama Motor Drive Technology    2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"iodefine.h"										/* 周辺定義ヘッダファイル						*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
/* ライブラリ/デバッグ関係		*/
/*=============================================================*/

/*=============================================================*/
/*					  iolib共通変数定義						　 */
/*=============================================================*/
/* 注意！！エンコーダのMAXカウントは、12Bit以下とする事	*/
u2	__u2_enca0_cnt_max;
/*=============================================================*/

/*==============================================================*/
/*	ENCA0初期設定関数											*/
/*			u2 u2_cnt_max		:エンコーダMAX値設定			*/
/*			u1 u1_src_abz	　　: 0:端子入力選択（ABZ)			*/
/*								  1:RDC20から入力選択（ABZ）	*/
/*								  2:-							*/
/*								  3:ENCA1端子から入力			*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*																*/
/*==============================================================*/
void enca0_init( u2 u2_cnt_max , u1 u1_src_abz )
{
	/* エンコーダ停止	*/
	ENCA0.TT.BIT.TT			= 1;								/* タイマストップトリガビット					*/
																/* 0:何もしない/1:タイマ停止					*/

	/* ENCAn制御レジスタ	*/
	ENCA0.CTL.BIT.CME		= 1;								/* エンコーダクリアマスクイネーブルビット		*/
																/* 0:ENCAnCCR1 コンペア一致割り込みマスク無効	*/
																/* 1:割り込みマスク有効							*/
																/* 注）ENCAnCRM1=1の時，1設定禁止				*/
																
	ENCA0.CTL.BIT.MCS		= 0;								/* 	エンコーダマスククリア選択					*/
																/* 0:ENCAnCCR1の書き込みした時，コンペア一致割り込み検出のマスクを無効にする	*/
																/* 1: エンコーダクリア入力によるタイマカウンタクリア動作時						*/
																/*	  ENCAnECM0 = 1 のときに ENCAnCNT と ENCAnCCR0 がコンペア一致時のタイマカウンタクリア動作時	*/
																/*    ENCAnLDE = 1 のときのアンダフローの検出による ENCAnCCR0 からタイマカウンタへのロード時	*/
																/*    マスクを無効にする														*/
																/* 注） ENCAnCRM1 = 0 のときにのみ有効			*/
																
	ENCA0.CTL.BIT.CRM1		= 0;								/* 0: CCR1コンペアレジスタ/1:キャプチャレジスタ	*/
	ENCA0.CTL.BIT.CRM0		= 0;								/* 0: CCR0コンペアレジスタ/1:キャプチャレジスタ	*/
	
	ENCA0.CTL.BIT.CTS		= 0;								/* ENCAnCCR1キャプチャトリガ選択ビット		*/
																/* 0:ENCAnI1をENCAnCCR1レジスタへのキャプチャトリガとする	*/
																/* 1:ENCAnECをENCAnCCR1レジスタへのキャプチャトリガとする	*/
																/* 注）ENCAnCRM1 = 1の時有効					*/
																
	ENCA0.CTL.BIT.LDE		= 1;								/* ENCAn カウンタロードイネーブルビット			*/
																/* 0:カウンタのアンダフロー時、 ENCAnCCR0レジスタの設定値をリロードしない	*/
																/* 1:カウンタのアンダフロー時、 ENCAnCCR0レジスタの設定値をリロードする		*/
																/* 注） ENCAnCRM0 = 0のときにのみ有効			*/
	ENCA0.CTL.BIT.ECM1		= 0;								/* エンコーダクリアモードビット 1				*/
																/* 0:タイマカウンタ値とENCAnCCR1の設定値が一致した時、カウンタクリアしない	*/
																/* 1:タイマカウンタ値とENCAnCCR1の設定値が一致した時、カウンタクリアする	*/
																/* 注） ENCAnCRM1 = 0 のときにのみ有効			*/
	ENCA0.CTL.BIT.ECM0		= 1;								/* エンコーダクリアモードビット 0				*/
																/* 0:タイマカウンタ値とENCAnCCR0の設定値が一致した時、カウンタクリアしない	*/
																/* 1:タイマカウンタ値とENCAnCCR0の設定値が一致した時、カウンタクリアする	*/
																/* 注） ENCAnCRM0 = 0 のときにのみ有効			*/

	ENCA0.CTL.BIT.UDS		= 3;								/* UP/DOWNカウント選択ビット					*/
																/* 3:両エッジカウントし、エッジ検出された端子とレベルのからUP/DOWNを決定	*/

	/*  ENCAn I/O 制御レジスタ0	*/
	ENCA0.IOC0.BIT.TIS32	= 0;								/* キャプチャトリガ 1 の入力エッジ選択			*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnCRM1=1かつENCAnCTS=0の時有効		*/
																
	ENCA0.IOC0.BIT.TIS10	= 0;								/* キャプチャトリガ 0 の入力エッジ選択			*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnCRM0=1かつENCAnCTS=0の時有効		*/																
																 
	/*  ENCAn I/O 制御レジスタ1	*/
	ENCA0.IOC1.BIT.SCE		= 0;								/* エンコーダ特殊クリアイネーブルビット			*/
	ENCA0.IOC1.BIT.ZCL		= 0;								/* 0:Z相LOWアクティブクリア/1:Z相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	ENCA0.IOC1.BIT.BCL		= 0;								/* 0:B相LOWアクティブクリア/1:B相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	ENCA0.IOC1.BIT.ACL		= 0;								/* 0:A相LOWアクティブクリア/1:A相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	
	ENCA0.IOC1.BIT.ECS		= 1;								/* エンコーダクリア入力エッジ選択						*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnSCE = 0 のときにのみ有効			*/
	
	ENCA0.IOC1.BIT.EIS		= 0;								/* エンコーダ入力エッジ選択						*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnUDS = 0/1 のときにのみ有効			*/

	/* キャプチャ/コンペアレジスタ0初期化	*/
	ENCA0.CCR0 				= u2_cnt_max;						/* カウンタ最大値								*/
	__u2_enca0_cnt_max		= u2_cnt_max;

	/* キャプチャ/コンペアレジスタ1初期化	*/
	ENCA0.CCR1 = 0;												/* 割り込み位置									*/
	
	/* カウンタ初期化						*/
	ENCA0.CNT = 0;
	
	
	switch ( u1_src_abz )
	{
		case 0:													/* 端子入力										*/
			PIC1A.REG30.BIT.REG3022	= 0;
			PIC1A.REG30.BIT.REG3017 = 0;
			PIC1A.REG30.BIT.REG3016	= 0;
			PIC1A.REG30.BIT.REG3001 = 0;
			PIC1A.REG30.BIT.REG3000	= 0;
			PORT.PCR0_6.UINT32 = 0x00000052 ;					/* P06/ENCA0E0									*/
			PORT.PCR0_7.UINT32 = 0x00000052 ;					/* P07/ENCA0E1									*/
			PORT.PCR0_8.UINT32 = 0x00000052 ;					/* P08/ENCA0EC									*/			
		break;
		case 1:													/* RDC20からの入力								*/
			PIC1A.REG30.BIT.REG3022	= 0;
			PIC1A.REG30.BIT.REG3017 = 0;
			PIC1A.REG30.BIT.REG3016	= 1;
			PIC1A.REG30.BIT.REG3001 = 0;
			PIC1A.REG30.BIT.REG3000	= 0;
		break;
		case 3:													/* 端子入力	(ENCA1Ex端子）							*/
			PIC1A.REG30.BIT.REG3022	= 1;
			PIC1A.REG30.BIT.REG3020 = 0;
			PIC1A.REG30.BIT.REG3019	= 0;
			
			PORT.PCR4_11.UINT32 = 0x00000052 ;					/* P4_11/ENCA1E0									*/
			PORT.PCR4_12.UINT32 = 0x00000052 ;					/* P4_12/ENCA1E1									*/
			PORT.PCR4_13.UINT32 = 0x00000052 ;					/* P4_13/ENCA1EC									*/	
			
		break;

		default:
		break;
		
	}
}

/*==============================================================*/
/*	ENCA0 カウンタ値リード関数									*/
/*			u1 u1_fwrev_mode	: 0:カウンタ値をそのままRead	*/
/*								  1:CCR0からCNTを引いた値		*/
/*                                  をRead						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*																*/
/*==============================================================*/
u2 u2_enca0_cnt_read( u1 u1_fwrev_mode )
{
	u2	t_u2_cnt ;
	
	if ( 0 == u1_fwrev_mode )									/* 正											*/
	{
		t_u2_cnt = ENCA0.CNT ;
	}
	else														/* 逆											*/
	{
		if ( 0 == ENCA0.CNT )
		{
			t_u2_cnt = 0 ;
		}
		{
			t_u2_cnt = ((ENCA0.CCR0+1) - ENCA0.CNT);
		}
	}
	return(t_u2_cnt);
}

/*=============================================================*/
void enca0_stop( void )
{
	/* エンコーダ停止	*/
	ENCA0.TT.BIT.TT			= 1;								/* タイマストップトリガビット					*/
																/* 0:何もしない/1:タイマ停止					*/
}

/*=============================================================*/
void enca0_start( void )
{
	/* エンコーダスタート	*/
	ENCA0.TS.BIT.TS			= 1;								/* タイマスタートトリガビット					*/
																/* 0:何もしない/1:タイマスタート				*/
}

/*==============================================================*/
/*	ENCA0 カウンタ値設定関数									*/
/*			u2 u2_cnt_set		:割り込みレベル					*/
/*			u1 u1_fwrev_mode	: 0:u2_cnt_setをそのまま設定	*/
/*								  1:CCR0からu2_cnt_setを引いた値*/
/*                                  を設定						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*																*/
/*==============================================================*/
void enca0_cnt_set( u2 u2_cnt_set , u1 u1_fwrev_mode )
{
	if( 0 == ENCA0.TE.BIT.TE )									/* タイマ停止中									*/
	{
		if ( 0 == u1_fwrev_mode )								/* 正											*/
		{
			ENCA0.CNT = u2_cnt_set	;
		}
		else													/* 逆											*/
		{
			if ( 0 == u2_cnt_set )
			{
				ENCA0.CNT = 0 ;
			}
			else
			{
				ENCA0.CNT = ((ENCA0.CCR0+1) - u2_cnt_set);
			}
		}	
	}
	else{}														/* カウント中は、書き込み禁止					*/
}

/*==============================================================*/
/*	ENCA0 コンペア1設定関数										*/
/*			u2 u2_cnt_set		:割り込みレベル					*/
/*			u1 u1_fwrev_mode	: 0:u2_cnt_setをそのまま設定	*/
/*								  1:CCR0からu2_cnt_setを引いた値*/
/*                                  を設定						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*																*/
/*==============================================================*/
void enca0_ccr1_set( u2 u2_cnt_set , u1 u1_fwrev_mode )
{
	
	if ( 0 == u1_fwrev_mode )									/* 正											*/
	{
		ENCA0.CCR1 = u2_cnt_set ;
	}
	else														/* 逆											*/
	{
		if ( 0 == u2_cnt_set )
		{
			ENCA0.CCR1 = 0 ;
		}
		else
		{
			ENCA0.CCR1 = ((ENCA0.CCR0+1) - u2_cnt_set);
		}
	}
}
/*==============================================================*/
/*	ENCA0 割り込み設定関数										*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			出力ピン											*/
/*==============================================================*/
void enca0_init_interrupt( u1 u1_intlv , u1 u1_intcpu)
{
	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD119.BIT.GPID	= 1;						/* CPU2にバインド									*/
		INTC2.EIBD119.BIT.PEID	= 2;						/* CPU2にバインド									*/	
	}
	else
	{
		INTC2.EIBD119.BIT.GPID	= 0;						/* CPU1にバインド									*/
		INTC2.EIBD119.BIT.PEID	= 1;						/* CPU1にバインド									*/	
	}
	
	if( u1_intlv < 16 )
	{
		INTC2.EIC119.BIT.EIRF119	= 0 ;					/* 割り込みフラグクリア								*/
		INTC2.EIC119.BIT.EIP119		= u1_intlv ;			/* 割り込みレベル設定								*/
		INTC2.EIC119.BIT.EITB119	= 1;					/* テーブル参照方式									*/
//		INTC2.EIC119.BIT.EITB119	= 0;					/* 直接分岐方式										*/
		INTC2.EIC119.BIT.EIMK119	= 0 ;					/* 割り込みマスククリア								*/
	}
	else
	{
		INTC2.EIC119.BIT.EIMK119	= 1 ;					/* 割り込みマスク設定								*/	
	}

}

