/*===============================================================
+																+
+			Title:	 AMDTCTRL-C1Hソフトウェア				    +
+																+
+				date:		1th Apri,2017						+
+																+
+  	 	Copyright (C) Aoyama Motor Drive Technology    2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"iodefine.h"										/* 周辺定義ヘッダファイル						*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
/* ライブラリ/デバッグ関係		*/

/* 	端子選択				*/
#define		HALL_PORTSEL		(1)								/* 0: P4_11/12/13								*/
																/* 1: P0_6/7/8									*/
/*=============================================================*/

/*==============================================================*/
/*	キャプチャタイマ初期化関数									*/
/*	引数：なし													*/
/*			使用周辺機能										*/
/*		HALL_PORTSEL = 0										*/
/*					P4_11/ENCA1E0								*/
/*					P4_12/ENCA1E1								*/
/*					P4_13/ENCA1EC								*/
/*					TSG31/ENCA1/TAUD1_CH2  						*/
/*		HALL_PORTSEL = 1										*/
/*					P0_6/ENCA0E0								*/
/*					P0_7/ENCA0E1								*/
/*					P0_8/ENCA0EC								*/
/*					TSG30/ENCA0/TAUD1_CH2  						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*					HALLセンサI/Fとして使用				        */
/*  信号の流れ													*/
/*		HALL_PORTSEL = 0										*/
/*			PTSIx -> TSG31 -> ENCA1 -> TAUD1 CH2				*/
/*		HALL_PORTSEL = 1										*/
/*			PTSIx -> TSG30 -> ENCA0 -> TAUD0 CH2				*/
/*				TAUD1 CH2のプリスケーラクロック CK0を選択		*/
/*                 80MHz/32 = 2.5MHz = 0.4uS					*/
/*																*/
/*--------------------------------------------------------------*/
void hallcapture_init( void )
{
#if 0 == HALL_PORTSEL
/* === PICA1 設定 === */
    /* ENC端子->TSG31 */
    PIC1A.TSGHALLSEL.BIT.TSG1HALLSEL = 1;  /* ENCA1Ex端子をTSG31PTSI0-2に設定     */
    PIC1A.REG51.BIT.REG5100          = 1;  /* 同上                                */

    /* TSG31 -> ENCA1 */
    PIC1A.REG30.BIT.REG3007          = 1;   /* ENCA1E0にTSG31のTS1PECを接続       */
    PIC1A.REG30.BIT.REG3006          = 0;   /* 同上                               */
    
    PIC1A.REG30.BIT.REG3009          = 1;   /* ENCA1E1にTSG31のTS1PUDを接続       */
    PIC1A.REG30.BIT.REG3008          = 0;   /* 同上                               */   
    
    /* ENCA1(EQ0) -> TAUD1_CH2 */
    PIC1A.REG31.BIT.REG3122          = 0;   /* TAUD1 CH2にENCAT1EQ0のDT出力信号を接続   */
    PIC1A.REG31.BIT.REG3121          = 1;
    
	
/* === TSG31 設定 === */
	TSG31.CTL0.BIT.DWD 		= 0;
	TSG31.CTL0.BIT.MD  		= 1;			/* 	HT-PWMモード								*/

    TSG31.CTL3.UINT8        = 0;
    TSG31.CTL4.UINT32       = 0;
    
    TSG31.IOC0.UINT8        = 0x7E;
    TSG31.IOC1.BIT.PTS      = 1;            /* TSG3nPTSI0-2 のエッジ検出でトグル信号の出力を許可*/
                                            /* TSG3nPTE/TSG3nPEC                                */
    TSG31.IOC2.UINT16       = 0;
    
    TSG31.OPT0.UINT8        = 0;
    TSG31.OPT1.UINT8        = 0;

    TSG31.CMP0              = 0;
    TSG31.CMP1W.UINT32      = 0;
    TSG31.CMP5W.UINT32      = 0;
    TSG31.CMP9W.UINT32      = 0;
    TSG31.CMP1              = 0;
    TSG31.CMP5              = 0;
    TSG31.CMP9              = 0;
    TSG31.PAT0W.UINT32      = 0;
    TSG31.PAT1W.UINT32      = 0;
    
    TSG31.DTC0W.UINT32      = 0;
    TSG31.DTC0W.UINT32      = 0;


/* === ENCA1 設定	=== */
	/* エンコーダ停止	*/
	ENCA1.TT.BIT.TT			= 1;								/* タイマストップトリガビット					*/
																/* 0:何もしない/1:タイマ停止					*/

	/* ENCAn制御レジスタ	*/
	ENCA1.CTL.BIT.CME		= 1;								/* エンコーダクリアマスクイネーブルビット		*/
																/* 0:ENCAnCCR1 コンペア一致割り込みマスク無効	*/
																/* 1:割り込みマスク有効							*/
																/* 注）ENCAnCRM1=1の時，1設定禁止				*/
																
	ENCA1.CTL.BIT.MCS		= 0;								/* 	エンコーダマスククリア選択					*/
																/* 0:ENCAnCCR1の書き込みした時，コンペア一致割り込み検出のマスクを無効にする	*/
																/* 1: エンコーダクリア入力によるタイマカウンタクリア動作時						*/
																/*	  ENCAnECM0 = 1 のときに ENCAnCNT と ENCAnCCR0 がコンペア一致時のタイマカウンタクリア動作時	*/
																/*    ENCAnLDE = 1 のときのアンダフローの検出による ENCAnCCR0 からタイマカウンタへのロード時	*/
																/*    マスクを無効にする														*/
																/* 注） ENCAnCRM1 = 0 のときにのみ有効			*/
																
	ENCA1.CTL.BIT.CRM1		= 0;								/* 0: CCR1コンペアレジスタ/1:キャプチャレジスタ	*/
	ENCA1.CTL.BIT.CRM0		= 0;								/* 0: CCR0コンペアレジスタ/1:キャプチャレジスタ	*/
	
	ENCA1.CTL.BIT.CTS		= 0;								/* ENCAnCCR1キャプチャトリガ選択ビット		*/
																/* 0:ENCAnI1をENCAnCCR1レジスタへのキャプチャトリガとする	*/
																/* 1:ENCAnECをENCAnCCR1レジスタへのキャプチャトリガとする	*/
																/* 注）ENCAnCRM1 = 1の時有効					*/
																
	ENCA1.CTL.BIT.LDE		= 1;								/* ENCAn カウンタロードイネーブルビット			*/
																/* 0:カウンタのアンダフロー時、 ENCAnCCR0レジスタの設定値をリロードしない	*/
																/* 1:カウンタのアンダフロー時、 ENCAnCCR0レジスタの設定値をリロードする		*/
																/* 注） ENCAnCRM0 = 0のときにのみ有効			*/
	ENCA1.CTL.BIT.ECM1		= 0;								/* エンコーダクリアモードビット 1				*/
																/* 0:タイマカウンタ値とENCAnCCR1の設定値が一致した時、カウンタクリアしない	*/
																/* 1:タイマカウンタ値とENCAnCCR1の設定値が一致した時、カウンタクリアする	*/
																/* 注） ENCAnCRM1 = 0 のときにのみ有効			*/
	ENCA1.CTL.BIT.ECM0		= 1;								/* エンコーダクリアモードビット 0				*/
																/* 0:タイマカウンタ値とENCAnCCR0の設定値が一致した時、カウンタクリアしない	*/
																/* 1:タイマカウンタ値とENCAnCCR0の設定値が一致した時、カウンタクリアする	*/
																/* 注） ENCAnCRM0 = 0 のときにのみ有効			*/

	ENCA1.CTL.BIT.UDS		= 0;								/* UP/DOWNカウント選択ビット					*/


	/*  ENCAn I/O 制御レジスタ0	*/
	ENCA1.IOC0.BIT.TIS32	= 0;								/* キャプチャトリガ 1 の入力エッジ選択			*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnCRM1=1かつENCAnCTS=0の時有効		*/
																
	ENCA1.IOC0.BIT.TIS10	= 0;								/* キャプチャトリガ 0 の入力エッジ選択			*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnCRM0=1かつENCAnCTS=0の時有効		*/																
																 
	/*  ENCAn I/O 制御レジスタ1	*/
	ENCA1.IOC1.BIT.SCE		= 0;								/* エンコーダ特殊クリアイネーブルビット			*/
	ENCA1.IOC1.BIT.ZCL		= 0;								/* 0:Z相LOWアクティブクリア/1:Z相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	ENCA1.IOC1.BIT.BCL		= 0;								/* 0:B相LOWアクティブクリア/1:B相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	ENCA1.IOC1.BIT.ACL		= 0;								/* 0:A相LOWアクティブクリア/1:A相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	
	ENCA1.IOC1.BIT.ECS		= 1;								/* エンコーダクリア入力エッジ選択						*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnSCE = 0 のときにのみ有効			*/
	
	ENCA1.IOC1.BIT.EIS		= 3;								/* エンコーダ入力エッジ選択						*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnUDS = 0/1 のときにのみ有効			*/

	ENCA1.CCR0 = 0;
	ENCA1.CCR1 = 1;
	ENCA1.CNT  = 0;
    
	/* 端子設定 */
	PORT.PCR4_11.UINT32 = 0x00000052 ;					/* P4_11/ENCA1E0									*/
	PORT.PCR4_12.UINT32 = 0x00000052 ;					/* P4_12/ENCA1E1									*/
	PORT.PCR4_13.UINT32 = 0x00000052 ;					/* P4_13/ENCA1EC									*/	
	
/* === TAUD1 CH2設定 ===*/

	/*-------------------------------------------------*/
	/* 　TAUD1 CH2停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 4;						/* CH2 STOP					*/


	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR2              = 0;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
	TAUD1.CMOR2.UINT16       = 0x81C4;
												/* BitName	 Bit     SetValue        			*/
												/* TAUAnCKS  15-14 ->0:Prescaler Output = CK2 	*/
												/* TAUAnCCS  13-12 ->0:Count Clock = Prescaler 	*/
												/* TAUAnMAS     11 ->0:Slave  					*/
												/* TAUAnSTS  10- 8 ->001:有効エッジをトリガ 	*/
												/* TAUAnCOS   7- 6 ->11:オーバーフロー時にOVFSet*/
												/* 						かつFFFFFFFFHにCDR固定	*/
												/* -			 5 ->設定無し					*/
												/* TAUAnMD    4- 1 ->0010:CaptureMode			*/
												/* TAUAnMD0		 0 ->0:スタート時割り込み発生無 */
	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR2.UINT8 = 0x02; 							/* TAUAnTTINm using edge: 両エッジ				*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC2.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x4;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x4;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x4;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x4;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x4;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x4;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x4;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x4;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x4;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x4;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x4;						/* 変調禁止							*/
	/*====================================================*/

#elif 1 == HALL_PORTSEL
/* === PICA1 設定 === */
    /* ENC端子->TSG30 */
    PIC1A.TSGHALLSEL.BIT.TSG0HALLSEL = 1;  /* ENCA0Ex端子をTSG30PTSI0-2に設定     */
    PIC1A.REG50.BIT.REG5000          = 0;  /* 同上                                */

    /* TSG30 -> ENCA0 */
    PIC1A.REG30.BIT.REG3022          = 0;   /* ENCA0E0にTSG30のTS1PECを接続       */
    
    PIC1A.REG30.BIT.REG3001          = 1;   /* ENCA0E1にTSG30のTS1PUDを接続       */
    PIC1A.REG30.BIT.REG3000          = 1;   /* 同上                               */   
 
    /* ENCA0(EQ0) -> TAUD0_CH2 */
    PIC1A.REG31.BIT.REG3113          = 0;   /* TAUD0 CH2にENCAT0EQ0のDT出力信号を接続   */
    PIC1A.REG31.BIT.REG3112          = 1;

/* === TSG30 設定 === */

    TSG30.IOC1.BIT.PTS      = 1;            /* TSG3nPTSI0-2 のエッジ検出でトグル信号の出力を許可*/
                                            // /* TSG3nPTE/TSG3nPEC                                */
/* === ENCA0 設定	=== */
	/* エンコーダ停止	*/
	ENCA0.TT.BIT.TT			= 1;								/* タイマストップトリガビット					*/
																/* 0:何もしない/1:タイマ停止					*/

	/* ENCAn制御レジスタ	*/
	ENCA0.CTL.BIT.CME		= 1;								/* エンコーダクリアマスクイネーブルビット		*/
																/* 0:ENCAnCCR1 コンペア一致割り込みマスク無効	*/
																/* 1:割り込みマスク有効							*/
																/* 注）ENCAnCRM1=1の時，1設定禁止				*/
																
	ENCA0.CTL.BIT.MCS		= 0;								/* 	エンコーダマスククリア選択					*/
																/* 0:ENCAnCCR1の書き込みした時，コンペア一致割り込み検出のマスクを無効にする	*/
																/* 1: エンコーダクリア入力によるタイマカウンタクリア動作時						*/
																/*	  ENCAnECM0 = 1 のときに ENCAnCNT と ENCAnCCR0 がコンペア一致時のタイマカウンタクリア動作時	*/
																/*    ENCAnLDE = 1 のときのアンダフローの検出による ENCAnCCR0 からタイマカウンタへのロード時	*/
																/*    マスクを無効にする														*/
																/* 注） ENCAnCRM1 = 0 のときにのみ有効			*/
																
	ENCA0.CTL.BIT.CRM1		= 0;								/* 0: CCR1コンペアレジスタ/1:キャプチャレジスタ	*/
	ENCA0.CTL.BIT.CRM0		= 0;								/* 0: CCR0コンペアレジスタ/1:キャプチャレジスタ	*/
	
	ENCA0.CTL.BIT.CTS		= 0;								/* ENCAnCCR1キャプチャトリガ選択ビット		*/
																/* 0:ENCAnI1をENCAnCCR1レジスタへのキャプチャトリガとする	*/
																/* 1:ENCAnECをENCAnCCR1レジスタへのキャプチャトリガとする	*/
																/* 注）ENCAnCRM1 = 1の時有効					*/
																
	ENCA0.CTL.BIT.LDE		= 1;								/* ENCAn カウンタロードイネーブルビット			*/
																/* 0:カウンタのアンダフロー時、 ENCAnCCR0レジスタの設定値をリロードしない	*/
																/* 1:カウンタのアンダフロー時、 ENCAnCCR0レジスタの設定値をリロードする		*/
																/* 注） ENCAnCRM0 = 0のときにのみ有効			*/
	ENCA0.CTL.BIT.ECM1		= 0;								/* エンコーダクリアモードビット 1				*/
																/* 0:タイマカウンタ値とENCAnCCR1の設定値が一致した時、カウンタクリアしない	*/
																/* 1:タイマカウンタ値とENCAnCCR1の設定値が一致した時、カウンタクリアする	*/
																/* 注） ENCAnCRM1 = 0 のときにのみ有効			*/
	ENCA0.CTL.BIT.ECM0		= 1;								/* エンコーダクリアモードビット 0				*/
																/* 0:タイマカウンタ値とENCAnCCR0の設定値が一致した時、カウンタクリアしない	*/
																/* 1:タイマカウンタ値とENCAnCCR0の設定値が一致した時、カウンタクリアする	*/
																/* 注） ENCAnCRM0 = 0 のときにのみ有効			*/

	ENCA0.CTL.BIT.UDS		= 0;								/* UP/DOWNカウント選択ビット					*/


	/*  ENCAn I/O 制御レジスタ0	*/
	ENCA0.IOC0.BIT.TIS32	= 0;								/* キャプチャトリガ 1 の入力エッジ選択			*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnCRM1=1かつENCAnCTS=0の時有効		*/
																
	ENCA0.IOC0.BIT.TIS10	= 0;								/* キャプチャトリガ 0 の入力エッジ選択			*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnCRM0=1かつENCAnCTS=0の時有効		*/																
																 
	/*  ENCAn I/O 制御レジスタ1	*/
	ENCA0.IOC1.BIT.SCE		= 0;								/* エンコーダ特殊クリアイネーブルビット			*/
	ENCA0.IOC1.BIT.ZCL		= 0;								/* 0:Z相LOWアクティブクリア/1:Z相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	ENCA0.IOC1.BIT.BCL		= 0;								/* 0:B相LOWアクティブクリア/1:B相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	ENCA0.IOC1.BIT.ACL		= 0;								/* 0:A相LOWアクティブクリア/1:A相HIアクティブクリア*/
																/* 注）ENCAnSCE = 1 のときにのみ有効			*/
	
	ENCA0.IOC1.BIT.ECS		= 1;								/* エンコーダクリア入力エッジ選択						*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnSCE = 0 のときにのみ有効			*/
	
	ENCA0.IOC1.BIT.EIS		= 3;								/* エンコーダ入力エッジ選択						*/
																/* 0:エッジ検出なし/1:立ち上がり/2:立下り/3:両エッジ	*/
																/* 注）ENCAnUDS = 0/1 のときにのみ有効			*/

	ENCA0.CCR0 = 0;
	ENCA0.CCR1 = 1;
	ENCA0.CNT  = 0;
    
	/* 端子設定 */
	PORT.PCR0_6.UINT32 = 0x00000052 ;					/* P06/ENCA0E0									*/
	PORT.PCR0_7.UINT32 = 0x00000052 ;					/* P07/ENCA0E1									*/
	PORT.PCR0_8.UINT32 = 0x00000052 ;					/* P08/ENCA0EC									*/

/* === TAUD0 CH2設定 ===*/

	/*-------------------------------------------------*/
	/* 　TAUD0 CH2停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 4;						/* CH2 STOP					*/


	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR2              = 0;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
	TAUD0.CMOR2.UINT16       = 0x81C4;
												/* BitName	 Bit     SetValue        			*/
												/* TAUAnCKS  15-14 ->0:Prescaler Output = CK2 	*/
												/* TAUAnCCS  13-12 ->0:Count Clock = Prescaler 	*/
												/* TAUAnMAS     11 ->0:Slave  					*/
												/* TAUAnSTS  10- 8 ->001:有効エッジをトリガ 	*/
												/* TAUAnCOS   7- 6 ->11:オーバーフロー時にOVFSet*/
												/* 						かつFFFFFFFFHにCDR固定	*/
												/* -			 5 ->設定無し					*/
												/* TAUAnMD    4- 1 ->0010:CaptureMode			*/
												/* TAUAnMD0		 0 ->0:スタート時割り込み発生無 */
	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR2.UINT8 = 0x02; 							/* TAUAnTTINm using edge: 両エッジ				*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC2.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x4;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x4;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x4;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x4;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x4;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x4;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x4;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x4;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x4;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x4;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x4;						/* 変調禁止							*/
	/*====================================================*/
#else
	ERROR
#endif


}

/*==============================================================*/
/*	キャプチャタイマ割り込みレベル設定							*/
/*	引数：														*/
/*			u1  u1_intlv	:割り込みレベル						*/
/*	　　　　使用周辺機能	TAUD1/CH2	or 	TAUD0/CH2			*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			TAUD1 CH2割り込み設定								*/
/*			ホールセンサ割り込みとして使用						*/
/*==============================================================*/
void hallcapture_int_init( u1 u1_intlv , u1 u1_intcpu )
{
#if 0 == HALL_PORTSEL
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD100.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD100.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD100.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD100.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC100.BIT.EIRF100	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC100.BIT.EIP100		= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC100.BIT.EITB100	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC100.BIT.EITB100	= 0;						/* 直接分岐方式						*/
		INTC2.EIC100.BIT.EIMK100	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC100.BIT.EIMK100	= 1 ;						/* 割り込みマスク					*/
	}
#elif 1 == HALL_PORTSEL
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD84.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD84.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD84.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD84.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC84.BIT.EIRF84	= 0 ;							/* 割り込みフラグクリア				*/
		INTC2.EIC84.BIT.EIP84	= u1_intlv ;					/* 割り込みレベル設定				*/
		INTC2.EIC84.BIT.EITB84	= 1;							/* テーブル参照方式					*/
//		INTC2.EIC84.BIT.EITB84	= 0;							/* 直接分岐方式						*/
		INTC2.EIC84.BIT.EIMK84	= 0 ;							/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC84.BIT.EIMK84	= 1 ;							/* 割り込みマスク					*/
	}

#else
	ERROR
#endif

}

/*==============================================================*/
/*	キャプチャタイマカウント開始関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			TSG31/ENCA1/TAUD1 CH2スタート						*/
/*					or 											*/
/*			TSG30/ENCA0/TAUD0 CH2スタート						*/
/*==============================================================*/
void hallcapture_tim_start (void)
{
#if 0 == HALL_PORTSEL
// RH850は、TSG31をスタートさせないと使用できない
	TSG31.TRG0.BIT.TS       = 1;					/* TSG31スタート						*/
	ENCA1.TS.BIT.TS			= 1;                    /* エンコーダタイマスタート             */	
    TAUD1.TS.UINT16         = 4;	                /* TAUD1 CH2スタート                    */
#elif 1 == HALL_PORTSEL
// RH850は、TSG30をスタートさせないと使用できない
	TSG30.TRG0.BIT.TS       = 1;					/* TSG30スタート						*/
	ENCA0.TS.BIT.TS			= 1;                    /* エンコーダタイマスタート             */	
    TAUD0.TS.UINT16         = 4;	                /* TAUD0 CH2スタート                    */

#else
	ERROR
#endif


}

/*==============================================================*/
/*	キャプチャタイマカウント停止関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			TSG31/ENCA1/TAUD1 CH2停止							*/
/*					or 											*/
/*			ENCA0/TAUD0 CH2停止									*/
/*==============================================================*/
void hallcapture_tim_stop(void)
{
#if 0 == HALL_PORTSEL
	TSG31.TRG1.BIT.TT       = 1;					/* TSG31停止							*/
	ENCA1.TT.BIT.TT			= 1;                    /* エンコーダ停止	                    */
	TAUD1.TT.UINT16         = 4;
#elif 1 == HALL_PORTSEL
//	TSG30.TRG1.BIT.TT       = 1;					/* TSG30停止させない					*/
	ENCA0.TT.BIT.TT			= 1;                    /* エンコーダ停止	                    */
	TAUD0.TT.UINT16         = 4;
#else
	ERROR
#endif
}


/*==============================================================*/
/*	TAUD1 CH2 or TAUD0 CH2キャプチャ値取得関数					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			キャプチャ割り込み内で読み出す事					*/
/*==============================================================*/
u2 hallcapture_cnt_read(void)
{
#if 0 == HALL_PORTSEL
	return(TAUD1.CDR2);
#elif 1 == HALL_PORTSEL
	return(TAUD0.CDR2);
#else
	ERROR
#endif
}


/*==============================================================*/
/*	TAUD1 CH2 or TAUD0 CH2オーバーフローフラグ取得関数			*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*==============================================================*/
u1 u1_ov_status(void)
{
	u1 u1_temp_1;
	
#if 0 == HALL_PORTSEL
	if ( 1 == (TAUD1.CSR2.BIT.OVF ))
	{
		u1_temp_1 = 1;
		TAUD1.CSC2.BIT.CLOV = 1;					/* 読み出したので、OverFlowFlag Clear	*/
	} 
	else
	{
		u1_temp_1 = 0;
	}
	return ( u1_temp_1 );
#elif 1 == HALL_PORTSEL
	if ( 1 == (TAUD0.CSR2.BIT.OVF ))
	{
		u1_temp_1 = 1;
		TAUD0.CSC2.BIT.CLOV = 1;					/* 読み出したので、OverFlowFlag Clear	*/
	} 
	else
	{
		u1_temp_1 = 0;
	}
	return ( u1_temp_1 );
#else
	ERROR
#endif
}

/*==============================================================*/
/*	ホールセンサ値読み込み関数									*/
/*	戻り値				bit2 bit1 bit0							*/
/*						 H3   H2   H1							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*    注意！！ 割り込み禁止で読み出す事							*/
/*			H1:P4_11			H1:P0_6							*/
/*			H2:P4_12	or		H2:P0_7							*/
/*			H3:P4_13			H3:P0_8							*/
/*==============================================================*/
u1	u1_hall_read(void)
{
#if 0 == HALL_PORTSEL
	return( ( PORT.PPR4.UINT16 >>11) & 0x07 ); /* H1:P4_11 H2:P4_12 H3:P4_13 */
#elif 1 == HALL_PORTSEL
	return( ( PORT.PPR0.UINT16 >>6) & 0x07 ); /* H1:P0_6 H2:P0_7 H3:P0_8 */
#else
	ERROR
#endif
}
