/*===============================================================
+																+
+			Title:	 AMDTCTRL-C1Hソフトウェア				    +
+																+
+				date:		1th Apri,2017						+
+																+
+  	 	Copyright (C) Aoyama Motor Drive Technology    2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"iodefine.h"										/* 周辺定義ヘッダファイル						*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
/* ライブラリ/デバッグ関係		*/
/*=============================================================*/

/*=============================================================*/
/*					  iolib共通変数定義						　 */
/*=============================================================*/
u2		__u2_stopwatch_cnt_start;
u2		__u2_stopwatch_cnt_stop;
/*=============================================================*/

/*==============================================================*/
/*	TAUD0用クロック初期化関数									*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*			制御タイマ：TAUD0									*/
/*			CK0	= CLKC_HSB										*/
/*			CK1 = CLKC_HSB/2^1									*/
/*			CK2 = CLKC_HSB/2^3									*/
/*			CK3_PRE = CLKC_HSB									*/
/*			CK3	= 1MHzになるように設定							*/
/*			TAUD0が停止中に実行の事								*/
/*--------------------------------------------------------------*/
void	taud0prescale_0_2_8_0_init(void)
{
	/*-------------------------------------------------*/
	/* Set Clock Frequency                             */
	/*-------------------------------------------------*/
	TAUD0.TPS.UINT16 = 0x0310;			/* Prescaler Clock Select */

/*							CK3_PRE[15-12] = PCLK/2^0
							CK2[11- 8]     = PCLK/2^3
							CK1[ 7- 4]     = PCLK/2^1
							CK0[ 3- 0]     = PCLK/2^0
*/
	/*-------------------------------------------------*/
	/* Set Baudrate  CK3 = CK3PRE/BRS                  */
	/*-------------------------------------------------*/
	TAUD0.BRS			= (u4)(__CLKC_HSB)-1;		/* CK3_PRE/(TAUD0BRS+1)=1MHz */
	
}

/*==============================================================*/
/*	TAUD0用クロック初期化関数									*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*			制御タイマ：TAUD0									*/
/*			CK0	= CLKC_HSB										*/
/*			CK1 = CLKC_HSB/2^1									*/
/*			CK2 = CLKC_HSB/2^6									*/
/*			CK3_PRE = CLKC_HSB									*/
/*			CK3	= 1MHzになるように設定							*/
/*			TAUD0が停止中に実行の事								*/
/*--------------------------------------------------------------*/
void	taud0prescale_0_2_64_0_init(void)
{
	/*-------------------------------------------------*/
	/* Set Clock Frequency                             */
	/*-------------------------------------------------*/
	TAUD0.TPS.UINT16 = 0x0610;			/* Prescaler Clock Select */

/*							CK3_PRE[15-12] = PCLK/2^0
							CK2[11- 8]     = PCLK/2^3
							CK1[ 7- 4]     = PCLK/2^1
							CK0[ 3- 0]     = PCLK/2^0
*/
	/*-------------------------------------------------*/
	/* Set Baudrate  CK3 = CK3PRE/BRS                  */
	/*-------------------------------------------------*/
	TAUD0.BRS			= (u4)(__CLKC_HSB)-1;		/* CK3_PRE/(TAUD0BRS+1)=1MHz */
	
}

/*==============================================================*/
/*	TAUD0全CH停止関数											*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*--------------------------------------------------------------*/
void	taud0_stop(void)
{
	TAUD0.TT.UINT16 = 0xFFFF;					/* 全TAUD0タイマ停止		*/
}

/*==============================================================*/
/*	インターバルタイマ0初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH0				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/

/*=============================================================*/
/*	TAUD0初期化関数（タイマ割り込み）						   */
/*=============================================================*/
void interval00_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH0停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 1;						/* CH0 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR0 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT0 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMOR0.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR0.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR0.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR0.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR0.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR0.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD0.CMOR0.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR0.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC0.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x1;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x1;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x1;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel  Output Level Register   		       */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x1;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x1;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x1;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x1;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x1;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x1;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x1;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x0001;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD82.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD82.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD82.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD82.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC82.BIT.EIRF82	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC82.BIT.EIP82	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC82.BIT.EITB82	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC82.BIT.EITB82	= 0;						/* 直接分岐方式						*/
		INTC2.EIC82.BIT.EIMK82	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC82.BIT.EIMK82	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ0スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH0				*/
/*--------------------------------------------------------------*/
void interval00_start(void)
{
	/* TAUD0(Interval Timer) Start			*/
	TAUD0.TS.UINT16 = 1;		
}

/*==============================================================*/
/*　インターバルタイマ0停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH0				*/
/*--------------------------------------------------------------*/
void interval00_stop(void)
{
	TAUD0.TT.UINT16 = 1;		
}

/*==============================================================*/
/*	インターバルタイマ1初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH1				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval01_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH1停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 2;						/* CH1 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR1 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT1 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMOR1.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR1.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR1.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR1.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR1.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR1.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD0.CMOR1.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR1.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC1.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x2;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x2;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x2;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x2;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x2;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x2;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x2;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x2;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x2;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x2;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x2;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD83.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD83.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD83.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD83.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC83.BIT.EIRF83	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC83.BIT.EIP83	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC83.BIT.EITB83	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC83.BIT.EITB83	= 0;						/* 直接分岐方式						*/
		INTC2.EIC83.BIT.EIMK83	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC83.BIT.EIMK83	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ1スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH1				*/
/*--------------------------------------------------------------*/
void interval01_start(void)
{
	TAUD0.TS.UINT16 = 2;		
}

/*==============================================================*/
/*　インターバルタイマ1停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH1				*/
/*--------------------------------------------------------------*/
void interval01_stop(void)
{
	TAUD0.TT.UINT16 = 2;		
}

/*==============================================================*/
/*	インターバルタイマ2初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH2				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval02_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu )
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH2停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 4;						/* CH2 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR2 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT2 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMOR2.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR2.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR2.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR2.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR2.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR2.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD0.CMOR2.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR2.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC2.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x4;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x4;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x4;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x4;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x4;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x4;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x4;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x4;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x4;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x4;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x4;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD84.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD84.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD84.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD84.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC84.BIT.EIRF84	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC84.BIT.EIP84	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC84.BIT.EITB84	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC84.BIT.EITB84	= 0;						/* 直接分岐方式						*/
		INTC2.EIC84.BIT.EIMK84	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC84.BIT.EIMK84	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ2スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH2				*/
/*--------------------------------------------------------------*/
void interval02_start(void)
{
	TAUD0.TS.UINT16 = 4;		
}

/*==============================================================*/
/*　インターバルタイマ2停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH2				*/
/*--------------------------------------------------------------*/
void interval02_stop(void)
{
	TAUD0.TT.UINT16 = 4;		
}


/*==============================================================*/
/*	インターバルタイマ3初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH3				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval03_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH3停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 8;						/* CH3 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR3 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT3 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMOR3.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR3.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR3.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR3.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR3.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR3.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD0.CMOR3.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR3.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC3.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x8;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x8;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x8;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x8;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x8;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x8;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x8;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x8;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x8;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x8;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x8;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD85.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD85.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD85.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD85.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC85.BIT.EIRF85	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC85.BIT.EIP85	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC85.BIT.EITB85	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC85.BIT.EITB85	= 0;						/* 直接分岐方式						*/
		INTC2.EIC85.BIT.EIMK85	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC85.BIT.EIMK85	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ3スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH3				*/
/*--------------------------------------------------------------*/
void interval03_start(void)
{
	TAUD0.TS.UINT16 = 8;		
}

/*==============================================================*/
/*　インターバルタイマ3停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH3				*/
/*--------------------------------------------------------------*/
void interval03_stop(void)
{
	TAUD0.TT.UINT16 = 8;		
}


/*==============================================================*/
/*	インターバルタイマ4初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH4				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval04_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH4停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 16;						/* CH4 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR4 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT4 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMOR4.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR4.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR4.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR4.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR4.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR4.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD0.CMOR4.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR4.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC4.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x10;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x10;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x10;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x10;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x10;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x10;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x10;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x10;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x10;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x10;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x10;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD86.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD86.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD86.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD86.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC86.BIT.EIRF86	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC86.BIT.EIP86	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC86.BIT.EITB86	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC86.BIT.EITB86	= 0;						/* 直接分岐方式						*/
		INTC2.EIC86.BIT.EIMK86	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC86.BIT.EIMK86	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ4スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH4				*/
/*--------------------------------------------------------------*/
void interval04_start(void)
{
	TAUD0.TS.UINT16 = 16;		
}

/*==============================================================*/
/*　インターバルタイマ4停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH4				*/
/*--------------------------------------------------------------*/
void interval04_stop(void)
{
	TAUD0.TT.UINT16 = 16;		
}


/*==============================================================*/
/*	STOPウォッチタイマ0初期化関数								*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH5				*/
/*							プリスケーラクロック CK2を選択		*/
/*	注意！！　CK2の分解能は、0.1uSになっている事				*/
/*--------------------------------------------------------------*/

/*=============================================================*/
void stopwatch0_init ( void )
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH5停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 0x20;						/* CH5 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR5 = 0xFFFF;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT5 = 0;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMOR5.BIT.CKS	= 2;						/* 動作クロック（CK2）		*/
//	TAUD0.CMOR5.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR5.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR5.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR5.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR5.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD0.CMOR5.UINT16		= 0x8000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR5.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC5.UINT8 		= 1;							/* OVFフラグクリア 				*/

/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x20;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x20;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x20;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x20;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x20;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x20;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x20;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x20;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x20;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x20;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x20;						/* 変調禁止							*/

   /*====================================================*/

	TAUD0.TS.UINT16 = 0x20;									/* CH5　スタート					*/

}

/*==============================================================*/
/*　ストップウォッチタイマスタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH5				*/
/*     フリーランタイマ　TAUD0_CH5のカウント値を退避			*/
/*--------------------------------------------------------------*/
void stopwatch0_start(void)
{
	__u2_stopwatch_cnt_start = TAUD0.CNT5;		
}

/*==============================================================*/
/*　インターバルタイマ0停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH5				*/
/*--------------------------------------------------------------*/
u2	 stopwatch0_stop(void)
{
	u2	u2_temp_1;
	
	__u2_stopwatch_cnt_stop = TAUD0.CNT5;	

	u2_temp_1 = __u2_stopwatch_cnt_start - __u2_stopwatch_cnt_stop;
	
	return ( u2_temp_1 );
	
}
/*==============================================================*/
/*	キャプチャタイマ5初期化関数									*/
/*	引数：														*/
/*			u1	u1_intlv	:割り込みレベル						*/
/*			u1	u1_level	:エッジ選択							*/
/*							0:立下り/1:立ち上がり				*/
/*			u1  u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH5				*/
/*							プリスケーラクロック CK1を選択		*/
/*	注意！！　CK1の分解能は、40MHzになっている事				*/
/*--------------------------------------------------------------*/
void freq_capture5_init ( u1 u1_intlv , u1 u1_level ,u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH5停止 				                   */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 0x0020;					/* CH5 STOP					*/
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR5	= 0x0000 ;
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT5	= 0x0000;
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMORx.BIT.CKS	= 1;						/* 動作クロック（CK1）			*/
//	TAUD0.CMORx.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMORx.BIT.MAS	= 0;						/* スレーブ						*/			
//	TAUD0.CMORx.BIT.STS	= 1;						/* 有効エッジトリガ				*/
//	TAUD0.CMORx.BIT.COS	= 0;						/*								*/	
//	TAUD0.CMORx.BIT.MD 	= 2;						/* キャプチャタイマモード		*/
//  TAUD0.CMORx.BIT.MD0 = 0;						/* 開始時に割り込みを発生しない	*/

	TAUD0.CMOR5.UINT16		= 0x41C4 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR5.UINT8 		= u1_level & 0x01; 			/* エッジ選択				 */

	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC5.UINT8 		= 1;					/* OVFフラグクリア 				*/

/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x0020;							/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x0020;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x0020;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x0020;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x0020;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x0020;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x0020;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x0020;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x0020;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x0020;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x0020;						/* 変調禁止							*/
	/*====================================================*/

	/*-------------------------------------------------*/
	/* 　TAUD0 端子設定 			                   */
	/*-------------------------------------------------*/	
	PORT.PCR3_0.UINT32	= 0x00000050;
	/*-------------------------------------------------*/	

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD87.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD87.BIT.PEID	= 2;							/* CPU1にバインド					*/
	}
	else
	{
		INTC2.EIBD87.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD87.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC87.BIT.EIRF87	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC87.BIT.EIP87	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC87.BIT.EITB87	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC87.BIT.EITB87	= 0;						/* 直接分岐方式						*/
		INTC2.EIC87.BIT.EIMK87	= 0 ;						/* 割り込みマスククリア				*/

	}
	else
	{
		INTC2.EIC87.BIT.EIMK87	= 1 ;						/* 割り込みマスク					*/
	}

}

void freq_capture5_start( void )
{
	TAUD0.TS.UINT16 = 0x20;									/* CH5　スタート					*/
}


u1 freq_capture5_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC87.BIT.EIRF87 )
	{
		u1_flag 				= 1;
		INTC2.EIC87.BIT.EIRF87 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}




/*==============================================================*/
/*	キャプチャタイマ6_11初期化関数								*/
/*	引数：														*/
/*			u1	u1_intlv	:割り込みレベル						*/
/*			u1  u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH10-15			*/
/*							プリスケーラクロック CK1を選択		*/
/*	注意！！　CK1の分解能は、40MHzになっている事				*/
/*			level_capture6_11_initとペアで使用する事			*/
/*--------------------------------------------------------------*/
void freq_capture6_11_init ( u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD0 CH6-11停止 			                   */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 0x0F30;					/* CH6-11 STOP					*/
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD0.CDR6	= 0x0000 ;
	TAUD0.CDR7	= 0x0000 ;
	TAUD0.CDR8	= 0x0000 ;
	TAUD0.CDR9	= 0x0000 ;
	TAUD0.CDR10	= 0x0000 ;
	TAUD0.CDR11	= 0x0000 ;
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD0.CNT6	= 0x0000;
	TAUD0.CNT7	= 0x0000;
	TAUD0.CNT8	= 0x0000;
	TAUD0.CNT9	= 0x0000;
	TAUD0.CNT10 = 0x0000;
	TAUD0.CNT11 = 0x0000;
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD0.CMORx.BIT.CKS	= 1;						/* 動作クロック（CK1）			*/
//	TAUD0.CMORx.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMORx.BIT.MAS	= 0;						/* スレーブ						*/			
//	TAUD0.CMORx.BIT.STS	= 1;						/* 有効エッジトリガ				*/
//	TAUD0.CMORx.BIT.COS	= 0;						/*								*/	
//	TAUD0.CMORx.BIT.MD 	= 2;						/* キャプチャタイマモード		*/
//  TAUD0.CMORx.BIT.MD0 = 0;						/* 開始時に割り込みを発生しない	*/

	TAUD0.CMOR6.UINT16		= 0x41C4 ;
	TAUD0.CMOR7.UINT16		= 0x41C4 ;
	TAUD0.CMOR8.UINT16		= 0x41C4 ;
	TAUD0.CMOR9.UINT16		= 0x41C4 ;
	TAUD0.CMOR10.UINT16		= 0x41C4 ;
	TAUD0.CMOR11.UINT16		= 0x41C4 ;
	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR6.UINT8 		= 1; 					/* 立ち上がり選択				 */
	TAUD0.CMUR7.UINT8 		= 1; 					/* 立ち上がり選択				 */
	TAUD0.CMUR8.UINT8 		= 1; 					/* 立ち上がり選択				 */
	TAUD0.CMUR9.UINT8 		= 1; 					/* 立ち上がり選択				 */
	TAUD0.CMUR10.UINT8 		= 1; 					/* 立ち上がり選択				 */
	TAUD0.CMUR11.UINT8 		= 1; 					/* 立ち上がり選択				 */
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC6.UINT8 		= 1;					/* OVFフラグクリア 				*/
	TAUD0.CSC7.UINT8 		= 1;					/* OVFフラグクリア 				*/
	TAUD0.CSC8.UINT8 		= 1;					/* OVFフラグクリア 				*/
	TAUD0.CSC9.UINT8 		= 1;					/* OVFフラグクリア 				*/
	TAUD0.CSC10.UINT8 		= 1;					/* OVFフラグクリア 				*/
	TAUD0.CSC11.UINT8 		= 1;					/* OVFフラグクリア 				*/
/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		&= ~0x0F30;							/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		&= ~0x0F30;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x0F30;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD0.TOL.UINT16		&= ~0x0F30;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x0F30;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x0F30;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x0F30;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x0F30;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x0F30;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x0F30;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x0F30;						/* 変調禁止							*/
	/*====================================================*/

	/*-------------------------------------------------*/
	/* 　TAUD0 端子設定 			                   */
	/*-------------------------------------------------*/	
	PORT.PCR0_6.UINT32	= 0x00000050;
	PORT.PCR0_7.UINT32	= 0x00000050;
	PORT.PCR0_8.UINT32	= 0x00000050;
	PORT.PCR0_9.UINT32	= 0x00000050;
	PORT.PCR0_10.UINT32	= 0x00000050;
	PORT.PCR0_11.UINT32	= 0x00000050;
	/*-------------------------------------------------*/	

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD88.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD88.BIT.PEID	= 2;							/* CPU1にバインド					*/
		INTC2.EIBD89.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD89.BIT.PEID	= 2;							/* CPU1にバインド					*/
		INTC2.EIBD90.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD90.BIT.PEID	= 2;							/* CPU1にバインド					*/
		INTC2.EIBD91.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD91.BIT.PEID	= 2;							/* CPU1にバインド					*/
		INTC2.EIBD92.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD92.BIT.PEID	= 2;							/* CPU1にバインド					*/
		INTC2.EIBD93.BIT.GPID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD93.BIT.PEID	= 2;							/* CPU1にバインド					*/
	}
	else
	{
		INTC2.EIBD88.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD88.BIT.PEID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD89.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD89.BIT.PEID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD90.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD90.BIT.PEID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD91.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD91.BIT.PEID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD92.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD92.BIT.PEID	= 1;							/* CPU1にバインド					*/
		INTC2.EIBD93.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD93.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC88.BIT.EIRF88	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC88.BIT.EIP88	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC88.BIT.EITB88	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC88.BIT.EITB88	= 0;						/* 直接分岐方式						*/
		INTC2.EIC88.BIT.EIMK88	= 0 ;						/* 割り込みマスククリア				*/
		
		INTC2.EIC89.BIT.EIRF89	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC89.BIT.EIP89	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC89.BIT.EITB89	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC89.BIT.EITB89	= 0;						/* 直接分岐方式						*/
		INTC2.EIC89.BIT.EIMK89	= 0 ;						/* 割り込みマスククリア				*/		
		
		INTC2.EIC90.BIT.EIRF90	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC90.BIT.EIP90	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC90.BIT.EITB90	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC90.BIT.EITB90	= 0;						/* 直接分岐方式						*/
		INTC2.EIC90.BIT.EIMK90	= 0 ;						/* 割り込みマスククリア				*/		
		
		INTC2.EIC91.BIT.EIRF91	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC91.BIT.EIP91	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC91.BIT.EITB91	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC91.BIT.EITB91	= 0;						/* 直接分岐方式						*/
		INTC2.EIC91.BIT.EIMK91	= 0 ;						/* 割り込みマスククリア				*/		
		
		INTC2.EIC92.BIT.EIRF92	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC92.BIT.EIP92	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC92.BIT.EITB92	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC92.BIT.EITB92	= 0;						/* 直接分岐方式						*/
		INTC2.EIC92.BIT.EIMK92	= 0 ;						/* 割り込みマスククリア				*/		
		
		INTC2.EIC93.BIT.EIRF93	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC93.BIT.EIP93	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC93.BIT.EITB93	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC93.BIT.EITB93	= 0;						/* 直接分岐方式						*/
		INTC2.EIC93.BIT.EIMK93	= 0 ;						/* 割り込みマスククリア				*/		
	}
	else
	{
		INTC2.EIC88.BIT.EIMK88	= 1 ;						/* 割り込みマスク					*/
		INTC2.EIC89.BIT.EIMK89	= 1 ;						/* 割り込みマスク					*/
		INTC2.EIC90.BIT.EIMK90	= 1 ;						/* 割り込みマスク					*/
		INTC2.EIC91.BIT.EIMK91	= 1 ;						/* 割り込みマスク					*/
		INTC2.EIC92.BIT.EIMK92	= 1 ;						/* 割り込みマスク					*/
		INTC2.EIC93.BIT.EIMK93	= 1 ;						/* 割り込みマスク					*/
		
	}

}

/*==============================================================*/
/*　キャプチャタイマ6_11スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH6-11			*/
/*--------------------------------------------------------------*/
void freq_capture6_11_start(void)
{
	/* TAUD0(CH6-11)Start			*/
	TAUD0.TS.UINT16 = 0x0FC0;		
}

/*==============================================================*/
/*　キャプチャタイマ6_11停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH16-11			*/
/*--------------------------------------------------------------*/
void  freq_capture6_11_stop(void)
{
	/* TAUD0(CH6-11)Stopt			*/
	TAUD0.TT.UINT16 = 0x0FC0;		
}


/*==============================================================*/
/*	TAUD　キャプチャタイマリード								*/
/*	引数：	なし												*/
/*	　　　　使用周辺機能	TAUD0/CH6-11,TAUD1/CH6-11			*/
/*	戻り値：													*/
/*			0 :オーバーフローなし(周期、Dutyとも)				*/
/*			1 :Dutyオーバー										*/
/*			2 :周期オバーフロー									*/
/*			3 :Dutyと周期両方オーバーフロー						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			TAUD0 CHx:Hi幅測定									*/
/*			TAUD1 CHx:周期測定									*/
/*==============================================================*/
u1	temp_capture6_read( u2 *u2_freq_cnt , u2 *u2_hilevel_cnt)
{
	u2	u2_freq_cnt_cap;
	u2	u2_duty_cnt_cap;
	u1	u1_ovf = 0 ;
	
	u1_ovf	= ( (TAUD0.CSR6.UINT8 & 0x01) << 1 )| (TAUD1.CSR6.UINT8 & 0x01);

	if ( 0 == (TAUD1.CSR6.UINT8 & 0x01) ) 					/* オーバーフローなし								*/
	{
		u2_duty_cnt_cap = TAUD1.CDR6 ;	
	}
	else												/* オーバーフローした								*/
	{
		u2_duty_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD1.CSC6.UINT8 = 1 ;
	}

	if ( 0 ==  (TAUD0.CSR6.UINT8 & 0x01) ) 									/* オーバーフローなし						*/
	{
		u2_freq_cnt_cap = TAUD0.CDR6 ;	
	}
	else												/* オーバーフローした						*/
	{
		u2_freq_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD0.CSC6.UINT8 = 1 ;
	}

	*u2_freq_cnt 	= u2_freq_cnt_cap ;
	*u2_hilevel_cnt = u2_duty_cnt_cap ;
	
	return (u1_ovf);	
	
}

u1	temp_capture7_read( u2 *u2_freq_cnt , u2 *u2_hilevel_cnt)
{
	u2	u2_freq_cnt_cap;
	u2	u2_duty_cnt_cap;
	u1	u1_ovf = 0 ;
	
	u1_ovf	= ( (TAUD0.CSR7.UINT8 & 0x01) << 1 )| (TAUD1.CSR7.UINT8 & 0x01);

	if ( 0 == (TAUD1.CSR7.UINT8 & 0x01) ) 					/* オーバーフローなし								*/
	{
		u2_duty_cnt_cap = TAUD1.CDR7 ;	
	}
	else												/* オーバーフローした								*/
	{
		u2_duty_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD1.CSC7.UINT8 = 1 ;
	}

	if ( 0 ==  (TAUD0.CSR7.UINT8 & 0x01) ) 									/* オーバーフローなし						*/
	{
		u2_freq_cnt_cap = TAUD0.CDR7 ;	
	}
	else												/* オーバーフローした						*/
	{
		u2_freq_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD0.CSC7.UINT8 = 1 ;
	}

	*u2_freq_cnt 	= u2_freq_cnt_cap ;
	*u2_hilevel_cnt = u2_duty_cnt_cap ;
	
	return (u1_ovf);	
	
}

u1	temp_capture8_read( u2 *u2_freq_cnt , u2 *u2_hilevel_cnt)
{
	u2	u2_freq_cnt_cap;
	u2	u2_duty_cnt_cap;
	u1	u1_ovf = 0 ;
	
	u1_ovf	= ( (TAUD0.CSR8.UINT8 & 0x01) << 1 )| (TAUD1.CSR8.UINT8 & 0x01);

	if ( 0 == (TAUD1.CSR8.UINT8 & 0x01) ) 					/* オーバーフローなし								*/
	{
		u2_duty_cnt_cap = TAUD1.CDR8 ;	
	}
	else												/* オーバーフローした								*/
	{
		u2_duty_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD1.CSC8.UINT8 = 1 ;
	}

	if ( 0 ==  (TAUD0.CSR8.UINT8 & 0x01) ) 									/* オーバーフローなし						*/
	{
		u2_freq_cnt_cap = TAUD0.CDR8 ;	
	}
	else												/* オーバーフローした						*/
	{
		u2_freq_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD0.CSC8.UINT8 = 1 ;
	}

	*u2_freq_cnt 	= u2_freq_cnt_cap ;
	*u2_hilevel_cnt = u2_duty_cnt_cap ;
	
	return (u1_ovf);	
	
}

u1	temp_capture9_read( u2 *u2_freq_cnt , u2 *u2_hilevel_cnt)
{
	u2	u2_freq_cnt_cap;
	u2	u2_duty_cnt_cap;
	u1	u1_ovf = 0 ;
	
	u1_ovf	= ( (TAUD0.CSR9.UINT8 & 0x01) << 1 )| (TAUD1.CSR9.UINT8 & 0x01);

	if ( 0 == (TAUD1.CSR9.UINT8 & 0x01) ) 					/* オーバーフローなし								*/
	{
		u2_duty_cnt_cap = TAUD1.CDR9 ;	
	}
	else												/* オーバーフローした								*/
	{
		u2_duty_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD1.CSC9.UINT8 = 1 ;
	}

	if ( 0 ==  (TAUD0.CSR9.UINT8 & 0x01) ) 									/* オーバーフローなし						*/
	{
		u2_freq_cnt_cap = TAUD0.CDR9 ;	
	}
	else												/* オーバーフローした						*/
	{
		u2_freq_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD0.CSC9.UINT8 = 1 ;
	}

	*u2_freq_cnt 	= u2_freq_cnt_cap ;
	*u2_hilevel_cnt = u2_duty_cnt_cap ;
	
	return (u1_ovf);	
	
}

u1	temp_capture10_read( u2 *u2_freq_cnt , u2 *u2_hilevel_cnt)
{
	u2	u2_freq_cnt_cap;
	u2	u2_duty_cnt_cap;
	u1	u1_ovf = 0 ;
	
	u1_ovf	= ( (TAUD0.CSR10.UINT8 & 0x01) << 1 )| (TAUD1.CSR10.UINT8 & 0x01);

	if ( 0 == (TAUD1.CSR10.UINT8 & 0x01) ) 					/* オーバーフローなし								*/
	{
		u2_duty_cnt_cap = TAUD1.CDR10 ;	
	}
	else												/* オーバーフローした								*/
	{
		u2_duty_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD1.CSC10.UINT8 = 1 ;
	}

	if ( 0 ==  (TAUD0.CSR10.UINT8 & 0x01) ) 									/* オーバーフローなし						*/
	{
		u2_freq_cnt_cap = TAUD0.CDR10 ;	
	}
	else												/* オーバーフローした						*/
	{
		u2_freq_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD0.CSC10.UINT8 = 1 ;
	}

	*u2_freq_cnt 	= u2_freq_cnt_cap ;
	*u2_hilevel_cnt = u2_duty_cnt_cap ;
	
	return (u1_ovf);	
	
}

u1	temp_capture11_read( u2 *u2_freq_cnt , u2 *u2_hilevel_cnt)
{
	u2	u2_freq_cnt_cap;
	u2	u2_duty_cnt_cap;
	u1	u1_ovf = 0 ;
	
	u1_ovf	= ( (TAUD0.CSR11.UINT8 & 0x01) << 1 )| (TAUD1.CSR11.UINT8 & 0x01);

	if ( 0 == (TAUD1.CSR11.UINT8 & 0x01) ) 					/* オーバーフローなし								*/
	{
		u2_duty_cnt_cap = TAUD1.CDR11 ;	
	}
	else												/* オーバーフローした								*/
	{
		u2_duty_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD1.CSC11.UINT8 = 1 ;
	}

	if ( 0 ==  (TAUD0.CSR11.UINT8 & 0x01) ) 									/* オーバーフローなし						*/
	{
		u2_freq_cnt_cap = TAUD0.CDR11 ;	
	}
	else												/* オーバーフローした						*/
	{
		u2_freq_cnt_cap = 0xFFFF ;						/* オーバーフローした時は、FFFFを返して上位側で無視	*/
		TAUD0.CSC11.UINT8 = 1 ;
	}

	*u2_freq_cnt 	= u2_freq_cnt_cap ;
	*u2_hilevel_cnt = u2_duty_cnt_cap ;
	
	return (u1_ovf);	
	
}

/*==============================================================*/
/*	TAUD　キャプチャタイマリード								*/
/*	引数：	なし												*/
/*	　　　　使用周辺機能	TAUD0/CH6-11,TAUD1/CH6-11			*/
/*	戻り値：													*/
/*			0 :オーバーフローなし(周期、Dutyとも)				*/
/*			1 :Dutyオーバー										*/
/*			2 :周期オバーフロー									*/
/*			3 :Dutyと周期両方オーバーフロー						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			TAUD0 CHx:Hi幅測定									*/
/*			TAUD1 CHx:周期測定									*/
/*==============================================================*/
void	temp_capture6_11_ovfclr(void)
{
	TAUD0.CSC6.UINT8 = 1 ;
	TAUD0.CSC7.UINT8 = 1 ;
	TAUD0.CSC8.UINT8 = 1 ;
	TAUD0.CSC9.UINT8 = 1 ;
	TAUD0.CSC10.UINT8 = 1 ;
	TAUD0.CSC11.UINT8 = 1 ;
	
	TAUD1.CSC6.UINT8 = 1 ;
	TAUD1.CSC7.UINT8 = 1 ;
	TAUD1.CSC8.UINT8 = 1 ;
	TAUD1.CSC9.UINT8 = 1 ;
	TAUD1.CSC10.UINT8 = 1 ;
	TAUD1.CSC11.UINT8 = 1 ;
	
}




/*==============================================================*/
/*	TAUD0 CH6-11キャプチャフラグ取得関数						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/
u1 freq_capture6_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC88.BIT.EIRF88 )
	{
		u1_flag 				= 1;
		INTC2.EIC88.BIT.EIRF88 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 freq_capture7_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC89.BIT.EIRF89 )
	{
		u1_flag 				= 1;
		INTC2.EIC89.BIT.EIRF89 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 freq_capture8_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC90.BIT.EIRF90 )
	{
		u1_flag 				= 1;
		INTC2.EIC90.BIT.EIRF90 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}


u1 freq_capture9_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC91.BIT.EIRF91 )
	{
		u1_flag 				= 1;
		INTC2.EIC91.BIT.EIRF91 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}


u1 freq_capture10_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC92.BIT.EIRF92 )
	{
		u1_flag 				= 1;
		INTC2.EIC92.BIT.EIRF92 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 freq_capture11_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC93.BIT.EIRF93 )
	{
		u1_flag 				= 1;
		INTC2.EIC93.BIT.EIRF93 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

/*==============================================================*/

/*==============================================================*/
/*	PWM1タイマ0_7初期化関数										*/
/*	引数：														*/
/*			u4 u4_freq			:キャリア周波数[Hz]				*/
/*			u1 u1_logic			:PWM論理	0:正論理　それ以外:負論理	*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH6/7				*/
/*							P3_1/TAUD0O7						*/
/*							プリスケーラクロック CK0を選択		*/
/*	注意！！　CK0の分解能は、12.5nSになっている事				*/
/*--------------------------------------------------------------*/
void pwm0_7_init (  u4 u4_freq, u1 u1_logic ,u1 u1_intlv  , u1 u1_intcpu )
{
	/*-------------------------------------------------*/
	/* 　P3_1入力モード   			                   */
	/*-------------------------------------------------*/
	PORT.PCR3_1.UINT32		=	0x00000010;				/* 入力		*/
	
	/*-------------------------------------------------*/
	/* 　TAUD0 CH6,7停止 			                      */
	/*-------------------------------------------------*/
	TAUD0.TT.UINT16 		= 0x00C0;					/* CH6,7 STOP					*/

	
	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/	
	/* マスタ（周期制御	）								*/
//	TAUD0.CMOR6.BIT.CKS	= 0;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR6.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR6.BIT.MAS	= 1;						/* マスタ					*/			
//	TAUD0.CMOR6.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD0.CMOR6.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR6.BIT.MD 	= 0;						/* インターバルタイマモード	*/
//  TAUD0.CMOR6.BIT.MD0 = 1;						/* 開始時割り込み発生		*/
	TAUD0.CMOR6.UINT16	= 0x0801 ;	
	
	/* スレーブ（Duty制御）								*/
//	TAUD0.CMOR7.BIT.CKS	= 0;						/* 動作クロック（CK3）		*/
//	TAUD0.CMOR7.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD0.CMOR7.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD0.CMOR7.BIT.STS	= 4;						/* マスタの割り込みトリガ	*/
//	TAUD0.CMOR7.BIT.COS	= 0;						/*							*/	
//	TAUD0.CMOR7.BIT.MD 	= 4;						/* ワンカウントモード		*/
//  TAUD0.CMOR7.BIT.MD0 = 1;						/* 開始時割り込み発生		*/
	TAUD0.CMOR7.UINT16	= 0x0409 ;		

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD0.CMUR6.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	TAUD0.CMUR7.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */

	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD0.CSC6.UINT8 		= 1;							/* OVFフラグクリア 				*/	
	TAUD0.CSC7.UINT8 		= 1;							/* OVFフラグクリア 				*/	
	

	/*-------------------------------------------------*/
	/*  Channel Counter Register 					   */
	/*-------------------------------------------------*/
	TAUD0.CNT6 = 0;
	TAUD0.CNT7 = 0;

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	/* 周期設定											*/
	{
		double t_CMP	= ((double)(__CLKC_HSB*1e6))/((double)u4_freq);
		if(t_CMP>65535.)
		{
			TAUD0.CDR6		= 65535;
		}
		else
		{
			TAUD0.CDR6		= (u2)t_CMP ;
		}
	}	
	
								
	/* Duty設定											*/
	TAUD0.CDR7 = 0;										
	
	/*============== TAUD0 各チャネル一括	=================*/
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD0.TOE.UINT16		|= 0x0080;					/* 出力許可						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD0.TOM.UINT16 		|= 0x0080;						/* チャネル連動動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD0.TOC.UINT16		&= ~0x0080;						/* 動作モード1					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	if ( 0 == u1_logic )
	{
		TAUD0.TOL.UINT16		&= ~0x0080;						/* アクティブレベルHI			 */
		PORT.P6.BIT.P6_7		= 0;
	}
	else
	{
		TAUD0.TOL.UINT16		|= 0x0080;						/* アクティブレベルHI			 */
		PORT.P6.BIT.P6_7		= 1;
	}
	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TDE.UINT16 		&= ~0x0080;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD0.TDM.UINT16	 	&= ~0x0080;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD0.TDL.UINT16		&= ~0x0080;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD0.TRE.UINT16		&= ~0x0080;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD0.TRO.UINT16 		&= ~0x0080;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD0.TRC.UINT16 		&= ~0x0080;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD0.TME.UINT16		&= ~0x0080;						/* 変調禁止							*/
	
	/*-------------------------------------------------*/
	/* 一斉書き換え関連レジスタ設定				      */
	/*-------------------------------------------------*/
	TAUD0.RDE.UINT16		|= 0x00C0;						/* 一斉書き換え許可					*/	
	TAUD0.RDS.UINT16		&= ~0x00C0;						/* マスタチャネルの一斉トリガ発生	*/	
	TAUD0.RDE.UINT16		&= ~0x00C0;						/* マスタチャネルがカウント開始でトリガ発生					*/	
	TAUD0.RDE.UINT16		&= ~0x00C0;						/* 一斉書き換えトリガとして動作しない*/	
	/*====================================================*/

	/* 割り込みレベル設定	*/
	/* TAUD0 CH6			*/
	if ( 2 ==  u1_intcpu )
	{
		INTC2.EIBD88.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD88.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD88.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD88.BIT.PEID	= 1;							/* CPU1にバインド					*/		
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC88.BIT.EIRF88	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC88.BIT.EIP88	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC88.BIT.EITB88	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC88.BIT.EITB88	= 0;						/* 直接分岐方式						*/
		INTC2.EIC88.BIT.EIMK88	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC88.BIT.EIMK88	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　PWMタイマ1スタート関数										*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH6/7				*/
/*--------------------------------------------------------------*/
void pwm0_7_tim_start(void)
{
	/* TAUD0 CH6/7				*/
	TAUD0.TS.UINT16 = 0x00C0;;		
}

/*==============================================================*/
/*　PWMタイマタイマ0_7停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH6/7				*/
/*--------------------------------------------------------------*/
void pwm0_7_tim_stop(void)
{
	/* TAUD0 CH6/7				*/
	TAUD0.TT.UINT16 = 0x00C0;		
}

/*===============================================================*/
/*	PWMタイマ0_7　PWM出力許可									     */
/*===============================================================*/
void pwm0_7_start ( void )
{
	/* 第1兼用	*/
	PORT.PCR3_1.UINT32	= 0x00000040;			 		/* PORT3_1 TAUD0O7									*/

}

/*===============================================================*/
/*	PWMタイマ0_7　PWM出力停止									     */
/*===============================================================*/
void pwm0_7_stop ( void )
{
	/* 第1兼用	*/
	PORT.PCR3_1.UINT32	= 0x00000010;			 		/* PORT3_1 TAUD0O7									*/
}	

/*==============================================================*/
/*　PWMタイマタイマ0_7変調率設定関数								*/
/*	引数：	f4		f4_m :PWM変調率　　0~1.0					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH6/7				*/
/*--------------------------------------------------------------*/	
void pwm0_7_setm_f ( f4 f4_m )
{
	u2	u2_cnt_m;
	
	if ( f4_m >= 1.0 )
	{
		u2_cnt_m = (u2)(TAUD0.CDR6+1) ;
	}
	else
	{
		if ( f4_m <= 0 )
		{
			u2_cnt_m = (u2)(0);
		}
		else
		{
			u2_cnt_m = (u2)(f4_m * (f4)(TAUD0.CDR6));
		}
	}

	TAUD0.CDR7	= (u2)u2_cnt_m;	
	TAUD0.RDT.UINT16  = 0x00C0 ;		/* CH6/7 リロード許可		*/
}		
