/*===============================================================
+																+
+			Title:	 AMDTCTRL-C1Hソフトウェア				    +
+																+
+				date:		1th Apri,2017						+
+																+
+  	 	Copyright (C) Aoyama Motor Drive Technology    2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"iodefine.h"										/* 周辺定義ヘッダファイル						*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
/* ライブラリ/デバッグ関係		*/
/*=============================================================*/

/*==============================================================*/
/*	TAUJ0用クロック初期化関数									*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*			制御タイマ：TAUJ0									*/
/*			CK0	= PCLK											*/
/*			CK1 = PCLK/2										*/
/*			CK2 = PCLK/8										*/
/*			CK3_PRE = PCLK										*/
/*			CK3	= 1MHzになるように設定							*/
/*			TAUJ0が停止中に実行の事								*/
/*--------------------------------------------------------------*/
void	tauj0prescale0_2_8_0_init(void)
{
	/*-------------------------------------------------*/
	/* Set Clock Frequency                             */
	/*-------------------------------------------------*/
//	TAUJ0.TPS = 0b0000 00010 0001 0000;				/* Prescaler Clock Select */
	TAUJ0.TPS.UINT16 = 0x0310;

/*							CK3_PRE[15-12] = PCLK/2^0
							CK2[11- 8]     = PCLK/2^3
							CK1[ 7- 4]     = PCLK/2^1
							CK0[ 3- 0]     = PCLK/2^0
*/
	/*-------------------------------------------------*/
	/* Set Baudrate  CK3 = CK3PRE/BRS                  */
	/*-------------------------------------------------*/
	TAUJ0.BRS			= (u4)(__CLKC_HSB)-1;		/* CK3_PRE/(TAUJ0BRS+1)=1MHz */
	
}

/*==============================================================*/
/*	TAUJ0全CH停止関数											*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*--------------------------------------------------------------*/
void	tauj0_stop(void)
{
	TAUJ0.TT.UINT8 = 0x0F;					/* 全TAUD0タイマ停止		*/
}

/*==============================================================*/
/*	PWMタイマ0_2初期化関数										*/
/*	引数：														*/
/*			u4	u4_freq	: PWM周期[Hz]							*/
/*			u1	u1_logic :PWM論理	0:正論理　それ以外:負論理	*/
/*			u1 u1_intlv	:割り込みレベル							*/
/*			u1 u1_intcpu: 2: PE2 /2以外:PE1						*/
/*																*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUJ0_CH0/2				*/
/*							プリスケーラクロック CK0を選択		*/
/*				出力端子	: P0_2								*/
/*	注意！！　CK0の分解能は、80MHzになっている事				*/
/*--------------------------------------------------------------*/
void pwm0_2_init ( u4 u4_freq , u1 u1_logic , u1 u1_intlv , u1 u1_intcpu)
{
	
	/* PWM出力端子Hi-z	*/
	{		
		u4 t_PMSR0	= (((0x1)<<2)<<16) | (0x1<<2);				/* PM0_2			 入力モード		*/
		u4 t_PMCSR0	= (((0x1)<<2)<<16) | (0x0<<2);				/* PMC0_2			 ポートモード	*/

		PORT.PMSR0.UINT32	= t_PMSR0;
		PORT.PMCSR0.UINT32	= t_PMCSR0;	
	}

	/*-------------------------------------------------*/
	/* 　TAUJ0 CH0/2停止 			                   */
	/*-------------------------------------------------*/
	TAUJ0.TT.UINT8 		= 0x05;						/* CH0/2 STOP					*/

	/* PWM周波数設定*/
	{
		double t_CMP0	= ((double)(__CLKC_HSB*1e6))/((double)u4_freq);
		if(t_CMP0>65535.)
		{
			TAUJ0.CDR0		= (u4)65535;
		}
		else
		{
			TAUJ0.CDR0		= (u4)t_CMP0-1 ;
		}
	}
	
	/* Duty 設定	 0%*/
	TAUJ0.CDR2	= 0;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 					   */
	/*-------------------------------------------------*/
	TAUJ0.CNT0 = 0;
	TAUJ0.CNT2 = 0;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
	TAUJ0.CMOR0.UINT16		= 0x0801 ;
	TAUJ0.CMOR2.UINT16		= 0x0409 ;
	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUJ0.CMUR0.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	TAUJ0.CMUR2.UINT8		= 0;
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUJ0.CSC0.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUJ0.CSC2.UINT8 		= 1;							/* OVFフラグクリア 				*/
/*============== TAUJ0 各チャネル一括	=================*/
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUJ0.TOE.UINT8		|= 0x4;							/* CH2出力許可						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUJ0.TOM.UINT8 	&= ~0x1;						/* CH0チャネル単体動作				 */
	TAUJ0.TOM.UINT8		|= 0x4;							/* CH2チャネル連動動作				 */
	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUJ0.TOC.UINT8		&= ~0x5;						/* CH0/2トグルモード				 */

	/*-------------------------------------------------*/
	/* Channel  Output Level Register   		       */
	/*-------------------------------------------------*/
	if ( 0 == u1_logic )
	{
		TAUJ0.TOL.UINT8		&= ~0x4;						/* アクティブレベルHI				 */
	}
	else
	{
		TAUJ0.TOL.UINT8		|= 0x4;							/* アクティブレベルLow				 */
	}
	/*-------------------------------------------------*/

	/*-------------------------------------------------*/
	/* Channel  Output Register     		           */
	/*-------------------------------------------------*/
	TAUJ0.TO.UINT8 	&= ~0x5;							/* TO出力 LOW						*/

	TAUJ0.RDE.UINT8	|=  0x5;							/* 一斉書き換え許可					*/
	TAUJ0.RDM.UINT8	&= ~0x5;


	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD78.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD78.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD78.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD78.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC78.BIT.EIRF78	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC78.BIT.EIP78	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC78.BIT.EITB78	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC78.BIT.EITB78	= 0;						/* 直接分岐方式						*/
		INTC2.EIC78.BIT.EIMK78	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC78.BIT.EIMK78	= 1 ;						/* 割り込みマスク					*/
	}

	/*====================================================*/
	/*	ポート設定		*/
	/* P0_2 第2兼用選択	*/
	PORT.PCR0_2.UINT32	= 0x00000011;					/* PORT0_2 TAUJ0O2						*/
														/* PM 	 = 1							*/
														/* PMC1  = 0							*/
														/* PFCAE = 0							*/
														/* PFCE  = 0							*/
														/* PFC   = 1							*/
}

/*=============================================================
	PMW0_2タイマカウントスタート						   
===============================================================*/
void pwm0_2_tim_start ( void  )
{
	TAUJ0.TS.UINT8 |= 0x5;								/* CH0/2スタート					*/
}
/*=============================================================
	PMW0_2タイマカウント停止					   
===============================================================*/
void pwm0_2_tim_stop( void )
{
	TAUJ0.TT.UINT8 |= 0x5;								/* CH0/2停止						*/
}

/*=============================================================
	TAUJ0O2　PWM出力許可						   
===============================================================*/
void pwm0_2_start( void )
{
	u4 t_PMSR0	= (((0x1)<<2)<<16) | (0x0<<2);			/* PM0_2			 出力モード	*/
	u4 t_PMCSR0	= (((0x1)<<2)<<16) | (0x1<<2);			/* PMC0_2			 兼用モード	*/

	PORT.PMSR0.UINT32	= t_PMSR0;
	PORT.PMCSR0.UINT32	= t_PMCSR0;		
}
/*=============================================================
	TAUJ0O2　PWM出力停止						   
===============================================================*/
void pwm0_2_stop( void )
{
	u4 t_PMSR0	= (((0x1)<<2)<<16) | (0x1<<2);				/* PM0_2			 入力モード		*/
	u4 t_PMCSR0	= (((0x1)<<2)<<16) | (0x0<<2);				/* PMC0_2			 ポートモード	*/

	PORT.PMSR0.UINT32	= t_PMSR0;
	PORT.PMCSR0.UINT32	= t_PMCSR0;	
	
}

/*==============================================================*/
/*	TAUJ0O2 PWMDuty設定関数(浮動少数点Ver）						*/
/*	引数：	f4 f4_m : PWMDuty( 0 ~ +1 )							*/
/*  戻り値：なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			出力ピン											*/
/*					: P0_2/TAUJ0O2								*/
/*==============================================================*/
void set_pwm0_2_m ( f4 f4_m )
{
	f4 t_f4_m ;
	f4 f4_m_t ;
	u4 u4_m_t ;
	
	t_f4_m = f4_m ;
	
	if ( t_f4_m >= 1.0F )
	{
		u4_m_t = TAUJ0.CDR0+1 ;
	}
	else
	{
		if ( t_f4_m <= 0.0F )
		{
			u4_m_t = (u4)(0) ;
		}
		else
		{
			f4_m_t = t_f4_m * (f4)(TAUJ0.CDR0);
			u4_m_t = (u4)(f4_m_t) ;
		}
	}
	
	TAUJ0.CDR2		= u4_m_t;
	TAUJ0.RDT.UINT8	= 0x05;			//  リロード許可
}

/*==============================================================*/
/*	TAUJ0O2 PWMDuty設定関数(浮動少数点Ver）						*/
/*	引数：	f4 f4_m : PWMDuty( 0 ~ +1 )							*/
/*			f4 u4_freq : PWM周波数（Hz)							*/ 
/*  戻り値：なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			出力ピン											*/
/*					: P0_2/TAUJ0O2								*/
/*==============================================================*/
void set_pwm0_2_mf ( f4 f4_m  , f4 f4_freq )
{
	f4 t_f4_m ;
	f4 f4_m_t ;
	u4 u4_m_t ;
	f4	t_f4_freq ;
	
	t_f4_m = f4_m ;

	t_f4_freq = f4_freq ;

	if ( 0 == t_f4_freq )
	{
		t_f4_freq = 1 ;
	}

	{
		double t_CMP0	= ((double)(__CLKC_HSB*1e6))/((double)t_f4_freq);
		if(t_CMP0>65535.)
		{
			TAUJ0.CDR0		= (u4)65535;
		}
		else
		{
			TAUJ0.CDR0		= (u4)t_CMP0-1 ;
		}
	}

	
	if ( t_f4_m >= 1.0F )
	{
		u4_m_t = TAUJ0.CDR0+1 ;
	}
	else
	{
		if ( t_f4_m <= 0.0F )
		{
			u4_m_t = (u4)(0) ;
		}
		else
		{
			f4_m_t = t_f4_m * (f4)(TAUJ0.CDR0);
			u4_m_t = (u4)(f4_m_t) ;
		}
	}
	
	TAUJ0.CDR2		= u4_m_t;
	TAUJ0.RDT.UINT8	= 0x05;			//  リロード許可
}

/*==============================================================*/
/*	PWMタイマ0_3初期化関数										*/
/*	引数：														*/
/*			u4	u4_freq	: PWM周期[Hz]							*/
/*			u1	u1_logic :PWM論理	0:正論理　それ以外:負論理	*/
/*			u1 u1_intlv	:割り込みレベル							*/
/*			u1 u1_intcpu: 2: PE2 /2以外:PE1						*/
/*																*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUJ0_CH2/3				*/
/*							プリスケーラクロック CK0を選択		*/
/*				出力端子	: P0_3								*/
/*	注意！！　CK0の分解能は、80MHzになっている事				*/
/*--------------------------------------------------------------*/
void pwm0_3_init ( u4 u4_freq , u1 u1_logic , u1 u1_intlv , u1 u1_intcpu)
{
	
	/* PWM出力端子Hi-z	*/
	{		
		u4 t_PMSR0	= (((0x1)<<3)<<16) | (0x1<<3);				/* PM0_3			 入力モード		*/
		u4 t_PMCSR0	= (((0x1)<<3)<<16) | (0x0<<3);				/* PMC0_3			 ポートモード	*/

		PORT.PMSR0.UINT32	= t_PMSR0;
		PORT.PMCSR0.UINT32	= t_PMCSR0;	
	}

	/*-------------------------------------------------*/
	/* 　TAUJ0 CH2/3停止 			                   */
	/*-------------------------------------------------*/
	TAUJ0.TT.UINT8 		= 0x0C;						/* CH2/3 STOP					*/

	/* PWM周波数設定*/
	{
		double t_CMP0	= ((double)(__CLKC_HSB*1e6))/((double)u4_freq);
		if(t_CMP0>65535.)
		{
			TAUJ0.CDR2		= (u4)65535;
		}
		else
		{
			TAUJ0.CDR2		= (u4)t_CMP0-1 ;
		}
	}
	
	/* Duty 設定	 0%*/
	TAUJ0.CDR3	= 0;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 					   */
	/*-------------------------------------------------*/
	TAUJ0.CNT2 = 0;
	TAUJ0.CNT3 = 0;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
	TAUJ0.CMOR2.UINT16		= 0x0801 ;
	TAUJ0.CMOR3.UINT16		= 0x0409 ;
	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUJ0.CMUR2.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	TAUJ0.CMUR3.UINT8		= 0;
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUJ0.CSC2.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUJ0.CSC3.UINT8 		= 1;							/* OVFフラグクリア 				*/
/*============== TAUJ0 各チャネル一括	=================*/
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUJ0.TOE.UINT8		|= 0x08;							/* CH3出力許可						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUJ0.TOM.UINT8 	&= ~0x4;						/* CH2チャネル単体動作				 */
	TAUJ0.TOM.UINT8		|= 0x8;							/* CH3チャネル連動動作				 */
	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUJ0.TOC.UINT8		&= ~0xC;						/* CH2/3トグルモード				 */

	/*-------------------------------------------------*/
	/* Channel  Output Level Register   		       */
	/*-------------------------------------------------*/
	if ( 0 == u1_logic )
	{
		TAUJ0.TOL.UINT8		&= ~0x8;						/* アクティブレベルHI				 */
	}
	else
	{
		TAUJ0.TOL.UINT8		|= 0x8;							/* アクティブレベルLow				 */
	}
	/*-------------------------------------------------*/

	/*-------------------------------------------------*/
	/* Channel  Output Register     		           */
	/*-------------------------------------------------*/
	TAUJ0.TO.UINT8 	&= ~0xC;							/* TO出力 LOW						*/

	TAUJ0.RDE.UINT8	|=  0xC;							/* 一斉書き換え許可					*/
	TAUJ0.RDM.UINT8	&= ~0xC;


	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD80.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD80.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD80.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD80.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC80.BIT.EIRF80	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC80.BIT.EIP80	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC80.BIT.EITB80	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC80.BIT.EITB80	= 0;						/* 直接分岐方式						*/
		INTC2.EIC80.BIT.EIMK80	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC80.BIT.EIMK80	= 1 ;						/* 割り込みマスク					*/
	}

	/*====================================================*/
	/*	ポート設定		*/
	/* P0_2 第2兼用選択	*/
	PORT.PCR0_3.UINT32	= 0x00000011;					/* PORT0_3 TAUJ0O2						*/
														/* PM 	 = 1							*/
														/* PMC1  = 0							*/
														/* PFCAE = 0							*/
														/* PFCE  = 0							*/
														/* PFC   = 1							*/
}

/*=============================================================
	PMW0_3タイマカウントスタート						   
===============================================================*/
void pwm0_3_tim_start ( void  )
{
	TAUJ0.TS.UINT8 |= 0x0C;								/* CH2/3スタート					*/
}
/*=============================================================
	PMW0_3タイマカウント停止					   
===============================================================*/
void pwm0_3_tim_stop( void )
{
	TAUJ0.TT.UINT8 |= 0x0C;								/* CH2/3停止						*/
}

/*=============================================================
	TAUJ0O3　PWM出力許可						   
===============================================================*/
void pwm0_3_start( void )
{
	u4 t_PMSR0	= (((0x1)<<3)<<16) | (0x0<<3);			/* PM0_3			 出力モード	*/
	u4 t_PMCSR0	= (((0x1)<<3)<<16) | (0x1<<3);			/* PMC0_3			 兼用モード	*/

	PORT.PMSR0.UINT32	= t_PMSR0;
	PORT.PMCSR0.UINT32	= t_PMCSR0;		
}
/*=============================================================
	TAUJ0O3　PWM出力停止						   
===============================================================*/
void pwm0_3_stop( void )
{
	u4 t_PMSR0	= (((0x1)<<3)<<16) | (0x1<<3);				/* PM0_2			 入力モード		*/
	u4 t_PMCSR0	= (((0x1)<<3)<<16) | (0x0<<3);				/* PMC0_2			 ポートモード	*/

	PORT.PMSR0.UINT32	= t_PMSR0;
	PORT.PMCSR0.UINT32	= t_PMCSR0;	
	
}

/*==============================================================*/
/*	TAUJ0O3 PWMDuty設定関数(浮動少数点Ver）						*/
/*	引数：	f4 f4_m : PWMDuty( 0 ~ +1 )							*/
/*  戻り値：なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			出力ピン											*/
/*					: P0_3/TAUJ0O3								*/
/*==============================================================*/
void set_pwm0_3_m ( f4 f4_m )
{
	f4 t_f4_m ;
	f4 f4_m_t ;
	u4 u4_m_t ;
	
	t_f4_m = f4_m ;
	
	if ( t_f4_m >= 1.0F )
	{
		u4_m_t = TAUJ0.CDR2+1 ;
	}
	else
	{
		if ( t_f4_m <= 0.0F )
		{
			u4_m_t = (u4)(0) ;
		}
		else
		{
			f4_m_t = t_f4_m * (f4)(TAUJ0.CDR2);
			u4_m_t = (u4)(f4_m_t) ;
		}
	}
	
	TAUJ0.CDR3		= u4_m_t;
	TAUJ0.RDT.UINT8	= 0x0C;			//  リロード許可
}

/*==============================================================*/
/*	TAUJ0O3 PWMDuty設定関数(浮動少数点Ver）						*/
/*	引数：	f4 f4_m : PWMDuty( 0 ~ +1 )							*/
/*			f4 u4_freq : PWM周波数（Hz)							*/ 
/*  戻り値：なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*			出力ピン											*/
/*					: P0_2/TAUJ0O2								*/
/*==============================================================*/
void set_pwm0_3_mf ( f4 f4_m  , f4 f4_freq )
{
	f4 t_f4_m ;
	f4 f4_m_t ;
	u4 u4_m_t ;
	f4	t_f4_freq ;
	
	t_f4_m = f4_m ;

	t_f4_freq = f4_freq ;

	if ( 0 == t_f4_freq )
	{
		t_f4_freq = 1 ;
	}

	{
		double t_CMP0	= ((double)(__CLKC_HSB*1e6))/((double)t_f4_freq);
		if(t_CMP0>65535.)
		{
			TAUJ0.CDR2		= (u4)65535;
		}
		else
		{
			TAUJ0.CDR2		= (u4)t_CMP0-1 ;
		}
	}

	
	if ( t_f4_m >= 1.0F )
	{
		u4_m_t = TAUJ0.CDR2+1 ;
	}
	else
	{
		if ( t_f4_m <= 0.0F )
		{
			u4_m_t = (u4)(0) ;
		}
		else
		{
			f4_m_t = t_f4_m * (f4)(TAUJ0.CDR2);
			u4_m_t = (u4)(f4_m_t) ;
		}
	}
	
	TAUJ0.CDR3		= u4_m_t;
	TAUJ0.RDT.UINT8	= 0x0C;			//  リロード許可
}

/*==============================================================*/
/*	周波数測定用初期化関数										*/
/*	引数：														*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUJ0_CH0				*/
/*										P0_0使用				*/
/*				分解能　CK2(10MHz想定）							*/
/*							100nS								*/
/*--------------------------------------------------------------*/
void	freq_capture0_init( u1 u1_intlv , u1 u1_intcpu)
{
	/*--------------------------------------------------*/
	/* STOP : TAUJ0 CH0									*/
	/*--------------------------------------------------*/
	TAUJ0.TT.UINT8 = 0x01;

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUJ0.CDR0 = 0x00000000;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
//	TAUJ0.CMOR0.UINT16 = 0b1000000111000100;/* Capture Timer 								*/
											/* BitName	 Bit     SetValue        			*/
											/* TAUJ0CKS  15-14 ->10:Prescaler Output = CK2 	*/
											/* TAUJnCCS  13-12 ->0:Count Clock = Prescaler 	*/
											/* TAUJnMAS     11 ->0:Slave  					*/
											/* TAUJnSTS  10- 8 ->001:有効エッジをトリガ 	*/
											/* TAUJnCOS   7- 6 ->11:オーバーフロー時にOVFSet*/
											/* 						かつFFFFFFFFHにCDR固定	*/
											/* -			 5 ->設定無し					*/
											/* TAUJnMD    4- 1 ->0010:CaptureMode			*/
											/* TAUJnMD0		 0 ->0:スタート時割り込み発生無 */
	TAUJ0.CMOR0.UINT16 =  0x81C4;					

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUJ0.CMUR0.UINT8 = 0x00; 					/* TAUAnTTINm using edge: 立下り				*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUJ0.CSC0.UINT8 = 0x01;					/* OverFlowFlag Clear							*/
	
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUJ0.TOE.UINT8 &= ~0x01;					/* InValid */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUJ0.TOM.UINT8 &= ~0x01;					/* Single Channel Operation */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUJ0.TOC.UINT8 &= ~0x01;					/* Toggle Mode */

	/*-------------------------------------------------*/
	/* Channel Output Register				           */
	/*-------------------------------------------------*/
	TAUJ0.TO.UINT8  &= ~0x01;					/* LOW Output */

	/*-------------------------------------------------*/
	/* Channel Output active level Register		       */
	/*-------------------------------------------------*/
	TAUJ0.TOL.UINT8 &= ~0x01;					/* Active Level-- High */

	/*-------------------------------------------------*/
	/* Channel Re-Load Data Enable Register		       */
	/*-------------------------------------------------*/
	TAUJ0.RDE.UINT8 &= ~0x01;					/* Disable 				*/

	/*-------------------------------------------------*/
	/* Channel Re-Load Data Mode Register				*/
	/*-------------------------------------------------*/
	TAUJ0.RDM.UINT8 &= ~0x01;					/* Disable				 */

	/*-------------------------------------------------*/
	/* Interrupt TAUJ0 CH0			                   */
	/*-------------------------------------------------*/
	/* 割り込みレベル設定）	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD78.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD78.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD78.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD78.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC78.BIT.EIRF78	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC78.BIT.EIP78	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC78.BIT.EITB78	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC78.BIT.EITB78	= 0;						/* 直接分岐方式						*/
		INTC2.EIC78.BIT.EIMK78	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC78.BIT.EIMK78	= 1 ;						/* 割り込みマスク					*/
	}

	/*-------------------------------------------------*/
	/* Port Setting					                   */
	/*-------------------------------------------------*/
	/* P0_0 第2兼用選択	*/
	PORT.PCR0_0.UINT32	= 0x00000051;					/* PORT0_0 TAUJ0I0						*/
														/* PM 	 = 1							*/
														/* PMC1  = 1							*/
														/* PFCAE = 0							*/
														/* PFCE  = 0							*/
														/* PFC   = 1							*/
	
	/* TAUJ0_CH1(Capture Timer) Start			*/
//	TAUJ0.TS.UINT8   = 0x0002;			
}

/*=============================================================
	TAUJ0 CH0スタート						   
===============================================================*/
void 	freq_capture0_start ( void )
{
	TAUJ0.TS.UINT8   = 0x01;	
}

/*=============================================================
	TAUJ0 CH1ストップ						   
===============================================================*/
void freq_capture0_stop ( void )
{
	TAUJ0.TT.UINT8   = 0x01;	
}

/*==============================================================*/
/*	TAUJ0 CH0キャプチャ値取得関数								*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	基本カウンタ値を返す								*/
/*			オーバーフロー時は、FFFF_FFFFHを返す				*/
/*          0時は、上位側の0割を防止の為、1を返す				*/
/*																*/
/*==============================================================*/
u4 freq_capture0_cnt_read(void)
{
	u4 	u4_cnt	;
	
	u4_cnt = 0xffffffff;
	
	if ( 0 == ( TAUJ0.CSR0.UINT8 & 0x01 ) )				/* オーバーフローなし	*/
	{
		u4_cnt = TAUJ0.CDR0 ;
	}
	else
	{
		u4_cnt 				= 0xffffffff;
		TAUJ0.CSC0.UINT8	= 1;		/* OverflowFlagクリア	*/		
	}

	if ( u4_cnt == 0 )
	{
		u4_cnt = 1;						/* 上位で0割防止	*/
	}

	return( u4_cnt );
}

/*==============================================================*/
/*	TAUJ0 CH0キャプチャフラグ取得関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/
u1 freq_capture0_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC78.BIT.EIRF78 )
	{
		u1_flag 				= 1;
		INTC2.EIC78.BIT.EIRF78 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}


/*==============================================================*/
/*	周波数測定用初期化関数										*/
/*	引数：														*/
/*			u1	u1_intlv	:割り込みレベル						*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUJ0_CH1				*/
/*										P0_1使用				*/
/*				分解能　CK2(10MHz想定）							*/
/*							100nS								*/
/*--------------------------------------------------------------*/
void	freq_capture1_init( u1 u1_intlv , u1 u1_intcpu)
{
	/*--------------------------------------------------*/
	/* STOP : TAUJ0 CH1									*/
	/*--------------------------------------------------*/
	TAUJ0.TT.UINT8 = 0x02;

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUJ0.CDR1 = 0x00000000;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
//	TAUJ0.CMOR1.UINT16 = 0b1000000111000100;/* Capture Timer 								*/
											/* BitName	 Bit     SetValue        			*/
											/* TAUJ0CKS  15-14 ->10:Prescaler Output = CK2 	*/
											/* TAUJnCCS  13-12 ->0:Count Clock = Prescaler 	*/
											/* TAUJnMAS     11 ->0:Slave  					*/
											/* TAUJnSTS  10- 8 ->001:有効エッジをトリガ 	*/
											/* TAUJnCOS   7- 6 ->11:オーバーフロー時にOVFSet*/
											/* 						かつFFFFFFFFHにCDR固定	*/
											/* -			 5 ->設定無し					*/
											/* TAUJnMD    4- 1 ->0010:CaptureMode			*/
											/* TAUJnMD0		 0 ->0:スタート時割り込み発生無 */
	TAUJ0.CMOR1.UINT16 =  0x81C4;					

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUJ0.CMUR1.UINT8 = 0x00; 					/* TAUAnTTINm using edge: 立下り				*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUJ0.CSC1.UINT8 = 0x01;					/* OverFlowFlag Clear							*/
	
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUJ0.TOE.UINT8 &= ~0x02;					/* InValid */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUJ0.TOM.UINT8 &= ~0x02;					/* Single Channel Operation */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUJ0.TOC.UINT8 &= ~0x02;					/* Toggle Mode */

	/*-------------------------------------------------*/
	/* Channel Output Register				           */
	/*-------------------------------------------------*/
	TAUJ0.TO.UINT8  &= ~0x02;					/* LOW Output */

	/*-------------------------------------------------*/
	/* Channel Output active level Register		       */
	/*-------------------------------------------------*/
	TAUJ0.TOL.UINT8 &= ~0x02;					/* Active Level-- High */

	/*-------------------------------------------------*/
	/* Channel Re-Load Data Enable Register		       */
	/*-------------------------------------------------*/
	TAUJ0.RDE.UINT8 &= ~0x02;					/* Disable 				*/

	/*-------------------------------------------------*/
	/* Channel Re-Load Data Mode Register				*/
	/*-------------------------------------------------*/
	TAUJ0.RDM.UINT8 &= ~0x02;					/* Disable				 */

	/*-------------------------------------------------*/
	/* Interrupt TAUJ0 CH1			                   */
	/*-------------------------------------------------*/
	/* 割り込みレベル設定）	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD79.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD79.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD79.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD79.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC79.BIT.EIRF79	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC79.BIT.EIP79	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC79.BIT.EITB79	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC79.BIT.EITB79	= 0;						/* 直接分岐方式						*/
		INTC2.EIC79.BIT.EIMK79	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC79.BIT.EIMK79	= 1 ;						/* 割り込みマスク					*/
	}

	/*-------------------------------------------------*/
	/* Port Setting					                   */
	/*-------------------------------------------------*/
	/* P0_1 第2兼用選択	*/
	PORT.PCR0_1.UINT32	= 0x00000051;					/* PORT0_1 TAUJ0I1						*/
														/* PM 	 = 1							*/
														/* PMC1  = 1							*/
														/* PFCAE = 0							*/
														/* PFCE  = 0							*/
														/* PFC   = 1							*/
}

/*=============================================================
	TAUJ0 CH1スタート						   
===============================================================*/
void 	freq_capture1_start ( void )
{
	TAUJ0.TS.UINT8   = 0x02;	
}

/*=============================================================
	TAUJ0 CH1ストップ						   
===============================================================*/
void freq_capture1_stop ( void )
{
	TAUJ0.TT.UINT8   = 0x02;	
}

/*==============================================================*/
/*	TAUJ0 CH1キャプチャ値取得関数								*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	基本カウンタ値を返す								*/
/*			オーバーフロー時は、FFFF_FFFFHを返す				*/
/*          0時は、上位側の0割を防止の為、1を返す				*/
/*																*/
/*==============================================================*/
u4 freq_capture1_cnt_read(void)
{
	u4 	u4_cnt	;
	
	u4_cnt = 0xffffffff;
	
	if ( 0 == ( TAUJ0.CSR1.UINT8 & 0x01 ) )				/* オーバーフローなし	*/
	{
		u4_cnt = TAUJ0.CDR1 ;
	}
	else
	{
		u4_cnt 				= 0xffffffff;
		TAUJ0.CSC1.UINT8	= 1;		/* OverflowFlagクリア	*/		
	}

	if ( u4_cnt == 0 )
	{
		u4_cnt = 1;						/* 上位で0割防止	*/
	}

	return( u4_cnt );
}

/*==============================================================*/
/*	TAUJ0 CH1キャプチャフラグ取得関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/
u1 freq_capture1_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC79.BIT.EIRF79 )
	{
		u1_flag 				= 1;
		INTC2.EIC79.BIT.EIRF79 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

/*==============================================================*/
/*	周波数測定用初期化関数										*/
/*	引数：														*/
/*			u1	u1_intlv	:割り込みレベル						*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUJ0_CH2				*/
/*										P0_2使用				*/
/*				分解能　CK2(10MHz想定）							*/
/*							100nS								*/
/*--------------------------------------------------------------*/
void	freq_capture2_init( u1 u1_intlv , u1 u1_intcpu)
{
	/*--------------------------------------------------*/
	/* STOP : TAUJ0 CH1									*/
	/*--------------------------------------------------*/
	TAUJ0.TT.UINT8 = 0x04;

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUJ0.CDR2 = 0x00000000;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
//	TAUJ0.CMOR2.UINT16 = 0b1000000111000100;/* Capture Timer 								*/
											/* BitName	 Bit     SetValue        			*/
											/* TAUJ0CKS  15-14 ->10:Prescaler Output = CK2 	*/
											/* TAUJnCCS  13-12 ->0:Count Clock = Prescaler 	*/
											/* TAUJnMAS     11 ->0:Slave  					*/
											/* TAUJnSTS  10- 8 ->001:有効エッジをトリガ 	*/
											/* TAUJnCOS   7- 6 ->11:オーバーフロー時にOVFSet*/
											/* 						かつFFFFFFFFHにCDR固定	*/
											/* -			 5 ->設定無し					*/
											/* TAUJnMD    4- 1 ->0010:CaptureMode			*/
											/* TAUJnMD0		 0 ->0:スタート時割り込み発生無 */
	TAUJ0.CMOR2.UINT16 =  0x81C4;					

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUJ0.CMUR2.UINT8 = 0x00; 					/* TAUAnTTINm using edge: 立下り				*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUJ0.CSC2.UINT8 = 0x01;					/* OverFlowFlag Clear							*/
	
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUJ0.TOE.UINT8 &= ~0x04;					/* InValid */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUJ0.TOM.UINT8 &= ~0x04;					/* Single Channel Operation */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUJ0.TOC.UINT8 &= ~0x04;					/* Toggle Mode */

	/*-------------------------------------------------*/
	/* Channel Output Register				           */
	/*-------------------------------------------------*/
	TAUJ0.TO.UINT8  &= ~0x04;					/* LOW Output */

	/*-------------------------------------------------*/
	/* Channel Output active level Register		       */
	/*-------------------------------------------------*/
	TAUJ0.TOL.UINT8 &= ~0x04;					/* Active Level-- High */

	/*-------------------------------------------------*/
	/* Channel Re-Load Data Enable Register		       */
	/*-------------------------------------------------*/
	TAUJ0.RDE.UINT8 &= ~0x04;					/* Disable 				*/

	/*-------------------------------------------------*/
	/* Channel Re-Load Data Mode Register				*/
	/*-------------------------------------------------*/
	TAUJ0.RDM.UINT8 &= ~0x04;					/* Disable				 */

	/*-------------------------------------------------*/
	/* Interrupt TAUJ0 CH2			                   */
	/*-------------------------------------------------*/
	/* 割り込みレベル設定）	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD80.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD80.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD80.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD80.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC80.BIT.EIRF80	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC80.BIT.EIP80	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC80.BIT.EITB80	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC80.BIT.EITB80	= 0;						/* 直接分岐方式						*/
		INTC2.EIC80.BIT.EIMK80	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC80.BIT.EIMK80	= 1 ;						/* 割り込みマスク					*/
	}

	/*-------------------------------------------------*/
	/* Port Setting					                   */
	/*-------------------------------------------------*/
	/* P0_2 第2兼用選択	*/
	PORT.PCR0_2.UINT32	= 0x00000051;					/* PORT0_2 TAUJ0I2						*/
														/* PM 	 = 1							*/
														/* PMC1  = 1							*/
														/* PFCAE = 0							*/
														/* PFCE  = 0							*/
														/* PFC   = 1							*/
}

/*=============================================================
	TAUJ0 CH2スタート						   
===============================================================*/
void 	freq_capture2_start ( void )
{
	TAUJ0.TS.UINT8   = 0x04;	
}

/*=============================================================
	TAUJ0 CH2ストップ						   
===============================================================*/
void freq_capture2_stop ( void )
{
	TAUJ0.TT.UINT8   = 0x04;	
}

/*==============================================================*/
/*	TAUJ0 CH2キャプチャ値取得関数								*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	基本カウンタ値を返す								*/
/*			オーバーフロー時は、FFFF_FFFFHを返す				*/
/*          0時は、上位側の0割を防止の為、1を返す				*/
/*																*/
/*==============================================================*/

u4 freq_capture2_cnt_read(void)
{
	u4 	u4_cnt	;
	
	u4_cnt = 0xffffffff;
	
	if ( 0 == ( TAUJ0.CSR2.UINT8 & 0x01 ) )				/* オーバーフローなし	*/
	{
		u4_cnt = TAUJ0.CDR2 ;
	}
	else
	{
		u4_cnt 				= 0xffffffff;
		TAUJ0.CSC2.UINT8	= 1;		/* OverflowFlagクリア	*/		
	}

	if ( u4_cnt == 0 )
	{
		u4_cnt = 1;						/* 上位で0割防止	*/
	}

	return( u4_cnt );
}

/*==============================================================*/
/*	TAUJ0 CH2キャプチャフラグ取得関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/

u1 freq_capture2_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC80.BIT.EIRF80 )
	{
		u1_flag 				= 1;
		INTC2.EIC80.BIT.EIRF80 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}
