/*===============================================================
+																+
+			Title:	 AMDTCTRL-C1Hソフトウェア				    +
+																+
+				date:		1th Apri,2017						+
+																+
+  	 	Copyright (C) Aoyama Motor Drive Technology    2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"iodefine.h"										/* 周辺定義ヘッダファイル						*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
/* ライブラリ/デバッグ関係		*/
/*=============================================================*/

/*=============================================================*/
/*					  iolib共通変数定義						　 */
/*=============================================================*/
u2		__u2_stopwatch1_cnt_start;
u2		__u2_stopwatch1_cnt_stop;
/*=============================================================*/

/*==============================================================*/
/*	TAUD1用クロック初期化関数									*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*			制御タイマ：TAUD1									*/
/*			CK0	= PCLK											*/
/*			CK1 = PCLK/2										*/
/*			CK2 = PCLK/8										*/
/*			CK3_PRE = PCLK										*/
/*			CK3	= 1MHzになるように設定							*/
/*			TAUD1が停止中に実行の事								*/
/*--------------------------------------------------------------*/
void	taud1prescale_0_2_8_0_init(void)
{
	/*-------------------------------------------------*/
	/* Set Clock Frequency                             */
	/*-------------------------------------------------*/
//	TAUD1.TPS = 0b0000 00010 0001 0000;				/* Prescaler Clock Select */
	TAUD1.TPS.UINT16 = 0x0310;

/*							CK3_PRE[15-12] = PCLK/2^0
							CK2[11- 8]     = PCLK/2^3
							CK1[ 7- 4]     = PCLK/2^1
							CK0[ 3- 0]     = PCLK/2^0
*/
	/*-------------------------------------------------*/
	/* Set Baudrate  CK3 = CK3PRE/BRS                  */
	/*-------------------------------------------------*/
	TAUD1.BRS			= (u4)(__CLKC_HSB)-1;		/* CK3_PRE/(TAUD1BRS+1)=1MHz */
	
}

/*==============================================================*/
/*	TAUD1用クロック初期化関数									*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*			制御タイマ：TAUD1									*/
/*			CK0	= PCLK											*/
/*			CK1 = PCLK/2										*/
/*			CK2 = PCLK/32										*/
/*			CK3_PRE = PCLK										*/
/*			CK3	= 1MHzになるように設定							*/
/*			TAUD1が停止中に実行の事								*/
/*--------------------------------------------------------------*/
void	taud1prescale_0_2_32_0_init(void)
{
	/*-------------------------------------------------*/
	/* Set Clock Frequency                             */
	/*-------------------------------------------------*/
//	TAUD1.TPS = 0b0000 0101 0001 0000;				/* Prescaler Clock Select */
	TAUD1.TPS.UINT16 = 0x0510;

/*							CK3_PRE[15-12] = PCLK/2^0
							CK2[11- 8]     = PCLK/2^3
							CK1[ 7- 4]     = PCLK/2^1
							CK0[ 3- 0]     = PCLK/2^0
*/
	/*-------------------------------------------------*/
	/* Set Baudrate  CK3 = CK3PRE/BRS                  */
	/*-------------------------------------------------*/
	TAUD1.BRS			= (u4)(__CLKC_HSB)-1;		/* CK3_PRE/(TAUD1BRS+1)=1MHz */
	
}


/*==============================================================*/
/*	TAUD1用クロック初期化関数									*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*			制御タイマ：TAUD1									*/
/*			CK0	= PCLK											*/
/*			CK1 = PCLK/2										*/
/*			CK2 = PCLK/64										*/
/*			CK3_PRE = PCLK										*/
/*			CK3	= 1MHzになるように設定							*/
/*			TAUD1が停止中に実行の事								*/
/*--------------------------------------------------------------*/
void	taud1prescale_0_2_64_0_init(void)
{
	/*-------------------------------------------------*/
	/* Set Clock Frequency                             */
	/*-------------------------------------------------*/
//	TAUD1.TPS = 0b0000 0110 0001 0000;				/* Prescaler Clock Select */
	TAUD1.TPS.UINT16 = 0x0610;

/*							CK3_PRE[15-12] = PCLK/2^0
							CK2[11- 8]     = PCLK/2^3
							CK1[ 7- 4]     = PCLK/2^1
							CK0[ 3- 0]     = PCLK/2^0
*/
	/*-------------------------------------------------*/
	/* Set Baudrate  CK3 = CK3PRE/BRS                  */
	/*-------------------------------------------------*/
	TAUD1.BRS			= (u4)(__CLKC_HSB)-1;		/* CK3_PRE/(TAUD1BRS+1)=1MHz */
	
}

/*==============================================================*/
/*	TAUD1全CH停止関数											*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*--------------------------------------------------------------*/
void	taud1_stop(void)
{
	TAUD1.TT.UINT16 = 0xFFFF;					/* 全TAUD1タイマ停止		*/
}

/*==============================================================*/
/*	インターバルタイマ10初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD0_CH0				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/

/*=============================================================*/
/*	TAUD1初期化関数（タイマ割り込み）						   */
/*=============================================================*/
void interval10_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD1 CH0停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 1;						/* CH0 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR0 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD1.CNT0 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD1.CMOR0.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD1.CMOR0.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR0.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD1.CMOR0.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD1.CMOR0.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR0.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD1.CMOR0.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR0.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC0.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x1;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x1;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x1;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel  Output Level Register   		       */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x1;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x1;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x1;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x1;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x1;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x1;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x1;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x0001;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD98.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD98.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD98.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD98.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC98.BIT.EIRF98	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC98.BIT.EIP98	= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC98.BIT.EITB98	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC98.BIT.EITB98	= 0;						/* 直接分岐方式						*/
		INTC2.EIC98.BIT.EIMK98	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC98.BIT.EIMK98	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ10スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH0				*/
/*--------------------------------------------------------------*/
void interval10_start(void)
{
	/* TAUD1(Interval Timer) Start			*/
	TAUD1.TS.UINT16 = 1;		
}

/*==============================================================*/
/*　インターバルタイマ10停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH0				*/
/*--------------------------------------------------------------*/
void interval10_stop(void)
{
	TAUD1.TT.UINT16 = 1;		
}

/*==============================================================*/
/*	インターバルタイマ12初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH2				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval12_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu )
{
	/*-------------------------------------------------*/
	/* 　TAUD1 CH2停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 4;						/* CH2 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR2 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD1.CNT2 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD1.CMOR2.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD1.CMOR2.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR2.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD1.CMOR2.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD1.CMOR2.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR2.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD1.CMOR2.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR2.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC2.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x4;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x4;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x4;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x4;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x4;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x4;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x4;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x4;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x4;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x4;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x4;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD100.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD100.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD100.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD100.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC100.BIT.EIRF100	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC100.BIT.EIP100		= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC100.BIT.EITB100	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC100.BIT.EITB100	= 0;						/* 直接分岐方式						*/
		INTC2.EIC100.BIT.EIMK100	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC100.BIT.EIMK100	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ12スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH2				*/
/*--------------------------------------------------------------*/
void interval12_start(void)
{
	TAUD1.TS.UINT16 = 4;		
}

/*==============================================================*/
/*　インターバルタイマ12停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH2				*/
/*--------------------------------------------------------------*/
void interval12_stop(void)
{
	TAUD1.TT.UINT16 = 4;		
}


/*==============================================================*/
/*	インターバルタイマ13初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH3				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval13_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD1 CH3停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 8;						/* CH3 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR3 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD1.CNT3 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD1.CMOR3.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD1.CMOR3.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR3.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD1.CMOR3.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD1.CMOR3.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR3.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD1.CMOR3.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR3.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC3.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x8;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x8;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x8;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x8;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x8;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x8;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x8;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x8;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x8;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x8;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x8;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD101.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD101.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD101.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD101.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC101.BIT.EIRF101	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC101.BIT.EIP101		= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC101.BIT.EITB101	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC101.BIT.EITB101	= 0;						/* 直接分岐方式						*/
		INTC2.EIC101.BIT.EIMK101	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC101.BIT.EIMK101	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ13スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH3				*/
/*--------------------------------------------------------------*/
void interval13_start(void)
{
	TAUD1.TS.UINT16 = 8;		
}

/*==============================================================*/
/*　インターバルタイマ13停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH3				*/
/*--------------------------------------------------------------*/
void interval13_stop(void)
{
	TAUD1.TT.UINT16 = 8;		
}


/*==============================================================*/
/*	インターバルタイマ14初期化関数								*/
/*	引数：														*/
/*			u4	u4_interval_us	: インターバル時間[uS]			*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH4				*/
/*							プリスケーラクロック CK3を選択		*/
/*	注意！！　CK3の分解能は、1uSになっている事					*/
/*--------------------------------------------------------------*/
void interval14_init ( u4 u4_interval_us, u1 u1_intlv , u1 u1_intcpu)
{
	/*-------------------------------------------------*/
	/* 　TAUD1 CH4停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 16;						/* CH4 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR4 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD1.CNT4 = u4_interval_us - 1;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD1.CMOR4.BIT.CKS	= 3;						/* 動作クロック（CK3）		*/
//	TAUD1.CMOR4.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR4.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD1.CMOR4.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD1.CMOR4.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR4.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD1.CMOR4.UINT16		= 0xC000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR4.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC4.UINT8 		= 1;							/* OVFフラグクリア 				*/

	/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x10;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x10;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x10;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x10;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x10;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x10;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x10;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x10;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x10;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x10;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x10;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	if ( 2 == u1_intcpu )
	{
		INTC2.EIBD102.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD102.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD102.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD102.BIT.PEID	= 1;							/* CPU1にバインド					*/
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC102.BIT.EIRF102	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC102.BIT.EIP102		= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC102.BIT.EITB102	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC102.BIT.EITB102	= 0;						/* 直接分岐方式						*/
		INTC2.EIC102.BIT.EIMK102	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC102.BIT.EIMK102	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　インターバルタイマ14スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH4				*/
/*--------------------------------------------------------------*/
void interval14_start(void)
{
	TAUD1.TS.UINT16 = 16;		
}

/*==============================================================*/
/*　インターバルタイマ14停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH4				*/
/*--------------------------------------------------------------*/
void interval14_stop(void)
{
	TAUD1.TT.UINT16 = 16;		
}


/*==============================================================*/
/*	STOPウォッチタイマ1初期化関数								*/
/*	引数：														*/
/*			なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH5				*/
/*							プリスケーラクロック CK2を選択		*/
/*	注意！！　CK2の分解能は、0.1uSになっている事				*/
/*=============================================================*/
void stopwatch1_init ( void )
{
	/*-------------------------------------------------*/
	/* 　TAUD1 CH5停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 0x20;						/* CH5 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR5 = 0xFFFF;

	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD1.CNT5 = 0;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD1.CMOR5.BIT.CKS	= 2;						/* 動作クロック（CK2）		*/
//	TAUD1.CMOR5.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR5.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD1.CMOR5.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD1.CMOR5.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR5.BIT.MD 	= 0;						/* インターバルタイマモード	*/

	TAUD1.CMOR5.UINT16		= 0x8000 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR5.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC5.UINT8 		= 1;							/* OVFフラグクリア 				*/

/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x20;						/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x20;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x20;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x20;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x20;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x20;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x20;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x20;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x20;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x20;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x20;						/* 変調禁止							*/

   /*====================================================*/

	TAUD1.TS.UINT16 = 0x20;									/* CH5　スタート					*/

}

/*==============================================================*/
/*　ストップウォッチタイマ1スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH5				*/
/*     フリーランタイマ　TAUD1_CH5のカウント値を退避			*/
/*--------------------------------------------------------------*/
void stopwatch1_start(void)
{
	__u2_stopwatch1_cnt_start = TAUD1.CNT5;		
}

/*==============================================================*/
/*　インターバルタイマ1停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH5				*/
/*--------------------------------------------------------------*/
u2	 stopwatch1_stop(void)
{
	u2	u2_temp_1;
	
	__u2_stopwatch1_cnt_stop = TAUD1.CNT5;	

	u2_temp_1 = __u2_stopwatch1_cnt_start - __u2_stopwatch1_cnt_stop;
	
	return ( u2_temp_1 );
	
}

/*==============================================================*/
/*	入力幅測定タイマ6_11初期化関数								*/
/*	引数：														*/
/*			u1	u1_level  1:ハイ幅測定							*/
/*                        0:Low幅測定							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH6-11			*/
/*							プリスケーラクロック CK1を選択		*/
/*	注意！！　CK1の分解能は、40MHzになっている事				*/
/*           入力は、PICを使用し、TAUD0I6-11を選択を想定		*/
/* 　　　　∴入力端子設定は、TAUD0で行う						*/
/*			 使用端子	P0_6/TAUD0I6~P0_11/TAUD0I11				*/
/*			 PICAの設定で、TAUD0TIN(m) に接続設定する			*/
/*			 freq_capture6_11_initとペアで使用する事			*/
/*--------------------------------------------------------------*/
void level_capture6_11_init ( u1 u1_level )
{
	/*-------------------------------------------------*/
	/* 　TAUD1 CH10-15停止 			                   */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 0x0F30;					/* CH6-11 STOP					*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR6 = 0x0000 ;
	TAUD1.CDR7 = 0x0000 ;
	TAUD1.CDR8 = 0x0000 ;
	TAUD1.CDR9 = 0x0000 ;
	TAUD1.CDR10 = 0x0000 ;
	TAUD1.CDR11 = 0x0000 ;
	/*-------------------------------------------------*/
	
	/*-------------------------------------------------*/
	/*  Channel Counter Register 			   */
	/*-------------------------------------------------*/
	TAUD1.CNT6 = 0x0000;
	TAUD1.CNT7 = 0x0000;
	TAUD1.CNT8 = 0x0000;
	TAUD1.CNT9 = 0x0000;
	TAUD1.CNT10 = 0x0000;
	TAUD1.CNT11 = 0x0000;
	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/
//	TAUD1.CMORx.BIT.CKS	= 1;						/* 動作クロック（CK1）				*/
//	TAUD1.CMORx.BIT.CCS	= 0;						/* カウントクロック(CKSによる）		*/	
//	TAUD1.CMORx.BIT.MAS	= 0;						/* スレーブ							*/			
//	TAUD1.CMORx.BIT.STS	= 1;						/* 有効エッジスタート、逆エッジ停止	*/
//	TAUD1.CMORx.BIT.COS	= 3;						/*									*/
//	TAUD1.CMORx.BIT.MD 	= 6;						/* キャプチャ&ワンカウントモード	*/
//  TAUD1.CMORx.BIT.MD0 = 0;						/* 動作中のトリガ無効				*/

	TAUD1.CMOR6.UINT16		= 0x42CC ;
	TAUD1.CMOR7.UINT16		= 0x42CC ;
	TAUD1.CMOR8.UINT16		= 0x42CC ;
	TAUD1.CMOR9.UINT16		= 0x42CC ;
	TAUD1.CMOR10.UINT16		= 0x42CC ;
	TAUD1.CMOR11.UINT16		= 0x42CC ;
	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	if ( 0 == u1_level )
	{
		TAUD1.CMUR6.UINT8 		= 2; 					/* LOWレベル測定				 */
		TAUD1.CMUR7.UINT8 		= 2; 					/* LOWレベル測定				 */
		TAUD1.CMUR8.UINT8 		= 2; 					/* LOWレベル測定				 */
		TAUD1.CMUR9.UINT8 		= 2; 					/* LOWレベル測定				 */
		TAUD1.CMUR10.UINT8 		= 2; 					/* LOWレベル測定				 */
		TAUD1.CMUR11.UINT8 		= 2; 					/* LOWレベル測定				 */
	}
	else
	{
		TAUD1.CMUR6.UINT8 		= 3; 					/* HIレベル測定					 */
		TAUD1.CMUR7.UINT8 		= 3; 					/* HIレベル測定					 */
		TAUD1.CMUR8.UINT8 		= 3; 					/* HIレベル測定					 */
		TAUD1.CMUR9.UINT8 		= 3; 					/* HIレベル測定					 */
		TAUD1.CMUR10.UINT8 		= 3; 					/* HIレベル測定					 */
		TAUD1.CMUR11.UINT8 		= 3; 					/* HIレベル測定					 */
	}
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC6.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUD1.CSC7.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUD1.CSC8.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUD1.CSC9.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUD1.CSC10.UINT8 		= 1;							/* OVFフラグクリア 				*/
	TAUD1.CSC11.UINT8 		= 1;							/* OVFフラグクリア 				*/
	/*============== TAUD1 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x0F30;							/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x0F30;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x0F30;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x0F30;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x0F30;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x0F30;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x0F30;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x0F30;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x0F30;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x0F30;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x0F30;						/* 変調禁止							*/
	/*====================================================*/
	
	/*-------------------------------------------------*/
	/* 　PICA設定 					                   */
	/*-------------------------------------------------*/
	PIC1A.TAUD1SEL.UINT32	&= ~0x00FFF000 ;				/* Bit23-12クリア					*/
	PIC1A.TAUD1SEL.UINT32	|=  0x00AAA000 ;
	/*-------------------------------------------------*/
	
	/* 割り込み禁止設定	*/
	INTC2.EIBD104.BIT.GPID		= 0;						/* CPU1にバインド					*/
	INTC2.EIBD104.BIT.PEID		= 1;						/* CPU1にバインド					*/
	INTC2.EIBD105.BIT.GPID		= 0;						/* CPU1にバインド					*/
	INTC2.EIBD105.BIT.PEID		= 1;						/* CPU1にバインド					*/
	INTC2.EIBD106.BIT.GPID		= 0;						/* CPU1にバインド					*/
	INTC2.EIBD106.BIT.PEID		= 1;						/* CPU1にバインド					*/
	INTC2.EIBD107.BIT.GPID		= 0;						/* CPU1にバインド					*/
	INTC2.EIBD107.BIT.PEID		= 1;						/* CPU1にバインド					*/
	INTC2.EIBD108.BIT.GPID		= 0;						/* CPU1にバインド					*/
	INTC2.EIBD108.BIT.PEID		= 1;						/* CPU1にバインド					*/
	INTC2.EIBD109.BIT.GPID		= 0;						/* CPU1にバインド					*/
	INTC2.EIBD109.BIT.PEID		= 1;						/* CPU1にバインド					*/
	
	INTC2.EIC104.BIT.EIMK104	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC105.BIT.EIMK105	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC106.BIT.EIMK106	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC107.BIT.EIMK107	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC108.BIT.EIMK108	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC109.BIT.EIMK109	= 1 ;						/* 割り込みマスク					*/
	
}

/*==============================================================*/
/*　キャプチャタイマ6_11スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH6-11			*/
/*--------------------------------------------------------------*/
void level_capture6_11_start(void)
{
	/* TAUD0(CH6-11)Start			*/
	TAUD1.TS.UINT16 = 0x0FC0;		
}

/*==============================================================*/
/*　キャプチャタイマ6_11停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH6-11			*/
/*--------------------------------------------------------------*/
void  levelcapture6_11_stop(void)
{
	/* TAUD0(CH6-11)Stopt			*/
	TAUD1.TT.UINT16 = 0x0FC0;		
}


/*==============================================================*/
/*	TAUD1 CH6-11キャプチャフラグ取得関数						*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/
u1 level_capture6_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC104.BIT.EIRF104 )
	{
		u1_flag 					= 1;
		INTC2.EIC104.BIT.EIRF104 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 level_capture7_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC105.BIT.EIRF105 )
	{
		u1_flag 					= 1;
		INTC2.EIC105.BIT.EIRF105 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 level_capture8_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC106.BIT.EIRF106 )
	{
		u1_flag 					= 1;
		INTC2.EIC106.BIT.EIRF106 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 level_capture9_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC107.BIT.EIRF107 )
	{
		u1_flag 					= 1;
		INTC2.EIC107.BIT.EIRF107 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 level_capture10_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC108.BIT.EIRF108 )
	{
		u1_flag 					= 1;
		INTC2.EIC108.BIT.EIRF108 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}

u1 level_capture11_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC109.BIT.EIRF109 )
	{
		u1_flag 					= 1;
		INTC2.EIC109.BIT.EIRF109 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}


	return(u1_flag);
}
/*==============================================================*/

/*==============================================================*/
/*	PWM1_15タイマ初期化関数										*/
/*	引数：														*/
/*			u4 u4_freq			:キャリア周波数[Hz]				*/
/*			u1 u1_logic			:PWM論理	0:正論理　それ以外:負論理	*/
/*			u1	u1_intlv		:割り込みレベル					*/
/*			u1 u1_intcpu	: 2: PE2 /2以外:PE1					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH14/15			*/
/*							P3_4/TAUD1O15						*/
/*							プリスケーラクロック CK0を選択		*/
/*	注意！！　CK0の分解能は、12.5nSになっている事				*/
/*--------------------------------------------------------------*/
void pwm1_15_init (  u4 u4_freq, u1 u1_logic ,u1 u1_intlv  , u1 u1_intcpu )
{
	/*-------------------------------------------------*/
	/* 　P1_15入力モード   			                   */
	/*-------------------------------------------------*/
	PORT.PCR1_15.UINT32		=	0x00000010;				/* 入力		*/
	
	/*-------------------------------------------------*/
	/* 　TAUD1 CH14,15停止 			                      */
	/*-------------------------------------------------*/
	TAUD1.TT.UINT16 		= 0xC000;					/* CH14,15 STOP					*/

	
	/*-------------------------------------------------*/
	/* Channel ModeOS Register	                  		*/
	/*-------------------------------------------------*/	
	/* マスタ（周期制御	）								*/
//	TAUD1.CMOR14.BIT.CKS	= 0;						/* 動作クロック（CK3）		*/
//	TAUD1.CMOR14.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR14.BIT.MAS	= 1;						/* マスタ					*/			
//	TAUD1.CMOR14.BIT.STS	= 0;						/* ソフトウェアトリガ		*/
//	TAUD1.CMOR14.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR14.BIT.MD 	= 0;						/* インターバルタイマモード	*/
//  TAUD1.CMOR14.BIT.MD0 	= 1;						/* 開始時割り込み発生		*/
	TAUD1.CMOR14.UINT16		= 0x0801 ;	
	
	/* スレーブ（Duty制御）								*/
//	TAUD1.CMOR15.BIT.CKS	= 0;						/* 動作クロック（CK3）		*/
//	TAUD1.CMOR15.BIT.CCS	= 0;						/* カウントクロック(CKSによる）	*/	
//	TAUD1.CMOR15.BIT.MAS	= 0;						/* スレーブ					*/			
//	TAUD1.CMOR15.BIT.STS	= 4;						/* マスタの割り込みトリガ	*/
//	TAUD1.CMOR15.BIT.COS	= 0;						/*							*/	
//	TAUD1.CMOR15.BIT.MD 	= 4;						/* ワンカウントモード		*/
//  TAUD1.CMOR15.BIT.MD0 	= 1;						/* 開始時割り込み発生		*/
	TAUD1.CMOR15.UINT16		= 0x0409 ;		

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR14.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */
	TAUD1.CMUR15.UINT8 		= 0; 							/* 立下り選択（意味なし）		 */

	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC14.UINT8 		= 1;							/* OVFフラグクリア 				*/	
	TAUD1.CSC15.UINT8 		= 1;							/* OVFフラグクリア 				*/	
	

	/*-------------------------------------------------*/
	/*  Channel Counter Register 					   */
	/*-------------------------------------------------*/
	TAUD1.CNT14 = 0;
	TAUD1.CNT15 = 0;

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	/* 周期設定											*/
	{
		double t_CMP	= ((double)(__CLKC_HSB*1e6))/((double)u4_freq);
		if(t_CMP>65535.)
		{
			TAUD1.CDR14		= 65535;
		}
		else
		{
			TAUD1.CDR14		= (u2)t_CMP ;
		}
	}	
	
								
	/* Duty設定											*/
	TAUD1.CDR15 = 0;										
	
	/*============== TAUD1 各チャネル一括	=================*/
	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		|= 0x8000;					/* 出力許可						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		|= 0x8000;						/* チャネル連動動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x8000;						/* 動作モード1					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	if ( 0 == u1_logic )
	{
		TAUD1.TOL.UINT16		&= ~0x8000;						/* アクティブレベルHI			 */
		PORT.P1.BIT.P1_15		= 0;
	}
	else
	{
		TAUD1.TOL.UINT16		|= 0x8000;						/* アクティブレベルHI			 */
		PORT.P1.BIT.P1_15		= 1;
	}
	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x8000;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x8000;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x8000;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x8000;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x8000;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x8000;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x8000;						/* 変調禁止							*/
	
	/*-------------------------------------------------*/
	/* 一斉書き換え関連レジスタ設定				      */
	/*-------------------------------------------------*/
	TAUD1.RDE.UINT16		|= 0xC000;						/* 一斉書き換え許可					*/	
	TAUD1.RDS.UINT16		&= ~0xC000;						/* マスタチャネルの一斉トリガ発生	*/	
	TAUD1.RDM.UINT16		&= ~0xC000;						/* マスタチャネルがカウント開始でトリガ発生					*/	
	TAUD1.RDC.UINT16		&= ~0xC000;						/* 一斉書き換えトリガとして動作しない*/	
	/*====================================================*/

	/* 割り込みレベル設定	*/
	/* TAUD1 CH14			*/
	if ( 2 ==  u1_intcpu )
	{
		INTC2.EIBD112.BIT.GPID	= 1;							/* CPU2にバインド					*/
		INTC2.EIBD112.BIT.PEID	= 2;							/* CPU2にバインド					*/
	}
	else
	{
		INTC2.EIBD112.BIT.GPID	= 0;							/* CPU1にバインド					*/
		INTC2.EIBD112.BIT.PEID	= 1;							/* CPU1にバインド					*/		
	}
	if( u1_intlv < 16 )
	{
		INTC2.EIC112.BIT.EIRF112	= 0 ;						/* 割り込みフラグクリア				*/
		INTC2.EIC112.BIT.EIP112		= u1_intlv ;				/* 割り込みレベル設定				*/
		INTC2.EIC112.BIT.EITB112	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC112.BIT.EITB112	= 0;						/* 直接分岐方式						*/
		INTC2.EIC112.BIT.EIMK112	= 0 ;						/* 割り込みマスククリア				*/
	}
	else
	{
		INTC2.EIC112.BIT.EIMK112	= 1 ;						/* 割り込みマスク					*/
	}

}

/*==============================================================*/
/*　PWMタイマ1_15スタート関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH14/15			*/
/*--------------------------------------------------------------*/
void pwm1_15_tim_start(void)
{
	/* TAUD1 CH14/15				*/
	TAUD1.TS.UINT16 = 0xC000;;		
}

/*==============================================================*/
/*　PWMタイマタイマ1_15停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH14/15			*/
/*--------------------------------------------------------------*/
void pwm1_15_tim_stop(void)
{
	/* TAUD1 CH14/15				*/
	TAUD1.TT.UINT16 = 0xC000;		
}

/*===============================================================*/
/*	PWMタイマ1_15　PWM出力許可								     */
/*===============================================================*/
void pwm1_15_start ( void )
{
	/* 第1兼用	*/
	PORT.PCR1_15.UINT32	= 0x00000040;			 		/* PORT1_15 TAUD1O15									*/

}

/*===============================================================*/
/*	PWMタイマ1_15　PWM出力停止								     */
/*===============================================================*/
void pwm1_15_stop ( void )
{
	/* 第1兼用	*/
	PORT.PCR1_15.UINT32	= 0x00000010;			 		/* PORT1_15 TAUD1O15									*/
}	

/*==============================================================*/
/*　PWMタイマタイマ1_15変調率設定関数							*/
/*	引数：	f4		f4_m :PWM変調率　　0~1.0					*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH14/15			*/
/*--------------------------------------------------------------*/	
void pwm1_15_setm_f ( f4 f4_m )
{

	u2	u2_cnt_m;
	
	if ( f4_m >= 1.0 )
	{
		u2_cnt_m = (u2)(TAUD1.CDR14+1) ;
	}
	else
	{
		if ( f4_m <= 0 )
		{
			u2_cnt_m = (u2)(0);
		}
		else
		{
			u2_cnt_m = (u2)(f4_m * (f4)(TAUD1.CDR14));
		}
	}

	TAUD1.CDR15	= (u2)u2_cnt_m;	
	TAUD1.RDT.UINT16  = 0xC000 ;		/* CH14/15 リロード許可		*/

}

/*==============================================================*/
/*	位相測定用タイマ1_1初期化関数								*/
/*	引数：														*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH1				*/
/*	注意！！　CK0の分解能は、80MHzになっている事				*/
/*--------------------------------------------------------------*/
void phase_capture1_1_init( void )
{
	/*--------------------------------------------------*/
	/* STOP : TAUD1 CH1									*/
	/*--------------------------------------------------*/
	TAUD1.TT.UINT16 		= 0x0002;					/* CH11 STOP						*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR1	= 0x00000000;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
//	TAUD1.CMOR1.BIT.CKS	= 0;						/* 動作クロック（CK0）				*/
//	TAUD1.CMOR1.BIT.CCS	= 0;						/* カウントクロック(CKSによる）		*/	
//	TAUD1.CMOR1.BIT.MAS	= 0;						/* スレーブ							*/			
//	TAUD1.CMOR1.BIT.STS	= 1;						/* 有効エッジスタート				*/
//	TAUD1.CMOR1.BIT.COS	= 1;						/*									*/
//	TAUD1.CMOR1.BIT.MD 	= 6;						/* カウントキャプチャモード		*/
//  TAUD1.CMOR1.BIT.MD0 	= 0;						/* 動作中のトリガ無効				*/	
	TAUD1.CMOR1.UINT16 		= 0x0156 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR1.UINT8 		= 0; 						/* 立ち下がり選択				 	*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC1.UINT8 		= 1;							/* OVFフラグクリア 				*/
	

/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x0002;							/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x0002;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x0002;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x0002;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x0002;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x0002;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x0002;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x0002;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x0002;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x0002;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x0002;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	INTC2.EIBD99.BIT.GPID	= 0;							/* CPU1にバインド					*/
	INTC2.EIBD99.BIT.PEID	= 1;							/* CPU1にバインド					*/

	INTC2.EIC99.BIT.EIRF99	= 0;						/* 割り込みフラグクリア				*/
	INTC2.EIC99.BIT.EITB99	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC99.BIT.EITB99	= 0;						/* 直接分岐方式						*/
	INTC2.EIC99.BIT.EIMK99	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC99.BIT.EIP99		= 15; 						/* 割り込みレベル設定				*/
	
	INTC2.EIC99.BIT.EIRF99	= 0 ;						/* 割り込みフラグクリア				*/

	/*-------------------------------------------------*/
	/* 端子設定	(第1兼用）			                   */
	/*-------------------------------------------------*/
	PORT.PCR1_1.UINT32 = 0x00000050 ;					/* P1_1/TAUD1I1									*/	

}

/*==============================================================*/
/*　位相測定用タイマ1_1スタート関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH1				*/
/*--------------------------------------------------------------*/
void phase_capture1_1_start(void)
{
	/* TAUD1 CH1 Start			*/
	TAUD1.TS.UINT16 = 0x0002;		
}

/*==============================================================*/
/*　位相測定用タイマ1_1停止関数									*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH1				*/
/*--------------------------------------------------------------*/
void phase_capture1_1_stop(void)
{
	/* TAUD1 CH1  Stop			*/
	TAUD1.TT.UINT16 = 0x0002;		
}


/*==============================================================*/
/*	TAUD1 CH1キャプチャ値取得関数								*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	カウンタ値を返す									*/
/*																*/
/*==============================================================*/
u2 phase_capture1_1_cnt_read(void)
{
	u2 	u2_cnt	;
	
	if ( 0 == TAUD1.CSR1.BIT.OVF )				/* オーバーフローなし	*/
	{
		u2_cnt = TAUD1.CDR1 ;
	}
	else
	{
//		u2_cnt 						= 0xFFFF;
		u2_cnt 						= TAUD1.CDR1 ; /* 位相キャプチャなので、そのまま値を返す */
		TAUD1.CSC1.UINT8 			= 1;		/* OverflowFlagクリア	*/		
	}

	return((u2)u2_cnt);
}

/*==============================================================*/
/*	TAUD1 CH1キャプチャフラグ取得関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/
u1 phase_capture1_1_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC99.BIT.EIRF99 )
	{
		u1_flag 	= 1;
		INTC2.EIC99.BIT.EIRF99 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}

	return(u1_flag);
}

/*==============================================================*/
/*	位相測定用タイマ1_15初期化関数								*/
/*	引数：														*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH15				*/
/*	注意！！　CK0の分解能は、80MHzになっている事				*/
/*--------------------------------------------------------------*/
void phase_capture1_15_init( void )
{
	/*--------------------------------------------------*/
	/* STOP : TAUD1 CH15									*/
	/*--------------------------------------------------*/
	TAUD1.TT.UINT16 		= 0x8000;					/* CH115 STOP						*/

	/*-------------------------------------------------*/
	/* Channel Data Register      	            	   */
	/*-------------------------------------------------*/
	TAUD1.CDR15	= 0x00000000;

	/*-------------------------------------------------*/
	/* Channel ModeOS Register		                   */
	/*-------------------------------------------------*/
//	TAUD1.CMOR15.BIT.CKS	= 0;						/* 動作クロック（CK0）				*/
//	TAUD1.CMOR15.BIT.CCS	= 0;						/* カウントクロック(CKSによる）		*/	
//	TAUD1.CMOR15.BIT.MAS	= 0;						/* スレーブ							*/			
//	TAUD1.CMOR15.BIT.STS	= 1;						/* 有効エッジスタート				*/
//	TAUD1.CMOR15.BIT.COS	= 1;						/*									*/
//	TAUD1.CMOR15.BIT.MD 	= 6;						/* カウントキャプチャモード		*/
//  TAUD1.CMOR15.BIT.MD0 	= 0;						/* 動作中のトリガ無効				*/	
	TAUD1.CMOR15.UINT16 		= 0x0156 ;

	/*-------------------------------------------------*/
	/* Channel Mode User Register                      */
	/*-------------------------------------------------*/
	TAUD1.CMUR15.UINT8 		= 0; 						/* 立ち下がり選択				 	*/
	
	/*-------------------------------------------------*/
	/* Channel Status Clear Register                   */
	/*-------------------------------------------------*/
	TAUD1.CSC15.UINT8 		= 1;							/* OVFフラグクリア 				*/
	

/*============== TAUD0 各チャネル一括	=================*/

	/*-------------------------------------------------*/
	/* Channel Output Enable Register                  */
	/*-------------------------------------------------*/
	TAUD1.TOE.UINT16		&= ~0x8000;							/* 出力禁止						 */

	/*-------------------------------------------------*/
	/* Channel Output Mode Register                    */
	/*-------------------------------------------------*/
	TAUD1.TOM.UINT16 		&= ~0x8000;						/* チャネル単体動作				 */

	/*-------------------------------------------------*/
	/* Channel Output Configuration Register           */
	/*-------------------------------------------------*/
	TAUD1.TOC.UINT16		&= ~0x8000;						/* トグルモード					 */

	/*-------------------------------------------------*/
	/* Channel Output Level Register		           */
	/*-------------------------------------------------*/
	TAUD1.TOL.UINT16		&= ~0x8000;						/* アクティブレベルHI			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TDE.UINT16 		&= ~0x8000;						/* デットタイム動作禁止			 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Mode                    */
	/*-------------------------------------------------*/
	TAUD1.TDM.UINT16	 	&= ~0x8000;						/* 偶数チャネル					 */

	/*-------------------------------------------------*/
	/* Channel DeadTime Output Level                   */
	/*-------------------------------------------------*/
	TAUD1.TDL.UINT16		&= ~0x8000;						/* 正相にデットタイム付加		 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Enable Register         */
	/*-------------------------------------------------*/
	TAUD1.TRE.UINT16		&= ~0x8000;						/* リアルタイム出力禁止			 */

	/*-------------------------------------------------*/
	/* Channel RealTime Output Register                */
	/*-------------------------------------------------*/
	TAUD1.TRO.UINT16 		&= ~0x8000;						/* TRO出力 LOW					*/

	/*-------------------------------------------------*/
	/* Channel RealTime Output Control Register        */
	/*-------------------------------------------------*/
	TAUD1.TRC.UINT16 		&= ~0x8000;						/* リアルタイム出力生成トリガ選択 */

	/*-------------------------------------------------*/
	/* Channel modulation output enable Register       */
	/*-------------------------------------------------*/
	TAUD1.TME.UINT16		&= ~0x8000;						/* 変調禁止							*/
	/*====================================================*/

	/* 割り込みレベル設定	*/
	INTC2.EIBD113.BIT.GPID	= 0;							/* CPU1にバインド					*/
	INTC2.EIBD113.BIT.PEID	= 1;							/* CPU1にバインド					*/

	INTC2.EIC113.BIT.EIRF113	= 0;						/* 割り込みフラグクリア				*/
	INTC2.EIC113.BIT.EITB113	= 1;						/* テーブル参照方式					*/
//		INTC2.EIC113.BIT.EITB113= 0;						/* 直接分岐方式						*/
	INTC2.EIC113.BIT.EIMK113	= 1 ;						/* 割り込みマスク					*/
	INTC2.EIC113.BIT.EIP113		= 15; 						/* 割り込みレベル設定				*/
	
	INTC2.EIC113.BIT.EIRF113	= 0 ;						/* 割り込みフラグクリア				*/

	/*-------------------------------------------------*/
	/* 端子設定	(第1兼用）			                   */
	/*-------------------------------------------------*/
	PORT.PCR1_15.UINT32 = 0x00000050 ;					/* P1_15/TAUD1I15							*/	

}

/*==============================================================*/
/*　位相測定用タイマ1_15スタート関数							*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH15				*/
/*--------------------------------------------------------------*/
void phase_capture1_15_start(void)
{
	/* TAUD1 CH15 Start			*/
	TAUD1.TS.UINT16 = 0x8000;		
}

/*==============================================================*/
/*　位相測定用タイマ1_15停止関数								*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUD1_CH15				*/
/*--------------------------------------------------------------*/
void phase_capture1_15_stop(void)
{
	/* TAUD1 CH15  Stop			*/
	TAUD1.TT.UINT16 = 0x8000;		
}


/*==============================================================*/
/*	TAUD1 CH15キャプチャ値取得関数								*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	カウンタ値を返す									*/
/*																*/
/*==============================================================*/
u2 phase_capture1_15_cnt_read(void)
{
	u2 	u2_cnt	;
	
	if ( 0 == TAUD1.CSR15.BIT.OVF )				/* オーバーフローなし	*/
	{
		u2_cnt = TAUD1.CDR15 ;
	}
	else
	{
//		u2_cnt 						= 0xFFFF;
		u2_cnt 						= TAUD1.CDR15 ; /* 位相キャプチャなので、そのまま値を返す*/
		TAUD1.CSC15.UINT8 			= 1;		/* OverflowFlagクリア	*/		
	}

	return((u2)u2_cnt);
}

/*==============================================================*/
/*	TAUD1 CH15キャプチャフラグ取得関数							*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　	キャプヤが行われたか？どうかを返す					*/
/*			本関数で、割り込みフラグをクリアする				*/
/*			非同期入力の為、入力周波数に対して、				*/
/*			十分、読み出し間隔を早くする必要がある				*/
/*																*/
/*==============================================================*/
u1 phase_capture1_15_flag_read(void)
{
	u1 	u1_flag	;
	
	u1_flag = 0;
	
	if ( 1 == INTC2.EIC113.BIT.EIRF113 )
	{
		u1_flag 	= 1;
		INTC2.EIC113.BIT.EIRF113 	= 0;				/* 割り込みフラグクリア	*/
	}
	else
	{
		u1_flag 	= 0;
	}

	return(u1_flag);
}

/*==============================================================*/
/*　位相測定用タイマ1_1/1_15同時スタート関数					*/
/*	引数：	なし												*/
/*--------------------------------------------------------------*/
/*	備考														*/
/*	　　　　使用周辺機能										*/
/*							制御タイマ：TAUJ1_CH2				*/
/*--------------------------------------------------------------*/
void phase_capture1_1_1_15_start(void)
{
	/* TAUD1 CH1/15 Start			*/
	TAUD1.TS.UINT16 = 0x8002;		
}

