/*===============================================================
+																+
+	Title:		共通ヘッダファイル定義							+
+																+
+				date:		15th Nov,2022						+
+																+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2022		+
+																+
===============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/
/*   	                            			共通インクルードファイル					   	     		    */
/*--------------------------------------------------------------------------------------------------------------*/
#ifndef	__COMMON_INC
#define	__COMMON_INC

/* 標準ライブラリ関係	*/
#include	"iodefine.h"										/* 周辺定義ヘッダファイル						*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
#include    "iolib/iolib_all.h"									/* IOライブラリヘッダファイル					*/
#include    <mathf.h>											/* 数学標準ライブラリ(float用)					*/
#include    <math.h>											/* 数学標準ライブラリ（double用）				*/
#include	"../AWatcher/cmdmoni_wt.h"							/* AWatcherヘッダファイル						*/

/* GRAM共通変数定義				*/
#include	"commonPE1toPE2.h"									/* 共通変数定義									*/
#include	"commonPE2toPE1.h"									/* 共通変数定義									*/

#endif

/*--------------------------------------------------------------------------------------------------------------*/




