/*===============================================================
+																+
+			Title:	IPMベクトル制御ソフトウェア					+
+				(RH850/C1H専用コントローラ対応品)				+
+																+
+				date:		1th Apr,2017						+
+																+
+		Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/*					 pragmaファイルの定義					   */
/*=============================================================*/

/*=============================================================*/

/*=============================================================*/
/*				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include	"fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include	"fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
#include	"fpmsm_user_inv1.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/*						デバッグ用変数定義					   */
/*=============================================================*/

/*=============================================================*/

/*=============================================================*/
/*					関数のプロトタイプ宣言					   */
/*=============================================================*/
void		fb_hw_ctrl_init		(void);							/* システムハードウェア初期化関数				*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:		void fb_hw_ctrl_init (void)			+
+			Function:		ハードウェア初期化関数				+
+																+
+					1)		PWM初期化							+
+					2)		AD初期化							+
+					3)		タイマ初期化						+
+																+
+		Return Value:		No									+
+				date:		1th Apr,2017						+
+																+
===============================================================*/
void fb_hw_ctrl_init (void)
{

	/*============================================================*/
	/*						設定注意事項					　	  */
	/*============================================================*/
	// FC_PWM_INV0,PWM_SOURCE_INV0と
	// FC_PWM_INV1,PWM_SOURCE_INV1は、同一値である事
	/*============================================================*/

	/*============================================================*/
	/*					インバータ0PWM&同期割込み初期化		　	  */
	/*============================================================*/
	/* PWM初期化				*/
	tsg30_init(FC_PWM_INV0, DEAD_TIME_INV0_NS, DEAD_TIME_INV0_NS, PWM_LOGIC_INV0, PWM_SOURCE_INV0, LEV_INT_PWM, N_FC_INV0 ,1);
																/* PWM初期化									*/
																/* 第1引数：キャリア周波数[kHz]					*/
																/* 第2引数：デッドタイム（ON側）[ns]			*/
																/* 第3引数：デッドタイム（OFF側）[ns]			*/
																/* 第4引数：ロジック　0：正論理　1：負論理		*/
																/* 第5引数：割り込みソース	0:なし　1:000(山)　2:111(谷)　3：両方	*/
																/* 第6引数：割り込みレベル						*/
																/* 第7引数：割り込み間引ぎ数					*/
																/* 第8引数：割り込みCPU選択						*/
	/* PWM出力停止				*/
	dpinv0_stop();												/* PWM停止（必須）								*/

	dpinv0_extgb_init(1);										/* 外部GBを↑エッジで初期化						*/
	/*============================================================*/

	/*============================================================*/
	/*					インバータ0PWM&同期割込み初期化		　	  */
	/*============================================================*/
	/* PWM初期化				*/
	// tsg31_init(FC_PWM_INV0, DEAD_TIME_INV0_NS, DEAD_TIME_INV0_NS, PWM_LOGIC_INV0, PWM_SOURCE_INV0, LEV_INT_PWM, N_FC_INV0 ,2);
																/* PWM初期化									*/
																/* 第1引数：キャリア周波数[kHz]					*/
																/* 第2引数：デッドタイム（ON側）[ns]			*/
																/* 第3引数：デッドタイム（OFF側）[ns]			*/
																/* 第3引数：デッドタイム（OFF側）[ns]			*/
																/* 第4引数：ロジック　0：正論理　1：負論理		*/
																/* 第5引数：割り込みソース	0:なし　1:000(山)　2:111(谷)　3：両方	*/
																/* 第6引数：割り込みレベル						*/
																/* 第7引数：割り込み間引ぎ数					*/
																/* 第8引数：割り込みCPU選択						*/
	/* PWM出力停止				*/
	// dpinv1_stop();												/* PWM停止（必須）								*/
	// dpinv1_extgb_init(1);										/* 外部GBを↑エッジで初期化						*/
	// /*============================================================*/

	/*============================================================*/
	/*					外部GB信号フィルタ設定				　	  */
	/*============================================================*/
	DNF.P010CTL10.UINT8 = 0x64;									// INV0 用　GBフィルタサンプリング回数5回/クロック:pclk/16
	DNF.P010CTL11.UINT8 = 0x64;									// INV1 用　GBフィルタサンプリング回数5回/クロック:pclk/16

	DNF.P010CTL10.BIT.NFEN = 1;									// ディジタルフィルタ動作許可
	DNF.P010CTL11.BIT.NFEN = 1;									// ディジタルフィルタ動作許可
	/*============================================================*/

	/*============================================================*/
	/*						ADコンバータ初期化					　*/
	/*============================================================*/
	/* ADの設定					*/
	adcc0_init(0);												/* ADCC0初期化									*/
																/* ADCC0I00/ADCC0I03変換する					*/
																/* ADCC0I20/ADCC0I21変換する					*/
	adcc1_init();												/* ADCC1初期化									*/

	adcc0_sg4_trig_set(0);										/* ADCC0 SG4トリガ　TSG30						*/
	adcc1_sg4_trig_set(0);										/* ADCC1 SG4トリガ　TSG30						*/

	dpinv0_set_addelay(0);										/* ADサンプリングディレイ（遅れのみ）			*/
	dpinv1_set_addelay(0);										/* ADサンプリングディレイ（遅れのみ）			*/
	/* 注：この後dpinv0_setuvw()実行することで反映	*/

	adcc1_sg4_int_init( -1 , 2)	;								/* PE2にバインド、割り込みはマスク				*/
																/* AD変換待ち用（割り込みバインドをしないと		*/
																/* EIC181等にPE2で書き込みができない為			*/
	/*============================================================*/

	/*============================================================*/
	/*				 初期変調率/キャリア周波数設定				　*/
	/*============================================================*/
	dpinv0_setuvwf_f_V3(0.0, 0.0, 0.0, FC_PWM_INV0);			/* PWM初期化									*/
																/* 第1引数：U相変調率（-1.0～+1.0）				*/
																/* 第2引数：V相変調率（-1.0～+1.0）				*/
																/* 第3引数：W相変調率（-1.0～+1.0）				*/
																/* 第4引数：キャリア周波数[Hz]					*/
	// dpinv1_setuvwf_f_V3(0.0, 0.0, 0.0, FC_PWM_INV0);			/* PWM初期化									*/
																/* 第1引数：U相変調率（-1.0～+1.0）				*/
																/* 第2引数：V相変調率（-1.0～+1.0）				*/
																/* 第3引数：W相変調率（-1.0～+1.0）				*/
																/* 第4引数：キャリア周波数[Hz]					*/
	/*============================================================*/


	/*==========================================================*/
	/*			インターバル/PWMタイマ初期化					*/
	/*==========================================================*/
	taud0_stop();												/* TAUD0全CH停止								*/
	taud0prescale_0_2_8_0_init();								/* TADU0プリスケーラ初期化						*/
	taud1_stop();												/* TAUD1全CH停止								*/
	taud1prescale_0_2_8_0_init();								/* TADU1プリスケーラ初期化						*/

	interval00_init(1000, LEV_INT_TIMER, 1);					/* タイマ割り込みは1ms(=1000us)に固定,CPU1側割り込み*/
	// interval01_init(20, LEV_INT_20US_TIMER, 1);					/* タイマ割り込みは20uSに固定,CPU1側割り込み		*/

	// interval10_init(1000, LEV_INT_TIMER, 2);					/* タイマ割り込みは1ms(=1000us)に固定,CPU2側割り込み*/
	// interval12_init(20, LEV_INT_20US_TIMER, 2);					/* タイマ割り込みは20uSに固定,CPU2側割り込み		*/

	// stopwatch0_init();
	// stopwatch1_init();
	/*============================================================*/

	/*==========================================================*/
	/*						RDC/ENC初期化			　			*/
	/*==========================================================*/
#if USE_RDC_INV0 == 1 /* レゾルバ */
	{
		u2 u2_temp_1;
		u2_temp_1 = rdc20_init( (u1)(0) , (u1)(1) ,(u1)(0) ,(u1)(1) , (u1)(1) );		/* RDC20初期化							*/
																						/* 第1引数:	0:なし　1:Z割り込み	2:COMP割り込み出力　3：両方(Z,COMP)		*/
																						/* 第2引数:	0:出力なし1:ABZ相出力（Z相は割り込みも出力）				*/
																						/* 第3引数:	 0:BISチェックしない。1:チェックする。（現在無効）			*/
																						/* 第4引数:	0:モニタ出力しない　1:モニタ出力する						*/
																						/* 第5引数:	0:HSYSなし			1：HSYSあり								*/


		// Z相割りこみ設定
		// rdc20_init_interrupt( LEV_INT_RDC_Z , (u1)(1) , 1 );							/* Z相割込み有効														*/


																						/* RDC20SINMNT/COSMNT出力しない				*/

		rdc20_ABZ_Terminal_output();										/* ABZ出力								*/



		if ( u2_temp_1 != 0 ) { ;;}
		else
		{
			//1:1 12bit
			enca0_init( (u2)(4095) , (u1)(1) ) ;
			// enca1_init( (u2)(4095) , (u1)(2) ) ;							/* RDC20のABZをENC1に接続(第2引数=2)	*/
		}

		u2_temp_1 = u2_rdc20_cnt_read();

		enca0_cnt_set ( (u2)(u2_temp_1) , (u1)(0) );
		// enca1_cnt_set ( (u2)(u2_temp_1) , (u1)(0) );						/* RDC20の値をENC1にも設定				*/
	}

	// {
		// u2 u2_temp_1;
		// u2_temp_1 = rdc21_init( (u1)(0) , (u1)(1) ,(u1)(0) ,(u1)(0)  , (u1)(1) );		/* RDC21初期化							*/
																						// /* RDC21SINMNT/COSMNT出力しない			*/
																						// /* 第1引数:	0:なし　1:Z割り込み	2:COMP割り込み出力　3：両方(Z,COMP)		*/
																						// /* 第2引数:	0:出力なし1:ABZ相出力（Z相は割り込みも出力）				*/
																						// /* 第3引数:	 0:BISチェックしない。1:チェックする。（現在無効）			*/
																						// /* 第4引数:	0:モニタ出力しない　1:モニタ出力する						*/
																						// /* 第5引数:	0:HSYSなし			1：HSYSあり								*/
		// // Z相割りこみ設定
		// rdc21_init_interrupt( LEV_INT_RDC_Z , (u1)(1) , 1 );							/* Z相割込み有効														*/

// //		rdc21_ABZ_Terminal_output();										/* ABZ出力								*/

		// if ( u2_temp_1 != 0 ) { ;;}
		// else
		// {
	// #if MOT_INV1_REZO_POLE == 4
			// //4:1 10bit
			// enca1_init( (u2)(1023) , (u1)(1) ) ;

	// #elif MOT_INV1_REZO_POLE == 2
			// //2:1 11bit
			// enca1_init( (u2)(2047) , (u1)(1) ) ;

	// #else
			// //1:1 12bit
			// enca1_init( (u2)(4095) , (u1)(1) ) ;
	// #endif

		// }
		// u2_temp_1 = u2_rdc21_cnt_read();

	// #if MOT_INV1_REZO_POLE == 4
		// //4:1 10bit
		// while(u2_temp_1 > 1023)
		// {
			// u2_temp_1		= u2_temp_1 - (u2)(1023);
		// }
	// #elif MOT_INV1_REZO_POLE == 2
		// //2:1 11bit
		// while(u2_temp_1 > 2047)
		// {
			// u2_temp_1		= u2_temp_1 - (u2)(2047);
		// }
	// #else
		// //1:1 12bit
	// #endif
		// enca1_cnt_set ( (u2)(u2_temp_1) , (u1)(0) );
	// }

	// エンコーダ0割込み設定
	// enca0_ccr1_set(0x2000, DIR_INV0_ENC);							/* ENCA0割り込み位置設定						*/
	// enca0_init_interrupt(LEV_INT_ENC,1);							/* ENCA0割り込みレベル設定、割り込み許可		*/
	enca0_start();

	// // enca1_ccr1_set(0x2000, DIR_INV0_ENC);							/* ENCA1割り込み位置設定						*/
	// // enca1_init_interrupt(LEV_INT_ENC,1);							/* ENCA1割り込みレベル設定、割り込み許可		*/
																	// // /* ENCA0と同一レベル設定だが、デフォルトがENCA0 */
																	// // /* の優先順位が高い為、同時に割り込みが入った場合*/
																	// // /* ENCA0が優先される							*/
	// // enca1_start();

	// // エンコーダ1CMP1設定はPE2 fim_main.c で行う
	// // enca1_ccr1_set(0x2000, DIR_INV1_ENC);							/* ENCA1割り込み位置設定						*/
	// enca1_init_interrupt(LEV_INT_ENC,2);							/* ENCA1割り込みレベル設定、割り込み許可		*/
	// // enca1_start();

#else /* エンコーダ */
	{
		enca0_init( (u2)(CNT_ENC0_MAX) , (u1)(3) ) ;					/* 入力端子をENCA1Exを選択						*/
		// enca0_ccr1_set(0x2000, DIR_INV0_ENC);							/* ENCA0割り込み位置設定						*/
		// enca0_init_interrupt(LEV_INT_ENC,1);							/* ENCA0割り込みレベル設定、割り込み許可		*/
		enca0_start();
		
		// // enca1_init( (u2)(CNT_ENC0_MAX/PF_INV0) , (u1)(0) ) ;
		enca1_init( (u2)(CNT_ENC0_MAX) , (u1)(0) ) ;
		// // enca1_ccr1_set(0x2000, DIR_INV1_ENC);							/* ENCA1割り込み位置設定						*/
		// enca1_init_interrupt(LEV_INT_ENC,1);							/* ENCA1割り込みレベル設定、割り込み許可		*/
		// // enca1_start();
	}

#endif
	/*============================================================*/

	/*============================================================*/
	/*				温度測定用タイマ初期化						  */
	/*============================================================*/
//	freq_capture6_11_init ( -1, 1)	;								/* 割込みマスク、CPU1選択					*/
//	level_capture6_11_init(-1);										/* 割込みマスク								*/
	/*============================================================*/

	/*============================================================*/
	/*						CPLDI/F設定()						　*/
	/*============================================================*/


	csih0_init(2);												/* 引数:ボーレート[Mbps](2/4/8のみ）			*/
	/*============================================================*/

	/*============================================================*/
	/*						電源ICI/F設定(RAA270000)			　*/
	/*============================================================*/
	csih1_RA270000_init(500);									/* 引数:ボーレート[Kbps]						*/
	/*============================================================*/

	/*============================================================*/
	/*						CANドライバ設定						　*/
	/*============================================================*/
	fb_can0_driver_init();						/* CAN CH0設定		*/
//	fb_can1_driver_init();						/* CAN CH1設定		*/

	can_init((u1)(0x01) ) ;										/* ここで、マイコンが設定する。					*/
																/* CAN設定の最後に実行の事						*/
																/* 引数は、設定CHを指定							*/
																/* Bit3:CH3/Bit2:CH2/Bit1:CH1/Bit0:CH0			*/
																/*	  0:使用しない/ 1:使用する					*/
	/*============================================================*/

	/*============================================================*/
	/*				H/W要因判定用外部割り込み初期化				　*/
	/*============================================================*/
	//void ex_intpx_init ( u1 u1_intpx , u1 u1_filter , u1 u1_level , u1 u1_intlv )
	ex_intpx_init( 0 , 0 , 2 , -1 );							/* 	OC_U0									*/
	ex_intpx_init( 1 , 0 , 2 , -1 );							/* 	OC_V0									*/
	ex_intpx_init( 2 , 0 , 2 , -1 );							/* 	OC_W0									*/
	ex_intpx_init( 6 , 0 , 2 , -1 );							/*  OV0										*/

	ex_intpx_init( 3 , 0 , 2 , -1 );							/* 	OC_U1									*/
	ex_intpx_init( 4 , 0 , 2 , -1 );							/* 	OC_V1									*/
	ex_intpx_init( 5 , 0 , 2 , -1 );							/* 	OC_W1									*/
	ex_intpx_init( 7 , 0 , 2 , -1 );							/*  OV1										*/


	//void freq_capture5_init ( u1 u1_intlv , u1 u1_level ,u1 u1_intcpu)
	freq_capture5_init ( -1 , 1 , 1);							/* EMGエッジ検出用にTimerCaptureを使用する	*/
																/* 割込み禁止/立ち上がり/CPU1側使用				*/
	freq_capture5_start();
	/*============================================================*/

	/*============================================================*/
	/*				PE2/PE1　I/F同期処理						　*/
	/*============================================================*/
	/* PE2 周辺機能アクセス許可 */
	pbg_prot_clr(2 , 1 );										/* RDC21アクセス許可					*/

	pbg_prot_clr(3 , 0 );										/* ADCC0アクセス許可					*/
	pbg_prot_clr(3 , 1 );										/* ADCC1アクセス許可					*/
	pbg_prot_clr(3 , 5 );										/* ポートグループアクセス許可			*/

	pbg_prot_clr(4 , 0 );										/* TAUD0アクセス許可					*/
	pbg_prot_clr(4 , 1 );										/* TAUD1アクセス許可					*/
	pbg_prot_clr(4 , 5 );										/* TAPA3アクセス許可					*/
	pbg_prot_clr(4 , 7 );										/* TSG31アクセス許可					*/

	pbg_prot_clr(5 , 4 );										/* RS-CANアクセス許可					*/


	core0_peg_init((u1)(2));									/* LocalRAM PE2 アクセス許可			*/
																/* AWatcherからR/Wする場合				*/


	/* PE1 初期化完了通知( PE1 → PE2 ) */
	IPIRSS.IPIR_CH0.BIT.PE2	= 1;								/* PE2側に割り込み要求					*/

	/* PE2 初期化確認応答待ち( PE2 → PE1 ) */
	while ( 0 == INTC1.EIC0.BIT.EIRF0 ){;;}

	/* PE間割り込みCH0 割り込みフラグクリア */
	INTC1.EIC0.BIT.EIRF0 = 0;
	/*============================================================*/

	/*============================================================*/
	/*					インバータタイマ開始					　*/
	/*============================================================*/
	// tsg30_31_start();											/* TSG30/TSG31同時スタート				*/
	tsg30_start();											/* TSG30スタート				*/
	/*============================================================*/

	/*============================================================*/
	/*					タイマスタート（CPU1)					　*/
	/*============================================================*/
	interval00_start();
	// interval01_start();
	/*============================================================*/
	
	/*============================================================*/
	/*					タイマスタート（CPU2)					　*/
	/*============================================================*/
	// interval10_start();
	// interval12_start();
	/*============================================================*/

	/*============================================================*/
	/*					温度測定用タイマスタート				　*/
	/*============================================================*/
//	freq_capture6_11_start();
//	level_capture6_11_start();
	/*============================================================*/

	/*============================================================*/
	/*					SefetyLoop許可							　*/
	/*============================================================*/
	// Set_DO_SFTY(1);
	/*============================================================*/

}



