/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2016		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
//#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/
/*=============================================================*/

/*=============================================================*/
/* 				サーミスタ定数変数定義						   */
/*=============================================================*/
#define		TH_H			0									/* サーミスタのVCC側で観測する場合（プルアップ型）	*/
#define		TH_L			1									/* サーミスタのGND側で観測する場合（プルダウン型）	*/

typedef struct ST_TH_PARAM {
	float	B;													/* B係数										*/
	float	R_T1;												/* 規定温度における抵抗値						*/
	float	T1;													/* 規定温度										*/
	float	D;													/* 熱放散定数									*/
	float	R_PU;												/* プルアップ抵抗								*/
	float	R_PD;												/* プルダウン抵抗								*/
	float	VCC;												/* プルアップ電源電圧							*/
	float	ADRES;												/* AD分解能										*/
	int		H_L;												/* サーミスタの電圧検出位置（0:プルアップ側　1:プルダウン側	*/
}TH_PARAM;
/*=============================================================*/
