/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2016		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include    "vals_typedef.h"									/* 変数型定義ヘッダファイル						*/

/* ライブラリ/デバッグ関係		*/
//#include    "mathlib.h"										/* 数学関数ヘッダファイル						*/
#include	<math.h> 
#include    "fb_therm_calc.h"									/* サーミスタ温度変換ヘッダファイル				*/
/*=============================================================*/

/*=============================================================*/
/* 				サーミスタ温度変換							   */
/*=============================================================*/
f4 f4_thermister_calc_2_8(u2 in, TH_PARAM param)
{
	float vin = (float)in*(param.VCC/param.ADRES);
	float Rx;
	float lnRx;
	float T;
	
	// 抵抗値計算
	if(TH_H == param.H_L)
	{
		Rx		= (param.R_PD*param.VCC - vin*(param.R_PU+param.R_PD))/(vin-param.VCC);
	}
	else
	{
		Rx		= param.R_PD*param.VCC/vin - param.R_PU - param.R_PD;
	}
	
	if(Rx<1.0)
	{
		Rx = 1.0;
	}

	// 温度変換
	lnRx	= logf(Rx);
	T		= param.B/(-logf(param.R_T1)+lnRx+(param.B/(param.T1+273.15)));
	// 熱拡散定数補正
	T		= T - param.D*vin*vin/Rx;
	// セ氏温度
	T		= T - 273.15;
	// ±255℃にリミット
	T		= (T>255.0)?(255.0):((T<-255.0)?(-255.0):(T));

	return(T);
}
/*=============================================================*/
