/*===============================================================
+																+
+			Title:	IPMベクトル制御ソフトウェア					+
+				(RH850/C1H専用コントローラ対応品)				+
+																+
+				date:		22th Nov,2017						+
+																+
+		Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/*					 ヘッダファイルのインクルード			   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include	"fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include	"fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/*						I/Fシステム制御フラグ定義			   */
/*=============================================================*/
u1		u1_set_rly1 = 1;
u1		u1_set_rly2 = 1;
u1		u1_set_rly3 = 1;
u1		u1_set_rly4 = 1;
u1		u1_set_rly5 = 1;
u1		u1_set_rly6 = 1;
u1		u1_set_rly7 = 1;
u1		u1_set_rly8 = 1;

u1		u1_set_do0 = 0;
u1		u1_set_do1 = 0;
u1		u1_set_do2 = 0;
u1		u1_set_do3 = 0;
u1		u1_set_do4 = 0;
u1		u1_set_do5 = 0;
u1		u1_set_do6 = 0;

u1		u1_set_udo0 = 0;
u1		u1_set_udo1 = 0;
u1		u1_set_udo2 = 0;
u1		u1_set_udo3 = 0;

u1		u1_get_udi0 = 0;
u1		u1_get_udi1 = 0;
u1		u1_get_udi2 = 0;
u1		u1_get_udi3 = 0;

u1		u1_get_di0 = 0;
u1		u1_get_di1 = 0;
u1		u1_get_di2 = 0;
u1		u1_get_di3 = 0;
u1		u1_get_di4 = 0;
u1		u1_get_di5 = 0;
u1		u1_get_di6 = 0;
u1		u1_get_di7 = 0;
/*=============================================================*/

/*=============================================================*/
/*							デバッグ用変数定義				   */
/*=============================================================*/
/*=============================================================*/

/*=============================================================*/
/*					関数のプロトタイプ宣言					   */
/*=============================================================*/
void	fi_1ms_inv0_ifctrl			(void);						/* タイマ割込みI/F制御関数						*/
void	fb_1ms_inv0_ifctrl_init		(void);						/* タイマ割込みI/F制御初期化関数				*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:		void fi_1ms_inv0_ifctrl (void)		+
+			Function:	　	タイマ割込みI/F制御関数				+
+																+
+																+
+		Return Value:		No									+
+				date:		22th Nov,2017						+
+																+
===============================================================*/
void fi_1ms_inv0_ifctrl (void)
{

	/*============================================================*/
	/*					   ローカル変数定義		　				  */
	/*============================================================*/
	f4		f4_temp_1, f4_temp_2, f4_temp_3;					/* テンポラリ変数(f4)							*/
	/*============================================================*/

	/*============================================================*/
	/*						I/Fシステム制御						  */
	/*============================================================*/
	
	Set_RLY1(u1_set_rly1);
	Set_RLY2(u1_set_rly2);
	Set_RLY3(u1_set_rly3);
	Set_RLY4(u1_set_rly4);
	Set_RLY5(u1_set_rly5);
	Set_RLY6(u1_set_rly6);
	Set_RLY7(u1_set_rly7);
	Set_RLY8(u1_set_rly8);

	Set_DO0(u1_set_do0);
	Set_DO1(u1_set_do1);
	Set_DO2(u1_set_do2);
	Set_DO3(u1_set_do3);
	Set_DO4(u1_set_do4);
	Set_DO5(u1_set_do5);
	Set_DO6(u1_set_do6);

	Set_UDO0(u1_set_udo0);
	Set_UDO1(u1_set_udo1);
	Set_UDO2(u1_set_udo2);
	Set_UDO3(u1_set_udo3);

	u1_get_udi0		= Get_UDI0();
	u1_get_udi1		= Get_UDI1();
	u1_get_udi2		= Get_UDI2();
	u1_get_udi3		= Get_UDI3();

	u1_get_di0		= Get_DI0();
	u1_get_di1		= Get_DI1();
	u1_get_di2		= Get_DI2();
	u1_get_di3		= Get_DI3();
	u1_get_di4		= Get_DI4();
	u1_get_di5		= Get_DI5();
	u1_get_di6		= Get_DI6();
	u1_get_di7		= Get_DI7();
	/*============================================================*/



}

/*===============================================================
+																+
+				Name:		void fb_1ms_inv0_ifctrl_init (void)	+
+			Function:	タイマ割り込みシステムI/F初期化関数		+
+																+
+																+
+		Return Value:		No									+
+				date:		22th Nov,2017						+
+																+
===============================================================*/
void fb_1ms_inv0_ifctrl_init (void)
{
	/*=============================================================*/
	/*						I/Fシステム制御フラグ初期化			   */
	/*=============================================================*/

	/*=============================================================*/

}
