/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include    "fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include    "fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/* 					  システム状態制御フラグ定義			   */
/*=============================================================*/
u1 			u1_mode_inv0_main;									/* モード状態遷移フラグ							*/
u1			u1_mode_inv0_main_tmp;								/* モード状態遷移フラグ(1回前)					*/
/*=============================================================*/

/*=============================================================*/
/* 						 停止->運転モード処理	    		   */
/*=============================================================*/
u1			u1_seq_inv0_runctrl;								/* シーケンスフラグ								*/
/*=============================================================*/

/*=============================================================*/
/* 						 運転->停止モード処理 			       */
/*=============================================================*/
u1			u1_seq_inv0_stopctrl;								/* シーケンスフラグ								*/
/*=============================================================*/

/*=============================================================*/
/* 					 	運転->エラーモード処理  	      	   */
/*=============================================================*/
u1			u1_seq_inv0_errctrl;								/* シーケンスフラグ								*/
/*=============================================================*/

/*=============================================================*/
/* 						システム動作設定フラグ			   	   */
/*=============================================================*/
u1			u1_flag_inv0_sysctrl;								/* システム制御フラグ							*/

u1			u1_flag_inv0_motctrl;								/* モータ制御フラグ								*/
u1			u1_flag_inv0_offsetadjl;							/* オフセット調整許可フラグ						*/
/*=============================================================*/

/*=============================================================*/
/* 					関数のプロトタイプ宣言					   */
/*=============================================================*/
void	fi_1ms_inv0_seqctrl				(void);					/* 1msタイマ割込みシーケンス制御関数			*/

u1		u1_fi_1ms_inv0_seq_runctrl		(void);					/* 1msタイマ割込み運転シーケンス関数			*/
u1 		u1_fi_1ms_inv0_seq_stopctrl		(void);					/* 1msタイマ割込み停止シーケンス関数			*/
u1	 	u1_fi_1ms_inv0_seq_errctrl		(void);					/* 1msタイマ割込み異常シーケンス関数			*/

void	fb_1ms_inv0_seq_flaginit		(void);					/* 1msタイマ割込みシーケンスフラグ初期化関数	*/
void	fb_1ms_inv0_seq_modeinit		(void);					/* 1msタイマ割込みシーケンスモード初期化関数	*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:	void fi_1ms_inv0_seqctrl (void)			+
+			Function:	1msタイマ割込みシーケンス制御関数		+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fi_1ms_inv0_seqctrl (void)
{

	/*============================================================*/
	/*					システムシーケンス処理					　*/
	/*============================================================*/
	switch(u1_mode_inv0_main)									/* システム状態遷移フラグ						*/
   	{

		/*============================================================*/
		/*						停止モード処理						　*/
		/*============================================================*/
		case u1_MODE_STOP:										/* 停止モード									*/

			if((1 == u1_flag_inv0_sysctrl)&&(1 == u1_flag_err_enable))
			{
				u1_mode_inv0_main 	= u1_MODE_STOP_RUN;			/* =>"停止->運転モード"							*/
			}
			else{}

			if(0 != u4_flag_inv0_error)							/* エラーチェック								*/
			{													/* !=0でエラー検出								*/
				u1_mode_inv0_main 	= u1_MODE_RUN_ERROR;		/* =>"運転->エラーモード"						*/
			}
			else{}

		break;
		/*============================================================*/

		/*============================================================*/
		/*					      停止->運転モード処理				　*/
		/*============================================================*/
		case u1_MODE_STOP_RUN:									/* 停止->運転モード								*/

			if(1 == u1_fi_1ms_inv0_seq_runctrl())				/* 停止->運転関数								*/
			{
				u1_mode_inv0_main 	= u1_MODE_RUN;				/* =>"運転モード"								*/
			}
			else{}

			if(0 == u1_flag_inv0_sysctrl)
			{
				u1_mode_inv0_main 	= u1_MODE_RUN_STOP;			/* =>"運転->停止モード"							*/
			}
			else{}

			if(0 != u4_flag_inv0_error)							/* エラーチェック								*/
			{													/* !=0でエラー検出								*/
				u1_mode_inv0_main 	= u1_MODE_RUN_ERROR;		/* =>"運転->エラーモード"						*/
			}
			else{}

		break;
		/*============================================================*/

		/*============================================================*/
		/*						    運転モード処理				　	  */
		/*============================================================*/
		case u1_MODE_RUN:										/* 運転モード									*/

			if(0 == u1_flag_inv0_sysctrl)
			{
				u1_mode_inv0_main 	= u1_MODE_RUN_STOP;			/* =>"運転->停止モード"							*/
			}
			else{}

			if(0 != u4_flag_inv0_error)							/* エラーチェック								*/
			{													/* !=0でエラー検出								*/
				u1_mode_inv0_main 	= u1_MODE_RUN_ERROR;		/* =>"運転->エラーモード"						*/
			}
			else{}

		break;
		/*============================================================*/

		/*============================================================*/
		/*						  運転->停止モード処理			　	  */
		/*============================================================*/
		case u1_MODE_RUN_STOP:									/* 運転->停止モード								*/

			if(1 == u1_fi_1ms_inv0_seq_stopctrl())				/* 運転->停止関数								*/
			{
				u1_mode_inv0_main 	= u1_MODE_STOP;				/* =>"停止モード"								*/
			}
			else{}

			if(0 != u4_flag_inv0_error)							/* エラーチェック								*/
			{													/* !=0でエラー検出								*/
				u1_mode_inv0_main 	= u1_MODE_RUN_ERROR;		/* =>"運転->エラーモード"						*/
			}
			else{}

		break;
		/*============================================================*/

		/*============================================================*/
		/*					     運転->エラーモード処理				　*/
		/*============================================================*/
		case u1_MODE_RUN_ERROR:									/* 運転->エラーモード							*/

			if(1 == u1_fi_1ms_inv0_seq_errctrl())				/* 運転->エラー関数								*/
			{
				u1_mode_inv0_main 	= u1_MODE_ERROR;			/* =>"エラーモード"								*/
			}
			else{}

		break;
		/*============================================================*/

		/*============================================================*/
		/*						エラーモード処理 					　*/
		/*============================================================*/
		case u1_MODE_ERROR:										/* エラーモード									*/

			if(2 == u1_flag_inv0_sysctrl)
			{													/*=>エラーリセット								*/
				fb_main_error_init();							/* 異常初期化関数を実行							*/
			}
			else{}

		break;
		/*============================================================*/

	}

	/*============================================================*/
	/*					状態遷移時のフラグクリア処理			　*/
	/*============================================================*/
	if(u1_mode_inv0_main_tmp != u1_mode_inv0_main)
	{
		fb_1ms_inv0_seq_modeinit();								/* シーケンスモード初期化関数					*/
																/* シーケンスモードをリセットする				*/
	}
	else{}

	u1_mode_inv0_main_tmp 			= u1_mode_inv0_main;		/* データ保存									*/
	/*============================================================*/

}

/*===============================================================
+																+
+				Name:	u1 u1_fi_1ms_inv0_seq_runctrl (void)	+
+			Function:	1msタイマ割込み運転シーケンス関数		+
+																+
+		Return Value:		1:動作完了							+
+							0:動作中							+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
u1 u1_fi_1ms_inv0_seq_runctrl (void)
{
	switch(u1_seq_inv0_runctrl)
	{
		/*============================================================*/
		/*						u1_SEQ_STOP_RUN_START				　*/
		/*============================================================*/
		case u1_SEQ_STOP_RUN_START:								/* シーケンス開始モード							*/

__DI();
		u1_flag_inv0_motctrl 		= 0;                  		/* インバータ制御停止							*/
		u1_flag_inv0_offsetadjl		= 1;						/* オフセット調整許可							*/
__EI();

		u1_seq_inv0_runctrl			= u1_SEQ_STOP_RUN_01;		/* シーケンス移行								*/

		break;
		/*============================================================*/

		/*============================================================*/
		/*							u1_SEQ_STOP_RUN_01				　*/
		/*============================================================*/
		case u1_SEQ_STOP_RUN_01:

		if(1 == u1_flag_inv0_offsetadj_ok)						/* オフセット調整完了							*/
		{
			u1_flag_inv0_offsetadjl		= 0;					/* オフセット調整許可クリア						*/

			if(0 == u4_flag_inv0_error)
			{
__DI();
				u1_flag_inv0_motctrl 	= 1;					/* インバータ制御開始							*/
__EI();
			}
			else{}

			u1_seq_inv0_runctrl		= u1_SEQ_STOP_RUN_END;		/* シーケンス移行								*/
		}
		else{}

		break;
		/*============================================================*/

		/*============================================================*/
		/*						u1_SEQ_STOP_RUN_END					　*/
		/*============================================================*/
		case u1_SEQ_STOP_RUN_END:								/* シーケンス終了モード							*/

		break;
		/*============================================================*/

	}

	/*============================================================*/
	/*							SEQ_STOP_RUN_CHECK			　	  */
	/*============================================================*/
	if( u1_seq_inv0_runctrl == u1_SEQ_STOP_RUN_END )			/* モードチェック								*/
	{															/* 終了モードで完了								*/
		u1_seq_inv0_runctrl 		= u1_SEQ_STOP_RUN_START;	/* モードをスタートに戻す						*/
		return(1);
	}
	else
	{
		return(0);
	}
	/*============================================================*/

}

/*===============================================================
+																+
+				Name:	u1 u1_fi_1ms_inv0_seq_stopctrl (void)	+
+			Function:	1msタイマ割込み停止シーケンス関数		+
+																+
+		Return Value:		1:動作完了							+
+							0:動作中							+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
u1 u1_fi_1ms_inv0_seq_stopctrl (void)
{
	switch(u1_seq_inv0_stopctrl)
	{
		/*============================================================*/
		/*						u1_SEQ_RUN_STOP_START	 			　*/
		/*============================================================*/
		case u1_SEQ_RUN_STOP_START:								/* シーケンス開始モード							*/

__DI();
		u1_flag_inv0_motctrl 		= 0;               			/* インバータ制御停止							*/
		u1_flag_inv0_offsetadjl		= 0;
__EI();
		u1_seq_inv0_stopctrl		= u1_SEQ_RUN_STOP_END;		/* シーケンス移行								*/

		break;
		/*============================================================*/

		/*============================================================*/
		/*						u1_SEQ_RUN_STOP_END 				　*/
		/*============================================================*/
		case u1_SEQ_RUN_STOP_END:								/* シーケンス終了モード							*/

		break;
		/*============================================================*/
	}

	/*============================================================*/
	/*						SEQ_RUN_STOP_CHECK					　*/
	/*============================================================*/
	if( u1_seq_inv0_stopctrl == u1_SEQ_RUN_STOP_END )			/* モードチェック								*/
	{															/* 終了モードで完了								*/
		u1_seq_inv0_stopctrl 		= u1_SEQ_RUN_STOP_START;	/* モードをスタートに戻す						*/
		return(1);
	}
	else
	{
		return(0);
	}
 	/*============================================================*/
}


/*===============================================================
+																+
+				Name:	u1 u1_fi_1ms_inv0_seq_errctrl (void)	+
+			Function:	1msタイマ割込み異常シーケンス関数		+
+																+
+		Return Value:		1:動作完了							+
+							0:動作中							+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
u1 u1_fi_1ms_inv0_seq_errctrl (void)
{
	switch(u1_seq_inv0_errctrl)
	{
		/*============================================================*/
		/*						SEQ_RUN_ERROR_START	 				　*/
		/*============================================================*/
		case u1_SEQ_RUN_ERROR_START:							/* シーケンス開始モード							*/

__DI();
		u1_flag_inv0_motctrl 		= 0;               			/* インバータ制御停止							*/
		u1_flag_inv0_offsetadjl		= 0;
__EI();

		u1_seq_inv0_errctrl			= u1_SEQ_RUN_ERROR_END;		/* シーケンス移行								*/

		break;
		/*============================================================*/

		/*============================================================*/
		/*						SEQ_RUN_ERROR_END	 				　*/
		/*============================================================*/
		case u1_SEQ_RUN_ERROR_END:								/* シーケンス終了モード							*/

		break;
		/*============================================================*/

	}

	/*============================================================*/
	/*						SEQ_RUN_ERROR_CHECK					　*/
	/*============================================================*/
	if( u1_seq_inv0_errctrl == u1_SEQ_RUN_ERROR_END )			/* モードチェック								*/
	{															/* 終了モードで完了								*/
		u1_seq_inv0_errctrl 		= u1_SEQ_RUN_ERROR_START;	/* モードをスタートに戻す						*/
		return(1);
	}
	else
	{
		return(0);
	}
	/*============================================================*/

}

/*===============================================================
+																+
+			Name:	void fb_1ms_inv0_seq_flaginit (void)		+
+		Function:	1msタイマ割込みシーケンスフラグ初期化関数	+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fb_1ms_inv0_seq_flaginit(void)
{
	/*============================================================*/
	/* 					  システム状態制御フラグ初期化			  */
	/*============================================================*/
	u1_mode_inv0_main				= 0;
	u1_mode_inv0_main_tmp			= 0;
	/*============================================================*/

	/*=============================================================*/
	/* 					システム動作設定フラグ初期化		   	   */
	/*=============================================================*/
	u1_flag_inv0_sysctrl			= 0;

	u1_flag_inv0_motctrl			= 0;
	u1_flag_inv0_offsetadjl			= 0;
	/*=============================================================*/

}

/*===============================================================
+																+
+			Name:		void fb_1ms_inv0_seq_modeinit (void)	+
+		Function:	1msタイマ割込みシーケンスモード初期化関数	+
+																+
+		Return Value:		No									+
+				date:		 23th Mar,2016						+
+																+
===============================================================*/
void fb_1ms_inv0_seq_modeinit(void)
{
	/*=============================================================*/
	/* 						モード初期化				     	   */
	/*=============================================================*/
	u1_seq_inv0_runctrl				= u1_SEQ_STOP_RUN_START;	/* モードをスタートに戻す						*/
	u1_seq_inv0_stopctrl			= u1_SEQ_RUN_STOP_START;
	u1_seq_inv0_errctrl	 			= u1_SEQ_RUN_ERROR_START;
	/*=============================================================*/

}


