/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include    "fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include    "fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/*							エラーフラグ定義				　 */
/*=============================================================*/
u4			u4_flag_inv0_error;									/* エラーフラグ									*/
u4			u4_flag_inv0_error1;								/* エラーフラグ									*/
u4			u4_flag_inv0_error2;								/* エラーフラグ									*/
/*=============================================================*/

/*=============================================================*/
/* 					エラー検出パラメータ変数定義  			   */
/*=============================================================*/
/* 保護レベル		*/
f4			f4_lev_oc_inv0_iac;									/* Unit=A:出力過電流レベル						*/
f4			f4_lev_ov_inv0_vdc;									/* Unit=V:直流過電圧レベル						*/

/* 保護時限			*/
u2			u2_cnt_oc_inv0_iac_pwm_max;							/* 出力過電流エラー時限							*/
u2			u2_cnt_ov_inv0_vdc_pwm_max;							/* 直流過電圧エラー時限							*/

u2			u2_cnt_oc_inv0_iu_pwm;								/* U相過電流エラータイマ						*/
u2			u2_cnt_oc_inv0_iv_pwm;								/* V相過電流エラータイマ						*/
u2			u2_cnt_oc_inv0_iw_pwm;								/* W相過電流エラータイマ						*/
u2			u2_cnt_ov_inv0_vdc_pwm;								/* 直流過電圧エラータイマ						*/
/*=============================================================*/

/*=============================================================*/
/* 					関数のプロトタイプ宣言					   */
/*=============================================================*/
void 	fi_pwm_inv0_errctrl			(void);						/* キャリア割込みエラー検出関数					*/
void 	fb_pwm_inv0_errctrl_init	(void);						/* キャリア割込みエラー検出初期化関数			*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:		void fi_pwm_inv0_errctrl (void)		+
+			Function:		キャリア割込みエラー検出関数		+
+																+
+					1)		SW過電流検出						+
+					2)		HW過電流検出						+
+					3)		直流過電圧検出						+
+					4)		RDC異常検出							+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fi_pwm_inv0_errctrl (void)
{

	/*============================================================*/
	/*						 出力過電流検出(U相電流)		      */
	/*============================================================*/
	if((f4_iu_inv0_ad > f4_lev_oc_inv0_iac)
								||(f4_iu_inv0_ad < -f4_lev_oc_inv0_iac))
	{
		u2_cnt_oc_inv0_iu_pwm++;
		if(u2_cnt_oc_inv0_iu_pwm >= u2_cnt_oc_inv0_iac_pwm_max)		/* 設定カウント以上を検出						*/
		{
			u4_flag_inv0_error1 		= u4_flag_inv0_error1 | u4_ERR_OC_IU;
																/* エラーフラグ書き込み							*/
			u2_cnt_oc_inv0_iu_pwm 	= 0;
		}
		else{}
	}
	else
	{
		u2_cnt_oc_inv0_iu_pwm		= 0;
	}
	/*============================================================*/

	/*============================================================*/
	/*						 出力過電流検出(V相電流)		      */
	/*============================================================*/
	if((f4_iv_inv0_ad > f4_lev_oc_inv0_iac)
								||(f4_iv_inv0_ad < -f4_lev_oc_inv0_iac))
	{
		u2_cnt_oc_inv0_iv_pwm++;
		if(u2_cnt_oc_inv0_iv_pwm >= u2_cnt_oc_inv0_iac_pwm_max)		/* 設定カウント以上を検出						*/
		{
			u4_flag_inv0_error1 		= u4_flag_inv0_error1 | u4_ERR_OC_IV;
																/* エラーフラグ書き込み							*/
			u2_cnt_oc_inv0_iv_pwm	= 0;
		}
		else{}
	}
	else
	{
		u2_cnt_oc_inv0_iv_pwm		= 0;
	}
	/*============================================================*/

	/*============================================================*/
	/*						 出力過電流検出(W相電流)		      */
	/*============================================================*/
	if((f4_iw_inv0_ad > f4_lev_oc_inv0_iac)
								||(f4_iw_inv0_ad < -f4_lev_oc_inv0_iac))
	{
		u2_cnt_oc_inv0_iw_pwm++;
		if(u2_cnt_oc_inv0_iw_pwm >= u2_cnt_oc_inv0_iac_pwm_max)		/* 設定カウント以上を検出						*/
		{
			u4_flag_inv0_error1		= u4_flag_inv0_error1 | u4_ERR_OC_IW;
																/* エラーフラグ書き込み							*/
			u2_cnt_oc_inv0_iw_pwm 	= 0;
		}
		else{}
	}
	else
	{
		u2_cnt_oc_inv0_iw_pwm		= 0;
	}
	/*============================================================*/

	/*============================================================*/
	/*					インバータハードウェアエラー検出		　*/
	/*============================================================*/
	// if(((0 != u1_pwm_inv0_status)&&(0 != dpinv0_extgb_status())) || (0 != Get_GB0()))
	// if(((0 != dpinv0_extgb_status())) || (0 != Get_GB0()))
	if(0 != dpinv0_extgb_status())
	{
		u4_flag_inv0_error1 			= u4_flag_inv0_error1 | u4_ERR_HW;
	}
	else{}
	//CPLDで回路上、ブロックされるため、不要。レベル検出は必要。
	/*============================================================*/

	/*============================================================*/
	/*						  直流過電圧検出					　*/
	/*============================================================*/
	if(f4_vdc_inv0_ad > f4_lev_ov_inv0_vdc)
	{
		u2_cnt_ov_inv0_vdc_pwm++;
		if(u2_cnt_ov_inv0_vdc_pwm >= u2_cnt_ov_inv0_vdc_pwm_max)
		{
			u4_flag_inv0_error1 		= u4_flag_inv0_error1 | u4_ERR_OV_VDC;
																/* エラーフラグ書き込み							*/
			u2_cnt_ov_inv0_vdc_pwm	= 0;
		}
		else{}
	}
	else
	{
		u2_cnt_ov_inv0_vdc_pwm		= 0;
	}
	/*============================================================*/

	/*============================================================*/
	/*							RDC異常検出						　*/
	/*============================================================*/
#if USE_RDC_INV0
	if(0 != u2_read_rdc20_status())
	{
		u4_flag_inv0_error1 			= u4_flag_inv0_error1 | u4_ERR_RDC;
	}
	else{}
#else
#endif
	/*============================================================*/

	/*============================================================*/
	/*							エラーフラグ管理				　*/
	/*============================================================*/
	if(u4_flag_inv0_error1 != 0)
	{
		u4_flag_inv0_error				= u4_flag_inv0_error | u4_ERR1;
	}
	else{}

	if(u4_flag_inv0_error2 != 0)
	{
		u4_flag_inv0_error				= u4_flag_inv0_error | u4_ERR2;
	}
	else{}
	/*============================================================*/
}

/*===============================================================
+																+
+				Name:	void fb_pwm_inv0_errctrl_init (void)	+
+			Function:	キャリア割込みエラー検出初期化関数		+
																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fb_pwm_inv0_errctrl_init (void)
{

	/*=============================================================*/
	/*						エラーフラグ初期化					　 */
	/*=============================================================*/
	u4_flag_inv0_error				= 0;
	u4_flag_inv0_error1				= 0;
	u4_flag_inv0_error2				= 0;
	/*=============================================================*/

	/*=============================================================*/
	/* 					エラー検出パラメータ変数初期化 			   */
	/*=============================================================*/
	f4_lev_oc_inv0_iac				= ((f4)(LEV_OC_INV0_IAC));
	f4_lev_ov_inv0_vdc				= ((f4)(LEV_OV_INV0_VDC));


	u2_cnt_oc_inv0_iac_pwm_max			= ((u2)(CNT_OC_INV0_IAC_PWM_MAX));
	u2_cnt_ov_inv0_vdc_pwm_max			= ((u2)(CNT_OV_INV0_VDC_PWM_MAX));

	u2_cnt_oc_inv0_iu_pwm			= 0;
	u2_cnt_oc_inv0_iv_pwm			= 0;
	u2_cnt_oc_inv0_iw_pwm			= 0;
	u2_cnt_ov_inv0_vdc_pwm			= 0;
	/*=============================================================*/

}



