/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include    "fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include    "fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/*  	     1パルス制御モード(キャリア割込み)変数定義 		   */
/*=============================================================*/
f4			f4_mu_inv0_1pulse;									/* Unit=-::1パルスU相変調率(ソフトモード)		*/
f4			f4_mv_inv0_1pulse;									/* Unit=-::1パルスV相変調率(ソフトモード)		*/
f4			f4_mw_inv0_1pulse;									/* Unit=-::1パルスW相変調率(ソフトモード)		*/
/*=============================================================*/

/*=============================================================*/
/*				  			デバッグ用変数定義			　 	   */
/*=============================================================*/
/*=============================================================*/

/*=============================================================*/
/* 					関数のプロトタイプ宣言					   */
/*=============================================================*/
void		fi_pwm_inv0_1pulse			(void);					/* キャリア割込み1パルス制御関数				*/
void 		fb_pwm_inv0_1pulse_init		(void);					/* キャリア割込み1パルス制御初期化関数			*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:		void fi_pwm_inv0_1pulse (void)		+
+			Function:	　キャリア割込み1パルス制御関数			+
+																+
+					1)	電圧制御位相角演算						+
+					2)	ソフトウェア1パルスモード処理			+
+					3)	 PWM指令値設定(ソフトウェアモード)		+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fi_pwm_inv0_1pulse (void)
{

	/*============================================================*/
	/*					   ローカル変数定義		　				  */
	/*============================================================*/
	f4		f4_temp_1, f4_temp_2;								/* テンポラリ変数(f4)							*/
	/*============================================================*/

	/*============================================================*/
	/*					ソフトウェア1パルスモード処理			　*/
	/*============================================================*/
	{
		// モード切替タイミングフラグセット
		u1_flag_inv0_modetiming		= 1;


		if((s4_wt_inv0_1pulse_pwm_2pi_2_31 > ((s4)(DEF_2_31*(330./360.0))))
								||(s4_wt_inv0_1pulse_pwm_2pi_2_31 <= ((s4)(DEF_2_31*(150./360.0)))))
		{

			if((s4_wt_inv0_1pulse_pwm_2pi_2_31 > ((s4)(DEF_2_31*(330./360.0))))
								||(s4_wt_inv0_1pulse_pwm_2pi_2_31 <= ((s4)(DEF_2_31*(30./360.0)))))
			{
				f4_mu_inv0_1pulse	= f4_m_inv0_max;			/* U相電圧=>"+"									*/
				f4_mv_inv0_1pulse	= -f4_m_inv0_max;			/* V相電圧=>"-"									*/
				f4_mw_inv0_1pulse	= -f4_m_inv0_max;			/* W相電圧=>"-"									*/
			}
			else if((s4_wt_inv0_1pulse_pwm_2pi_2_31 > ((s4)(DEF_2_31*(30./360.0))))
								&&(s4_wt_inv0_1pulse_pwm_2pi_2_31 <= ((s4)(DEF_2_31*(90./360.0)))))
			{
				f4_mu_inv0_1pulse	= f4_m_inv0_max;			/* U相電圧=>"+"									*/
				f4_mv_inv0_1pulse	= f4_m_inv0_max;			/* V相電圧=>"+"									*/
				f4_mw_inv0_1pulse	= -f4_m_inv0_max;			/* W相電圧=>"-"									*/
			}
			else
			{
				f4_mu_inv0_1pulse	= -f4_m_inv0_max;			/* U相電圧=>"-"									*/
				f4_mv_inv0_1pulse	= f4_m_inv0_max;			/* V相電圧=>"+"									*/
				f4_mw_inv0_1pulse	= -f4_m_inv0_max;			/* W相電圧=>"-"									*/
			}
		}
		else
		{
			if((s4_wt_inv0_1pulse_pwm_2pi_2_31 > ((s4)(DEF_2_31*(150./360.0))))
			   					&&(s4_wt_inv0_1pulse_pwm_2pi_2_31 <= ((s4)(DEF_2_31*(210./360.0)))))
			{
				f4_mu_inv0_1pulse	= -f4_m_inv0_max;			/* U相電圧=>"-"									*/
				f4_mv_inv0_1pulse	= f4_m_inv0_max;			/* V相電圧=>"+"									*/
				f4_mw_inv0_1pulse	= f4_m_inv0_max;			/* W相電圧=>"+"									*/
			}
			else if((s4_wt_inv0_1pulse_pwm_2pi_2_31 > ((s4)(DEF_2_31*(210./360.0))))
								&&(s4_wt_inv0_1pulse_pwm_2pi_2_31 <= ((s4)(DEF_2_31*(270./360.0)))))
			{
				f4_mu_inv0_1pulse	= -f4_m_inv0_max;			/* U相電圧=>"-"									*/
				f4_mv_inv0_1pulse	= -f4_m_inv0_max;			/* V相電圧=>"-"									*/
				f4_mw_inv0_1pulse	= f4_m_inv0_max;			/* W相電圧=>"+"									*/
			}
			else
			{
				f4_mu_inv0_1pulse	= f4_m_inv0_max;			/* U相電圧=>"+"									*/
				f4_mv_inv0_1pulse	= -f4_m_inv0_max;			/* V相電圧=>"-"									*/
				f4_mw_inv0_1pulse	= f4_m_inv0_max;			/* W相電圧=>"+"									*/

			}
		}
	}
	/*============================================================*/

	/*============================================================*/
	/*     				 PWM指令値設定(ソフトウェアモード)　	  */
	/*============================================================*/
	{
		//サンプリングディレイ
		dpinv0_set_addelay(s4_adtrig_inv0_delay_ns);
__DI();
		dpinv0_setuvwf_f_V3(f4_mu_inv0_1pulse, f4_mv_inv0_1pulse, f4_mw_inv0_1pulse, u4_fc_inv0_lsb_0);
__EI();
	}

	/*============================================================*/
}

/*===============================================================
+																+
+				Name:	void fb_pwm_inv0_1pulse_init (void)		+
+			Function:	キャリア割込み1パルス制御初期化関数		+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fb_pwm_inv0_1pulse_init (void)
{

	/*=============================================================*/
	/*  	              1パルス制御モード変数初期化 			   */
	/*=============================================================*/
	f4_mu_inv0_1pulse					= ((f4)(0.));
	f4_mv_inv0_1pulse					= ((f4)(0.));
	f4_mw_inv0_1pulse					= ((f4)(0.));
	/*=============================================================*/

}






