/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include    "fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include    "fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/*                  	三相電圧指令値変数定義	 			   */
/*=============================================================*/
f4			f4_va_inv0_ref;										/* Unit=V:a相電圧指令値							*/
f4			f4_vb_inv0_ref;										/* Unit=V:b相電圧指令値							*/

f4			f4_vu_inv0_svctrl;									/* Unit=V:U相電圧指令値							*/
f4			f4_vv_inv0_svctrl;									/* Unit=V:V相電圧指令値							*/
f4			f4_vw_inv0_svctrl;									/* Unit=V:W相電圧指令値							*/
/*=============================================================*/

/*=============================================================*/
/*                   空間ベクトル変調変数定義		           */
/*=============================================================*/
f4			f4_mu_inv0_svctrl;									/* Unit=-:U相変調率					            */
f4			f4_mv_inv0_svctrl;									/* Unit=-:V相変調率         				  	*/
f4			f4_mw_inv0_svctrl;									/* Unit=-:W相変調率					            */

f4			f4_m_inv0_max;										/* Unit=-:通常/過変調モード変調率最大値         */
/*=============================================================*/

/*=============================================================*/
/*				  			デバッグ用変数定義			　 	   */
/*=============================================================*/
/*=============================================================*/

/*=============================================================*/
/* 					関数のプロトタイプ宣言					   */
/*=============================================================*/
void 		fi_pwm_inv0_svctrl			(void);					/* キャリア割込みSPWM電圧制御関数				*/
void 		fb_pwm_inv0_svctrl_init		(void);					/* キャリア割込みSPWM電圧制御初期化関数			*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:		void fi_pwm_inv0_svctrl (void)		+
+			Function:	キャリア割込みSPWM電圧制御関数			+
+																+
+					1)		電圧座標変換						+
+					2)		空間ベクトル変調					+
+					3)		PWM指令値設定						+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fi_pwm_inv0_svctrl (void)
{

	/*============================================================*/
	/*					   ローカル変数定義		　				  */
	/*============================================================*/
	f4		f4_temp_1;											/* テンポラリ変数(f4)							*/
	/*============================================================*/

    /*============================================================*/
    /*      			電圧指令値座標変換(dq=>uvw)	演算   		  */
    /*============================================================*/
    {
    	f4		t_f4_va_inv0_ref;								/* Unit=V:a相電圧指令値							*/
    	f4		t_f4_vb_inv0_ref;								/* Unit=V:b相電圧指令値							*/

 		/* dq=>ab変換 				*/
		t_f4_va_inv0_ref			= (f4_cos_inv0_wtsvctrl * f4_vd_inv0_ref) - (f4_sin_inv0_wtsvctrl * f4_vq_inv0_ref);
																/* a相電圧指令値								*/
		t_f4_vb_inv0_ref			= (f4_sin_inv0_wtsvctrl * f4_vd_inv0_ref) + (f4_cos_inv0_wtsvctrl * f4_vq_inv0_ref);
																/* b相電圧指令値								*/
 		f4_va_inv0_ref				= t_f4_va_inv0_ref;
 		f4_vb_inv0_ref				= t_f4_vb_inv0_ref;
		
 		/* dq=>uvw変換 				*/
		f4_vu_inv0_svctrl			= (t_f4_va_inv0_ref * ((f4)(0.816496581))) + f4_vuctrl_inv0_err;
																/* U相電圧指令値								*/
		f4_vv_inv0_svctrl			= (t_f4_va_inv0_ref * ((f4)(-0.40824829))) + (t_f4_vb_inv0_ref * ((f4)(0.70710678))) + f4_vvctrl_inv0_err;
																/* V相電圧指令値								*/
		f4_vw_inv0_svctrl			= (t_f4_va_inv0_ref * ((f4)(-0.40824829))) - (t_f4_vb_inv0_ref * ((f4)(0.70710678))) + f4_vwctrl_inv0_err;
																/* W相電圧指令値								*/
	}
    /*============================================================*/

	/*============================================================*/
	/*                  	  空間ベクトル変調演算				  */
	/*============================================================*/
	{
		f4		t_f4_mu_inv0_tmp;								/* Unit=-:U相変調率(補正前)	   				   	*/
		f4		t_f4_mv_inv0_tmp;								/* Unit=-:V相変調率(補正前)	   				   	*/
		f4		t_f4_mw_inv0_tmp;								/* Unit=-:W相変調率(補正前)	   				   	*/

		f4		t_f4_m_inv0_max;								/* Unit=-:変調率最大値	   					   	*/
		f4		t_f4_m_inv0_min;								/* Unit=-:変調率最小値   					   	*/
		f4		t_f4_m_inv0_offset;								/* Unit=-:変調率オフセット		   			   	*/

		/* 三相変調率演算		*/
		t_f4_mu_inv0_tmp			= ((f4)(2.0)) * (f4_vu_inv0_svctrl * f4_dvdc_inv0_ad);
																/* U相変調率(補正前)							*/
		t_f4_mv_inv0_tmp			= ((f4)(2.0)) * (f4_vv_inv0_svctrl * f4_dvdc_inv0_ad);
																/* V相変調率(補正前)							*/
		t_f4_mw_inv0_tmp			= ((f4)(2.0)) * (f4_vw_inv0_svctrl * f4_dvdc_inv0_ad);
																/* W相変調率(補正前)							*/
		/* 空間ベクトル変調		*/
		if(t_f4_mu_inv0_tmp > t_f4_mv_inv0_tmp)     			/* 変調率の最大値/最小値を求める				*/
		{
			t_f4_m_inv0_max			= t_f4_mu_inv0_tmp;
			t_f4_m_inv0_min			= t_f4_mv_inv0_tmp;
		}
		else
		{
			t_f4_m_inv0_max			= t_f4_mv_inv0_tmp;
			t_f4_m_inv0_min			= t_f4_mu_inv0_tmp;
		}

		if(t_f4_mw_inv0_tmp > t_f4_m_inv0_max)
		{
			t_f4_m_inv0_max			= t_f4_mw_inv0_tmp;
		}
		else if(t_f4_mw_inv0_tmp < t_f4_m_inv0_min)
		{
			t_f4_m_inv0_min			= t_f4_mw_inv0_tmp;
		}
		else{}

		t_f4_m_inv0_offset			= (((t_f4_m_inv0_max + t_f4_m_inv0_min)) * ((f4)(0.5)));
																/* 変調率オフセット								*/
		f4_temp_1					= (t_f4_mu_inv0_tmp - t_f4_m_inv0_offset) * f4_k_inv0_modu;
		f4_mu_inv0_svctrl  			= limit(f4_temp_1, f4_m_inv0_max, -f4_m_inv0_max);

		f4_temp_1					= (t_f4_mv_inv0_tmp - t_f4_m_inv0_offset) * f4_k_inv0_modu;
		f4_mv_inv0_svctrl  			= limit(f4_temp_1, f4_m_inv0_max, -f4_m_inv0_max);

		f4_temp_1					= (t_f4_mw_inv0_tmp - t_f4_m_inv0_offset) * f4_k_inv0_modu;
		f4_mw_inv0_svctrl  			= limit(f4_temp_1, f4_m_inv0_max, -f4_m_inv0_max);
	}
	/*============================================================*/

	/*============================================================*/
	/*     					 PWM指令値設定　 					  */
	/*============================================================*/
	//サンプリングディレイ
	dpinv0_set_addelay(s4_adtrig_inv0_delay_ns);
__DI();
	dpinv0_setuvwf_f_V3(f4_mu_inv0_svctrl, f4_mv_inv0_svctrl, f4_mw_inv0_svctrl, u4_fc_inv0_lsb_0);
																/* 三相変調率&PWM周波数を設定					*/
__EI();
	/*============================================================*/

}

/*===============================================================
+																+
+				Name:	void fb_pwm_inv0_svctrl_init (void)		+
+			Function:	キャリア割込みSPWM電圧制御初期化関数	+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fb_pwm_inv0_svctrl_init (void)
{

	/*=============================================================*/
	/*                  	三相電圧指令値変数初期化 			   */
	/*=============================================================*/
	f4_vu_inv0_svctrl					= ((f4)(0.));
	f4_vv_inv0_svctrl					= ((f4)(0.));
	f4_vw_inv0_svctrl					= ((f4)(0.));
	/*=============================================================*/

	/*=============================================================*/
	/*                   空間ベクトル変調変数初期化		           */
	/*=============================================================*/
	f4_mu_inv0_svctrl				= ((f4)(0.));
	f4_mv_inv0_svctrl				= ((f4)(0.));
	f4_mw_inv0_svctrl				= ((f4)(0.));

	f4_m_inv0_max					= ((f4)(M_INV0_MAX));
	/*=============================================================*/
}






