/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2017		+
+																+
===============================================================*/

/*=============================================================*/
/* 				 ヘッダファイルのインクルード				   */
/*=============================================================*/
#include	"CPU_common.h"										/* CPU共通ヘッダファイル						*/

/* 制御プログラム関係			*/
#include    "fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include    "fim_user_inv0.h"									/* ユーザ設定パラメータヘッダファイル			*/
/*=============================================================*/

/*=============================================================*/
/* 					電圧制御誤差テーブル変数定義			   */
/*=============================================================*/
u2			u2_cnt_vctrltbl;									/* 電圧誤差テーブルデータ参照変数				*/
/*=============================================================*/

/*=============================================================*/
/*				  			デバッグ用変数定義			　 	   */
/*=============================================================*/

/*=============================================================*/

/*=============================================================*/
/* 					関数のプロトタイプ宣言					   */
/*=============================================================*/
void 		fi_pwm_vctrlerrtbl 		(f4 _f4_i_ref, f4 _f4_v_max, f4 _f4_i_max, f4 *_f4_vctrlerr);
																/* キャリア割込み電圧制御誤差テーブル関数		*/
void 		fb_pwm_vctrlerr_init	(void);						/* キャリア割込み電圧制御誤差テーブル初期化関数	*/
/*=============================================================*/

/*===============================================================
+																+
+				Name:		void fi_pwm_vctrlerrtbl (-)			+
+			Function:キャリア割込み電圧制御誤差補償テーブル関数	+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fi_pwm_vctrlerrtbl (f4 _f4_i_ref, f4 _f4_v_max, f4 _f4_i_max, f4 *_f4_vctrlerr)
{

	/*============================================================*/
	/*					   ローカル変数定義		　				  */
	/*============================================================*/
	f4		t_f4_i_abs;											/* Unit=A:電流指令値(絶対値)					*/
	s4		t_s4_i_ref_1024A_2_31;								/* lsb=1024/2^31,Unit=A:電流指令値(絶対値)		*/
	/*============================================================*/

	/*============================================================*/
	/* 						　電圧制御誤差演算					  */
	/*============================================================*/
	t_f4_i_abs						= _f4_i_ref;				/* 電流指令値の絶対値を取得						*/
	if(t_f4_i_abs < ((f4)(0.)))		{t_f4_i_abs = -t_f4_i_abs;}
	else{}

	t_s4_i_ref_1024A_2_31			= ((int)(t_f4_i_abs * 2097152));
																/* LSB変換:float=>1024A/2^31					*/
	u2_cnt_vctrltbl					= ((u2)(t_s4_i_ref_1024A_2_31>>18));
	if(u2_cnt_vctrltbl > 256)		{u2_cnt_vctrltbl = 256;}	/* 配列データを参照するためLSB変換(32Aを最大)	*/
	else{}														/* 今回のテーブルは32Aが最大					*/
																/* LSB:2^10/2^31=>2^5/2^26=>2^5/2^8				*/

	if(t_f4_i_abs < _f4_i_max)									/* 飽和電流(測定テーブル電流)以下				*/
	{															/* =>テーブルデータを参照						*/
		if(_f4_i_ref > ((f4)(0.)))	{*_f4_vctrlerr 	= f4_vctrlerr_tbl[u2_cnt_vctrltbl];}
		else						{*_f4_vctrlerr 	= -f4_vctrlerr_tbl[u2_cnt_vctrltbl];}
	}
	else														/* 飽和電流(測定テーブル電流)以上				*/
	{															/* =>一定値にする								*/
		if(_f4_i_ref > ((f4)(0.)))	{*_f4_vctrlerr 	= _f4_v_max;}
		else						{*_f4_vctrlerr 	= -_f4_v_max;}
	}
	/*============================================================*/

}

/*===============================================================
+																+
+			Name:		void fb_pwm_vctrlerr_init (void)		+
+		Function:キャリア割込み電圧制御誤差テーブル初期化関数	+
+																+
+		Return Value:		No									+
+				date:		 10th Mar,2017						+
+																+
===============================================================*/
void fb_pwm_vctrlerr_init (void)
{

	/*=============================================================*/
	/* 					電圧制御誤差テーブル変数初期化			   */
	/*=============================================================*/
	u2_cnt_vctrltbl					= 0;
	/*=============================================================*/

}






