/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+  	 	Copyright (C) Aoyama Motor Drive Technology 2016		+
+																+
===============================================================*/

/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*                               			ユーザ設定パラメータ									   	        */
/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*--------------------------------------------------------------------------------------------------------------*/
/*   	                            			システム動作設定							   	     		    */
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/* 						PWM論理/割込みソース設定			   */
/*=============================================================*/
#define		PWM_LOGIC_INV0					(0)					/* PWM論理設定									*/
																/* 0：正論理,1：負論理							*/
#define		PWM_SOURCE_INV0					(3)					/* PWM割込みソース設定							*/
																/* 0:なし,1:000(山),2:111(谷),3：両方			*/
/*=============================================================*/

/*=============================================================*/
/* 				PWMキャリア/サンプリング周波数設定			   */
/*=============================================================*/
#define		FC_PWM_INV0						(10000)				/* PWMキャリア周波数設定/インバータ[Hz]			*/
																/* 初期化時のデフォルト設定						*/
#define		N_FC_INV0						(0)					/* 間引き数[-]									*/
																/* 制御周波数は、FC_PWM/(N_FC+1)	  			*/
																/* 山谷割込みの場合は適応されない				*/
/*=============================================================*/

/*=============================================================*/
/* 						同期PWM制御パラメータ 				   */
/*=============================================================*/
#define		ENABLE_INV0_PWM_SYNC			(1)					/* 同期PWM制御									*/
																/* 0:無効 1:有効								*/
																/* パラメータ測定モード時、同期PWM制御は無効になる*/

#define		SELECT_INV0_PWM_SYNC_MODE		(0)					/* 同期PWM制御モード選択フラグ					*/
																/* 0:高PWM基準同期PWM 1:低PWM基準同期PWM		*/
/* 同期可能なキャリア周波数が複数ある場合、高fc周波数にするか低fc周波数にするか、選択する						*/

#define		WCLPF_INV0_FMOT					(600.0)				/* モータ周波数LPF値[Hz]						*/

#define		FC_INV0_SYNC_MAX				(10.)				/* 同期PWM補正値上限値[Hz]						*/

#define		K_INV0_PWM_SYNC_MIN				(6)					/* 同期PWM倍率最小設定値[6の倍数]				*/
#define		K_INV0_PWM_SYNC_MAX				(180)				/* 同期PWM倍率最大設定値[6の倍数]				*/

#define		KP_INV0_FC_SYNC					(50.0)				/* 同期PWM補正比例ゲイン[-]						*/
#define		KI_INV0_FC_SYNC					(0.000)				/* 同期PWM補正積分ゲイン[-]						*/

#define		FC_PWM_INV0_MAX					(10000)				/* PWMキャリア周波数上限値[Hz]					*/
#define		FC_PWM_INV0_MIN					(5000)				/* PWMキャリア周波数下限値[Hz]					*/

#define		LEV_DFMOT_INV0_FC_HYS			(10.0)				/* fc変更モータ周波数差分ヒステリシスレベル[Hz]	*/
																/* 割込み回数が増える場合、指定した周波数分、ヒステリシスを設ける */
/*=============================================================*/

/*=============================================================*/
/* 					デッドタイム&電圧制御誤差設定			   */
/*=============================================================*/
#define		DEAD_TIME_INV0_NS				(1000)				/* デッドタイム/インバータ[nsec]				*/
																/* 但し、設定値はハードウェアに依存				*/
/* 電圧制御誤差パラメータ	*/
#define		V_VCTRLERR_INV0_MAX				(7.0148)			/* 電圧制御誤差飽和電圧[V]						*/
#define		I_VCTRLERR_INV0_MAX				(31.0)				/* 電圧制御誤差飽和電流[A]						*/

#define		VDC_INV0_VCTRLERR				(800.69)			/* 電圧制御誤差測定電圧[V]						*/
#define		FC_INV0_VCTRLERR				(10000.)			/* 電圧制御誤差測定PWM周波数[Hz]				*/
/*=============================================================*/

/*=============================================================*/
/* 						  	 AD変換設定					   	   */
/*=============================================================*/
#define		ADTRIG_INV0_DELAY_NS			(0)					/* ADトリガディレイ設定[nsec]					*/
																/* 通常0設定									*/

#define		ICTRL_INV0_SELECT				(3)					/* 電流推定相選択								*/
																/* 0:U相, 1:V相, 2:W相, 3:3相すべて使用			*/

#define		IAD_INV0_AVG					(0)					/* 電流平均化フラグ								*/
																/* PWM割込み[3:両方]の場合のみ選択可能			*/
																/* 0:無効(AD値直接)	1:有効(2回平均)				*/

#define		R_IU_INV0_AD					(-1500.0 *2.0)		/* U相電流レンジ(±なので×2)(±2.5V/-A)		*/
#define		R_IV_INV0_AD					(-1500.0 *2.0)		/* V相電流レンジ(±なので×2)(±2.5V/-A)		*/
#define		R_IW_INV0_AD					(-1500.0 *2.0)		/* W相電流レンジ(±なので×2)(±2.5V/-A)		*/
#define		R_IDC_INV0_AD					(1500.0 *2.0)		/* DC相電流レンジ(±なので×2)(±2.5V/-A)		*/

#define		R_VDC_INV0_AD					(137.5)				/* 直流電圧レンジ								*/

#define		VDC_INV0_AD_OFFSET				(0.0)				/* 直流電圧オフセット値							*/

#define		R_VUVW_INV0_AD					(1375.0 * 2.0)		/* UVW線間電圧レンジ(±なので×2)				*/

#define		R_VCTRLBD_INV0_AD				(35.0)				/* 制御電源電圧レンジ							*/
/*=============================================================*/

/*=============================================================*/
/* 					インバータ電圧&変調率制限設定		   	   */
/*=============================================================*/
/* 電圧制限					*/
#define		K_INV0_VDQ_VCTRL				(1.13)				/* 弱め磁束制御dq軸電圧ベクトル(Vdq=K*Vdc)		*/
#define		K_INV0_VDQ_MAX					(1.20)				/* dq軸電圧ベクトル最大値比率(Vdq=K*Vdc)(変更不要)	*/
 /* ベクトルを制限したい場合はK_INV0_VDQ_VCTRLを下げることで対応すること */

/* 変調率制限				*/
#define		M_INV0_MAX						(1.10)				/* インバータ変調率制限:変更不要[-]				*/

#define		K_INV0_MODU_MAX					(27.259)			/* PWM線形化上限値[-]							*/
/*=============================================================*/

/*=============================================================*/
/* 						電圧制御モード切替設定		   		   */
/*=============================================================*/
/* エンコーダ使用時は1パルス制御禁止にすること	*/
#define		ENABLE_INV0_1PULSE				(1)					/* 1パルス制御許可フラグ						*/
																/* 0:禁止,1:許可								*/


#define		LEV_M_INV0_1PULSE				(1.12)				/* 1パルス制御モード切替レベル[-]				*/
#define		LEV_M_INV0_SVCTRL				(1.11)				/* SVPWM制御切替レベル[-]						*/

#define		CNT_INV0_1PULSEMODE				(20)				/* SVPWM=>1パルス切替カウンタ設定値[PWM割り込み周期]	*/
#define		CNT_INV0_SVPWMMODE				(100)				/* 1パルス => SVPWM切替カウンタ設定値[PWM割り込み周期]	*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*                               			モータパラメータ設定									   	        */
/*--------------------------------------------------------------------------------------------------------------*/
#define		PF_INV0							(2.0)				/* 極対数										*/

#define		R1_INV0							(0.0004)			/* Unit=Ω:一次抵抗								*/
#define		R2_INV0							(0.0004)			/* Unit=Ω:二次抵抗								*/
/* 測定値と理論上の滑り周波数が合わないので、r2 = r1として扱う */

#define		LS_INV0							(0.000062)		/* Unit=H:漏れインダクタンス					*/
#define		LM_INV0							(0.0001)				/* Unit=H:励磁インダクタンス					*/

#define		IDQ_INV0_MAX					(10.0*1.732)		/* Unit=A:電流ベクトル制限値					*/
#define		ID_INV0_REF_MIN					(3.0)				/* Unit=A:励磁(d軸)電流指令値下限				*/
#define		ID_INV0_REF_MAX					(IDQ_INV0_MAX)		/* Unit=A:励磁(d軸)電流指令値上限				*/


#define		LM_INV0_MODE					(0)					/* 励磁インダクタンス演算モード					*/
																/* 0:固定、1:マップデータ						*/

#define		TMP_INV0_R1						(25.6)				/* Unit=℃：一次抵抗基準温度					*/
#define		TMP_INV0_R2						(25.6)				/* Unit=℃：二次抵抗基準温度					*/
#define		ENABLE_INV0_R1_CMP				(0)					/* 一次抵抗温度補正フラグ 0:無効 1:有効			*/
#define		ENABLE_INV0_R2_CMP				(0)					/* 二次抵抗温度補正フラグ 0:無効 1:有効			*/

#define		FSL_INV0_REF_MAX				(20.0)				/* 滑り周波数最大値[Hz]							*/
																/* 発散対策										*/
/*=============================================================*/

/*=============================================================*/
/* 							レゾルバ設定	 				   */
/*=============================================================*/
/* 外部位置センサの組み合わせ	*/
/* USE_RDC_INV0													*/
/*	   0		 :　エンコーダ使用(ENCA1)						*/
/*	   1		 :　RDC20使用(RDC20+ENCA0)						*/
/*	!!!!!!エンコーダ使用時は1パルス制御禁止!!!!!!				*/
/*	!!!!!!エンコーダ使用時はINV1側制御禁止!!!!!!				*/

#define		USE_RDC_INV0					(1)

/* 共通設定	*/
#define		DIR_INV0_ENC					(0)					/* ENCカウント方向設定							*/
																/* モータUVW通電時を基準として 0:CW 1:CCW		*/
/* 共通設定	*/
#define		MOT_INV0_REZO_POLE				(2.0)				/* モータ極対数/位置センサ極数設定				*/
// #define		MOT_INV0_REZO_POLE				(PF_INV0)				/* モータ極対数/位置センサ極数設定				*/
/* レゾルバ：モータ極対数3,レゾルバ2X の場合、1.5	*/
/* レゾルバ：モータ極対数4,レゾルバ2X の場合、2.0	*/
/* レゾルバ：モータ極対数4,レゾルバ4X の場合、1.0	*/
/* エンコーダ：モータ極対数3 の場合、3.0	*/

/* エンコーダ設定	*/
#define		CNT_ENC0_MAX					(19999)				/* エンコーダカウント最大値[分解能-1/rev]		*/
/*=============================================================*/

/*=============================================================*/
/* 							サーミスタ設定	 				   */
/*=============================================================*/
#define		USE_TH_MOTOR1_INV0				(0)					/* サーミスタMOT1 0:未使用 1使用				*/
#define		TH_MOTOR1_INV0_B				(3387.0)			/* サーミスタMOT1 B係数[K]						*/
#define		TH_MOTOR1_INV0_R_T1				(1000.0)			/* サーミスタMOT1 T1温度の抵抗値[ohm]			*/
#define		TH_MOTOR1_INV0_T1				(100.0)				/* サーミスタMOT1 R_t1の温度[degC]				*/

#define		USE_TH_MOTOR2_INV0				(0)					/* サーミスタMOT2 0:未使用 1使用				*/
#define		TH_MOTOR2_INV0_B				(3387.0)			/* サーミスタMOT2 B係数[-]						*/
#define		TH_MOTOR2_INV0_R_T1				(1000.0)			/* サーミスタMOT2 T1温度の抵抗値[ohm]			*/
#define		TH_MOTOR2_INV0_T1				(100.0)				/* サーミスタMOT2 R_t1の温度[degC]				*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*                               				制御パラメータ設定									   	        */
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/* 						角速度PLLパラメータ設定 			   */
/*=============================================================*/
#define		KP_INV0_WRPLL					(1000.)				/* 角速度PLL比例ゲイン[-]						*/
#define		KI_INV0_WRPLL					(10000.)			/* 角速度PLL積分ゲイン[-]						*/

#define		WCLPF_INV0_WRPLL				(600.)				/* 角速度PLLLPFカットオフ角周波数[rad/s]		*/

#define		WR_INV0_PLL_MAX					(20000.)			/* 角速度PLL上限値[-]							*/
/*=============================================================*/

/*=============================================================*/
/* 					インバータ電流制御パラメータ設定		   */
/*=============================================================*/
#define		ENABLE_INV0_KICTRL				(1)					/* 電流制御積分許可設定							*/
																/* 0:禁止, 1:許可								*/
/* 比例ゲイン設定	*/
#define		KP_INV0_IDQ_CTRL_MAX			(0.10)				/* 電流制御比例ゲイン補正項上限					*/
#define		KP_INV0_IDQ_CTRL_MIN			(0.10)				/* 電流制御比例ゲイン補正項下限					*/

#define		LEV_M_KP_INV0_IDQ_CTRL_MAX		(0.85)				/* 電流制御比例ゲイン垂下開始変調率				*/
#define		LEV_M_KP_INV0_IDQ_CTRL_MIN		(0.99)				/* 電流制御比例ゲイン垂下終了変調率				*/
																/* !!変調率は同じ値は設定しない					*/

/* 積分ゲイン設定	*/
#define		KI_INV0_IDQ_CTRL_MAX			(0.1)				/* 電流制御積分ゲイン補正項上限					*/
#define		KI_INV0_IDQ_CTRL_MIN			(0.1)				/* 電流制御積分ゲイン補正項下限					*/

#define		LEV_M_KI_INV0_IDQ_CTRL_MAX		(1.00)				/* 電流制御積分ゲイン垂下開始変調率				*/
#define		LEV_M_KI_INV0_IDQ_CTRL_MIN		(1.10)				/* 電流制御積分ゲイン垂下終了変調率				*/
																/* !!変調率は同じ値は設定しない					*/

#define		ENABLE_INV0_DK_MODU				(0)					/* 過変調領域ゲイン低減設定						*/
																/* 0:禁止, 1:許可								*/
#define		K_INV0_MODU_KICMP				(10.0)				/* 過変調領域積分ゲイン低減比率					*/

#define		VDQ_INV0_CTRL_MAX				(300.)				/* dq軸電流電圧リミッタ							*/

#define		CNT_IDQ_INV0_CTRLI_DELAY_MAX	(4)					/* dq軸電流積分指令値ディレイ					*/
																/* 0でディレイ無し								*/
/*=============================================================*/

/*=============================================================*/
/* 					速度制御パラメータ設定 					   */
/*=============================================================*/
#define		ENABLE_INV0_WRCTRL				(0)					/* 速度制御許可設定								*/
																/* 0:禁止, 1:許可								*/
																/* トルク指令モードのみ							*/

#define		KP_INV0_WRCTRL					(0.05)				/* Unit=-:速度制御比例ゲイン					*/
#define		KI_INV0_WRCTRL					(0.00005)			/* Unit=-:速度制御積分ゲイン					*/
/*=============================================================*/

/*=============================================================*/
/* 					速度リミット制御パラメータ設定 			   */
/*=============================================================*/
#define		ENABLE_INV0_WRLIMITCTRL			(0)					/* 速度リミット制御許可設定						*/
																/* 0:禁止, 1:許可								*/

#define		KP_INV0_WRLIMITCTRL				(1.0)				/* Unit=-:速度リミット制御比例ゲイン			*/
#define		KI_INV0_WRLIMITCTRL				(0.005)				/* Unit=-:速度リミット制御積分ゲイン			*/
/*=============================================================*/

/*=============================================================*/
/* 						  フィルタゲイン設定 				   */
/*=============================================================*/
#define		WCLPF_INV0_M					(300.)				/* 空間ベクトル変調率LPFカットオフ角周波数		*/
#define		WCLPF_INV0_VDC					(300.)				/* 直流電圧LPFカットオフ角周波数				*/
#define		WCLPF_INV0_IDC					(300.)				/* 直流電流LPFカットオフ角周波数				*/
#define		WCLPF_INV0_V_AI					(300.)				/* アナログ入力電圧LPFカットオフ角周波数		*/
#define		WCLPF_INV0_TMP					(5.)				/* サーミスタ温度LPFカットオフ角周波数			*/

#define		WCLPF_INV0_ADJ					(50.)				/* LDQ測定用カットオフ角周波数					*/
#define		WCLPF_INV0_P123					(300.)				/* インバータ出力LPFカットオフ角周波数			*/

#define		KP_INV0_WRPLL_VUVW_AD			(1000.)				/* UVW相電圧による角速度PLL比例ゲイン			*/
#define		KI_INV0_WRPLL_VUVW_AD			(10000.)			/* UVW相電圧による角速度PLL積分ゲイン			*/
#define		WCLPF_INV0_WRPLL_VUVW_AD		(5.)				/* UVW相電圧による角速度PLLLPFカットオフ角周波数*/
/*=============================================================*/

/*=============================================================*/
/* 						  トルク推定演算設定 				   */
/*=============================================================*/
#define		LEV_INV0_SPEED_TQ_EST_CTRL		(500.0)				/* トルク推定方式切り替え回転数[rpm]			*/
																/* 指定回転数以下はモータパラメータで推定		*/
																/* 指定回転数を超えたら、電力から推定			*/
/*=============================================================*/

/*=============================================================*/
/* 					  弱め磁束制御パラメータ設定			   */
/*=============================================================*/
#define		KP_INV0_VDQCTRL					(0.02)				/* 弱め磁束比例ゲイン[-]						*/
#define		KI_INV0_VDQCTRL					(0.004)				/* 弱め磁束積分ゲイン[-]						*/

#define		IDQ_INV0_VDQCTRL_MAX		(IDQ_INV0_MAX * 0.7)	/* 弱め磁束制御出力最大値[A]					*/
																/* IDQ_INV0_MAX 以下に設定すること				*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*                               				システム指令値設定									   	        */
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/* 					   	速度/速度リミット指令値設定 		   */
/*=============================================================*/
#define		SPEED_INV0_REF					(1000.)				/* 速度指令値(rpm)								*/

#define		DSPEED_INV0_REF_UP				(200.0)				/* 回転数指令値変化率(rpm/sec)					*/

#define		SPEED_INV0_LIMIT_REF			(20000.)			/* 速度リミット指令値(rpm)						*/
/*=============================================================*/

/*=============================================================*/
/* 						   dq軸電流指令値設定 				   */
/*=============================================================*/
#define		MODE_INV0_IDQCOM				(0)					/* dq軸電流指令値設定モード						*/
																/* 0:電流振幅&進角指令, 1:トルクマップ制御		*/

/* 0:電流振幅&進角指令のみ */
#define		DIRMS_INV0_REF_UP				(50.0)				/* 電流指令値上昇率(A/sec)						*/
#define		DTHETA_INV0_REF_UP				(45.0)				/* 進角指令値上昇率(deg/sec)					*/

/* 1:トルクマップ制御のみ */
#define		DTQ_INV0_REF_UP					(100.0)				/* トルク指令値上昇率(Nm/sec)					*/
/*=============================================================*/

/*=============================================================*/
/* 						   出力制限設定 					   */
/*=============================================================*/
/* 温度による出力制限はトルクマップ制御時のみ使用*/
#define		TMP_INV0_IGBT_LIMIT_START		(1000)				/* 主回路温度制限開始温度(degC)					*/
#define		TMP_INV0_IGBT_LIMIT_FIN			(1100)				/* 主回路温度制限完了温度(degC)					*/

#define		TMP_INV0_MOT1_LIMIT_START		(1500)				/* モータ温度1制限開始温度(degC)				*/
#define		TMP_INV0_MOT1_LIMIT_FIN			(1600)				/* モータ温度1制限完了温度(degC)				*/

#define		TMP_INV0_MOT2_LIMIT_START		(1500)				/* モータ温度1制限開始温度(degC)				*/
#define		TMP_INV0_MOT2_LIMIT_FIN			(1600)				/* モータ温度1制限完了温度(degC)				*/
/*=============================================================*/

/*=============================================================*/
/*							CAN通信設定						   */
/*=============================================================*/
#define		CAN0_DEBUG						(0)					/* CAN通信デバッグ(0:無効 1:有効)				*/
																/* CAN通信を使用する場合、無効にする			*/

#define		CAN0_ERR_ENABLE					(1)					/* CAN通信エラー(0:無効 1:有効)					*/
																/* AWatcherで操作する場合、無効にする			*/
/*=============================================================*/

/*=============================================================*/
/*							アクティブ放電設定				   */
/*=============================================================*/
#define		SPEED_INV0_ENABLE_ACTIVE_DISCHARGE		(100.0)		/* アクティブ放電有効回転数(rpm)				*/
																/* 指定以下の回転数の場合、アクティブ放電を行う	*/
#define		IRMS_INV0_REF_ACTIVE_DISCHARGE			(10.0)		/* アクティブ放電電流指令値(A)					*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------------------------------*/
/*                               				システム保護パラメータ設定							   	        */
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/* 					システムSW保護レベル設定				   */
/*=============================================================*/
#define		LEV_OC_INV0_IAC					(900.0)				/* 出力過電流レベル[A]							*/
#define		LEV_OV_INV0_VDC					(110.0)				/* 直流過電圧レベル[V]							*/
#define		LEV_UV_INV0_VDC					(5.0)				/* 直流低電圧レベル[V]							*/
#define		LEV_OH_INV0_IGBT				(85.0)				/* IGBT温度異常レベル[degC]						*/
#define		LEV_OH_INV0_MOT1				(130.0)				/* モータ1温度異常レベル[degC]					*/
#define		LEV_OH_INV0_MOT2				(130.0)				/* モータ2温度異常レベル[degC]					*/
#define		LEV_OS_INV0_SPEED				(8000.0)			/* モータ過速度異常レベル[rpm]					*/
#define		LEV_OH_INV0_INT					(85.0)				/* 内部(制御基板)高温度異常レベル[degC]			*/
#define		LEV_OV_INV0_CTRLBD				(15.5)				/* 制御電源高電圧レベル[V]						*/
#define		LEV_UV_INV0_CTRLBD				(8.3)				/* 制御電源低電圧レベル[V]						*/

#define		LEV_SNSR_INV0_IINV				(82)				/* 電流センサ異常レベル[12bit]					*/
#define		LEV_SNSR_INV0_TMP_IGBT			(82)				/* IGBT温度センサ異常レベル[12bit]				*/
#define		LEV_SNSR_INV0_TMP_INT			(82)				/* 内部温度センサ異常レベル[12bit]				*/
#define		LEV_SNSR_INV0_TMP_MOT1			(82)				/* モータ1温度センサ異常レベル[12bit]			*/
#define		LEV_SNSR_INV0_TMP_MOT2			(82)				/* モータ2温度センサ異常レベル[12bit]			*/
																/* AD値12bit(0~04095)の0～LEV_SNSRの範囲を取ったら異常とする */
/*=============================================================*/

/*=============================================================*/
/* 					システムSW保護検出時限設定				   */
/*=============================================================*/
#define		CNT_OC_INV0_IAC_PWM_MAX			(1)					/* 出力過電流異常時限[PWM割り込み周期]			*/
#define		CNT_OV_INV0_VDC_PWM_MAX			(1)					/* 直流過電圧異常時限[PWM割り込み周期]			*/
#define		CNT_UV_INV0_VDC_1MS_MAX			(100)				/* 直流低電圧異常時限[1ms]						*/
#define		CNT_OH_INV0_IGBT_1MS_MAX		(10)				/* IGBT高温度異常時限[1ms]						*/
#define		CNT_OH_INV0_MOT1_1MS_MAX		(100)				/* モータ1高温度異常時限[1ms]					*/
#define		CNT_OH_INV0_MOT2_1MS_MAX		(100)				/* モータ2高温度異常時限[1ms]					*/
#define		CNT_OS_INV0_SPEED_1MS_MAX		(100)				/* モータ過速度異常時限[1ms]					*/

#define		CNT_OH_INV0_INT_1MS_MAX			(10)				/* 内部(制御基板)高温度異常時限[1ms]			*/
#define		CNT_OV_INV0_CTRLBD_1MS_MAX		(10)				/* 制御電源高電圧異常時限[1ms]					*/
#define		CNT_UV_INV0_CTRLBD_1MS_MAX		(10)				/* 制御電源低電圧異常時限[1ms]					*/

#define		CNT_SNSR_INV0_TMP_IGBT_1MS_MAX	(10)				/* IGBT温度センサ異常時限[1ms]					*/
#define		CNT_SNSR_INV0_TMP_INT_1MS_MAX	(10)				/* 内部温度センサ異常時限[1ms]					*/
#define		CNT_SNSR_INV0_TMP_MOT1_1MS_MAX	(10)				/* モータ1温度センサ異常時限[1ms]				*/
#define		CNT_SNSR_INV0_TMP_MOT2_1MS_MAX	(10)				/* モータ2温度センサ異常時限[1ms]				*/

#define		CNT_DI_INV0_SAFTY_MAX			(10)				/* EMGレベル異常時限[1ms]						*/
#define		CNT_DI_INV0_GB_MAX				(10)				/* GBレベル異常時限[1ms]						*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/


