/*===============================================================
+																+
+			Title:		IPMSMモータ制御ソフトウェア				+
+					　(RH850/C1M専用コントローラ対応品)			+
+																+
+				date:		 10th Mar,2017						+
+		Copyright (C) Aoyama Motor Drive Technology 2016		+
+																+
===============================================================*/

/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*												コンパイルオプション定義										*/
/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/

/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/

/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*													システム定数定義											*/
/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/

/*=============================================================*/
/*						割り込みレベルの定義				   */
/*=============================================================*/
#define		LEV_INT_PWM						((u1)(3))			/* キャリア割り込みレベル						*/
#define		LEV_INT_TIMER					((u1)(7))			/* タイマ割り込みレベル							*/
#define		LEV_INT_AWATCHER				((u1)(6))			/* AWatcher割り込みレベル						*/
/*=============================================================*/

/*=============================================================*/
/*								2^n定義						   */
/*=============================================================*/
#define		DEF_2_31						(2147483647)		/* 2^12											*/
#define		DEF_2_16						(65535)				/* 2^16											*/
#define		DEF_2_15						(32767)				/* 2^15											*/
/*=============================================================*/

/*=============================================================*/
/*						 電気角度(rad)定義					   */
/*=============================================================*/
#define		TWOPI							(6.283185307)		/* 2π											*/

#define		f4_TWOPI						((f4)(6.283185307))	/* Unit=rad:2π									*/
#define		f4_ONEPI						((f4)(6.283185307*0.5))
																/* Unit=rad:1π									*/

#define		f4_dTWOPI						((f4)(1.0/TWOPI))	/* Unit=rad:1/2π								*/
/*=============================================================*/

/*=============================================================*/
/* 						エラーコード定義			  		   */
/*=============================================================*/
//u4_flag_inv0_error
#define		u4_ERR1							((u4)(0x00000001))	/* エラーフラグ1								*/
#define		u4_ERR2							((u4)(0x00000002))	/* エラーフラグ2								*/

/* デバッグ用 */
// #define		u4_ERR1							((u4)(0))	/* エラーフラグ1								*/
// #define		u4_ERR2							((u4)(0))	/* エラーフラグ2								*/
/*=============================================================*/


/*=============================================================*/
/*						エラーコード定義					   */
/*=============================================================*/
//u4_flag_inv0_error1
#define		u4_ERR_OV_VDC					((u4)(0x00000001))	/* 直流過電圧エラー								*/
#define		u4_ERR_UV_VDC					((u4)(0x00000002))	/* 直流低電圧エラー								*/
#define		u4_ERR_OC_IU					((u4)(0x00000004))	/* インバータ過電流エラー(U相)					*/
#define		u4_ERR_OC_IV					((u4)(0x00000008))	/* インバータ過電流エラー(V相)					*/

#define		u4_ERR_OC_IW					((u4)(0x00000010))	/* インバータ過電流エラー(W相)					*/
#define		u4_ERR_HW						((u4)(0x00000020))	/* インバータハードウェアエラー					*/
#define		u4_ERR_OS_SPEED					((u4)(0x00000040))	/* 過速度エラー									*/
#define		u4_ERR_OH_MOT1					((u4)(0x00000080))	/* モータ1温度エラー							*/

#define		u4_ERR_OH_MOT2					((u4)(0x00000100))	/* モータ2温度エラー							*/
#define		u4_ERR_RDC						((u4)(0x00000200))	/* レゾルバエラー								*/
#define		u4_ERR_CAN						((u4)(0x00000400))	/* CAN受信エラー								*/
#define		u4_ERR_MCU						((u4)(0x00000800))	/* MCU異常										*/

#define		u4_ERR_OH_IGBT_UP		 		((u4)(0x00001000))	/* IGBT_UP高温度異常							*/
#define		u4_ERR_OH_IGBT_UN		 		((u4)(0x00002000))	/* IGBT_UN高温度異常							*/
#define		u4_ERR_OH_IGBT_VP		 		((u4)(0x00004000))	/* IGBT_VP高温度異常							*/
#define		u4_ERR_OH_IGBT_VN		 		((u4)(0x00008000))	/* IGBT_VN高温度異常							*/

#define		u4_ERR_OH_IGBT_WP		 		((u4)(0x00010000))	/* IGBT_WP高温度異常							*/
#define		u4_ERR_OH_IGBT_WN		 		((u4)(0x00020000))	/* IGBT_WN高温度異常							*/
#define		u4_ERR_EMG						((u4)(0x00040000))	/* EMGレベル異常								*/
#define		u4_ERR_HW_LEV					((u4)(0x00080000))	/* インバータハードウェアレベル異常				*/

#define		u4_ERR_OH_INT		 			((u4)(0))	/* 内部高温度異常								*/
#define		u4_ERR_OV_CTRLBD 				((u4)(0x00200000))	/* 制御電源高電圧異常							*/
#define		u4_ERR_UV_CTRLBD				((u4)(0x00400000))	/* 制御電源低電圧異常							*/
/*=============================================================*/

/*=============================================================*/
/* 						エラーコード定義			  		   */
/*=============================================================*/
//u4_flag_inv0_error2
#define		u4_ERR_SNSR_TMP_MOT1			((u4)(0x00000001))	/* モータ1温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_MOT2			((u4)(0x00000002))	/* モータ2温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_INT		 		((u4)(0))	/* 内部温度センサ異常							*/
#define		u4_ERR_SNSR_TMP_IGBT_UP			((u4)(0x00000008))	/* IGBT_UP温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_IGBT_UN			((u4)(0x00000010))	/* IGBT_UN温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_IGBT_VP			((u4)(0x00000020))	/* IGBT_VP温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_IGBT_VN			((u4)(0x00000040))	/* IGBT_VN温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_IGBT_WP			((u4)(0x00000080))	/* IGBT_WP温度センサ異常						*/
#define		u4_ERR_SNSR_TMP_IGBT_WN			((u4)(0x00000100))	/* IGBT_WN温度センサ異常						*/
#define		u4_ERR_SNSR_IU					((u4)(0x00000200))	/* U相電流センサオフセット異常					*/
#define		u4_ERR_SNSR_IV					((u4)(0x00000400))	/* V相電流センサオフセット異常					*/
#define		u4_ERR_SNSR_IW					((u4)(0x00000800))	/* W相電流センサオフセット異常					*/
#define		u4_ERR_SNSR_IDC					((u4)(0))	/* DC電流センサオフセット異常					*/

/*=============================================================*/

/*=============================================================*/
/*			H/Wエラー要因定義(CPLD仕様で固定：変更不可）	   */
/*=============================================================*/
/* u4_flag_inv0_error_hw の内容	*/
#define		u4_ERR_HW_OC_IU0				((u4)(0x00000001))	/* H/W U0相過電流								*/
#define		u4_ERR_HW_OC_IV0				((u4)(0x00000002))	/* H/W V0相過電流								*/
#define		u4_ERR_HW_OC_IW0				((u4)(0x00000004))	/* H/W W0相過電流								*/
#define		u4_ERR_HW_OC_IU1				((u4)(0x00000008))	/* H/W U1相過電流								*/

#define		u4_ERR_HW_OC_IV1				((u4)(0x00000010))	/* H/W V1相過電流								*/
#define		u4_ERR_HW_OC_IW1				((u4)(0x00000020))	/* H/W W1相過電流								*/
#define		u4_ERR_HW_OV_VDC0				((u4)(0x00000040))	/* H/W VDC0過電圧異常							*/
#define		u4_ERR_HW_OV_VDC				((u4)(0x00000080))	/* H/W VDC過電圧異常							*/

#define		u4_ERR_HW_OV_INVC1				((u4)(0x00000100))	/* H/W INVC1異常								*/
#define		u4_ERR_HW_OV_INVC2				((u4)(0x00000200))	/* H/W INVC2異常								*/
#define		u4_ERR_HW_EMG					((u4)(0x00000400))	/* H/W EMG異常									*/
#define		u4_ERR_HW_RESET					((u4)(0x00000800))	/* H/W RESET									*/

#define		u4_ERR_HW_MCU_M					((u4)(0x00001000))	/* H/W MCU異常M									*/
#define		u4_ERR_HW_MCU_C					((u4)(0x00002000))	/* H/W MCU異常C									*/
#define		u4_ERR_HW_IDC0					((u4)(0x00004000))	/* H/W IDC0異常									*/
#define		u4_ERR_HW_IDC1					((u4)(0x00008000))	/* H/W IDC1異常									*/
/*=============================================================*/

/*=============================================================*/
/* 					HWレベルエラー要因コード定義			   */
/*=============================================================*/
//u4_flag_inv0_error_hw_lev
#define 	u4_ERR_HW_LEV_OV_VDC  			((u4)(0))	/* 直流過電圧エラー								*/
#define		u4_ERR_HW_LEV_OC_IDC 			((u4)(0))	/* 直流過電流エラー								*/
#define		u4_ERR_HW_LEV_OC_IU	 			((u4)(0))	/* インバータ過電流エラー(U相)					*/
#define		u4_ERR_HW_LEV_OC_IV	 			((u4)(0))	/* インバータ過電流エラー(V相)					*/

#define		u4_ERR_HW_LEV_OC_IW	 			((u4)(0))	/* インバータ過電流エラー(W相)					*/
#define		u4_ERR_HW_LEV_FO				((u4)(0))	/* H/W DRIVER FAULTエラー						*/
#define		u4_ERR_HW_LEV_EMG				((u4)(0x00000040))	/* H/W EMGエラー								*/
#define		u4_ERR_HW_LEV_GB				((u4)(0x00000080))	/* H/W GBエラー									*/

#define		u4_ERR_HW_LEV_PMIC				((u4)(0))	/* H/W PMICエラー								*/
#define		u4_ERR_HW_LEV_GPG				((u4)(0))	/* H/W GATE_PGエラー							*/
/*=============================================================*/

/*=============================================================*/
/* 					CAN用エラー要因コード定義				   */
/*=============================================================*/
//u4_flag_inv0_error_can
/*未使用*/

/*=============================================================*/

/*=============================================================*/
/*					  システム状態制御フラグ定義			   */
/*=============================================================*/
#define		u1_MODE_STOP					((u1)(0))			/* 停止モード									*/
#define		u1_MODE_STOP_RUN				((u1)(1))			/* 停止->運転モード								*/
#define		u1_MODE_RUN						((u1)(2))			/* 運転モード									*/
#define		u1_MODE_RUN_STOP				((u1)(3))			/* 運転->停止モード								*/
#define		u1_MODE_RUN_ERROR				((u1)(20))			/* 運転->エラーモード							*/
#define		u1_MODE_ERROR					((u1)(21))			/* エラーモード									*/
/*=============================================================*/

/*=============================================================*/
/*						 停止->運転モード処理				   */
/*=============================================================*/
#define		u1_SEQ_STOP_RUN_START			((u1)(0))			/* シーケンス開始モード							*/
#define		u1_SEQ_STOP_RUN_01				((u1)(1))
#define		u1_SEQ_STOP_RUN_02				((u1)(2))
#define		u1_SEQ_STOP_RUN_03				((u1)(3))
#define		u1_SEQ_STOP_RUN_04				((u1)(4))
#define		u1_SEQ_STOP_RUN_05				((u1)(5))
#define		u1_SEQ_STOP_RUN_END				((u1)(10))			/* シーケンス終了モード							*/
/*=============================================================*/

/*=============================================================*/
/*						 運転->停止モード処理				   */
/*=============================================================*/
#define		u1_SEQ_RUN_STOP_START			((u1)(0))			/* シーケンス開始モード							*/
#define		u1_SEQ_RUN_STOP_01				((u1)(1))
#define		u1_SEQ_RUN_STOP_02				((u1)(2))
#define		u1_SEQ_RUN_STOP_03				((u1)(3))
#define		u1_SEQ_RUN_STOP_04				((u1)(4))
#define		u1_SEQ_RUN_STOP_END				((u1)(10))			/* シーケンス終了モード							*/
/*=============================================================*/

/*=============================================================*/
/*						運転->エラーモード処理				   */
/*=============================================================*/
#define		u1_SEQ_RUN_ERROR_START			((u1)(0))			/* シーケンス開始モード							*/
#define		u1_SEQ_RUN_ERROR_01				((u1)(1))
#define		u1_SEQ_RUN_ERROR_02				((u1)(2))
#define		u1_SEQ_RUN_ERROR_03				((u1)(3))
#define		u1_SEQ_RUN_ERROR_04				((u1)(4))
#define		u1_SEQ_RUN_ERROR_END			((u1)(10))			/* シーケンス終了モード							*/
/*=============================================================*/

/*=============================================================*/
/*						リミット&最大値演算定義				   */
/*=============================================================*/
#define		max(a, b)						((a>b)?(a):(b))
#define		min(a, b)						((a<b)?(a):(b))
#define		limit(a, b, c)					((a>b)?(b):((a<c)?(c):(a)))
/*=============================================================*/

/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*											システム定数定義/ここまで											*/
/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/


/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*										パラメータ&関数外部参照/ここから										*/
/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/

/*=============================================================*/
/*					関数のプロトタイプ宣言					   */
/*=============================================================*/
/* fi_pwm_int.c				*/
extern void fb_pwm_int_init			(void);						/* キャリア割込み初期化関数						*/

/* fi_pwm_inv0_adctrl.c		*/
extern void	fi_pwm_inv0_adctrl			(void);					/* キャリア割込みADデータ処理関数				*/
extern void fb_pwm_inv0_adctrl_init		(void);					/* キャリア割込みADデータ処理初期化関数			*/

/* fi_pwm_inv0_errctrl.c	*/
extern void fi_pwm_inv0_errctrl			(void);					/* キャリア割込みエラー検出関数					*/
extern void fb_pwm_inv0_errctrl_init	(void);					/* キャリア割込みエラー検出初期化関数			*/

/* fi_pwm_inv0_encctrl.c	*/
extern void fi_pwm_inv0_encctrl			(void);					/* キャリア割込みエンコーダ処理関数				*/
extern void fb_pwm_inv0_encctrl_init	(void);					/* キャリア割込みエンコーダ処理初期化関数		*/

/* fi_pwm_inv0_vctrlerr.c	*/
extern void fi_pwm_inv0_vctrlerr		(void);					/* キャリア割込み電圧制御誤差補償関数			*/
extern void fb_pwm_inv0_vctrlerr_init	(void);					/* キャリア割込み電圧制御誤差補償初期化関数		*/

/* fi_pwm_inv0_idqctrl.c	*/
extern void fi_pwm_inv0_idqctrl			(void);					/* キャリア割込みdq軸電流制御関数				*/
extern void fb_pwm_inv0_idqctrl_init	(void);					/* キャリア割込みdq軸電流制御初期化関数			*/

/* fi_pwm_inv0_svctrl.c		*/
extern void fi_pwm_inv0_svctrl			(void);					/* キャリア割込みSPWM電圧制御関数				*/
extern void fb_pwm_inv0_svctrl_init		(void);					/* キャリア割込みSPWM電圧制御初期化関数			*/

/* fi_pwm_inv0_1pulse.c		*/
extern void	fi_pwm_inv0_1pulse			(void);					/* キャリア割込み1パルス制御関数				*/
extern void fb_pwm_inv0_1pulse_init		(void);					/* キャリア割込み1パルス制御初期化関数			*/

/* fi_pwm_inv0_invadj.c		*/
extern void fi_pwm_inv0_invadj			(void);					/* キャリア割込みパラメータ測定関数				*/
extern void fb_pwm_inv0_invadj_init		(void);					/* キャリア割込みパラメータ測定初期化関数		*/

/* fi_pwm_inv0_syncctrl.c	*/
extern void fi_pwm_inv0_syncctrl		(void);					/* キャリア割込み同期PWM制御関数				*/
extern void fb_pwm_inv0_syncctrl_init	(void);					/* キャリア割込み同期PWM初期化関数				*/

/* fi_pwm_vctrlerrtbl.c		*/
extern void fi_pwm_vctrlerrtbl			(f4 _f4_i_ref, f4 _f4_v_max, f4 _f4_i_max, f4 *_f4_vctrlerr);
																/* キャリア割込み電圧制御誤差テーブル関数		*/
extern void fb_pwm_vctrlerr_init		(void);					/* キャリア割込み電圧制御誤差テーブル初期化関数	*/

/* fi_1ms_int.c				*/
extern void fb_1ms_int_init				(void);					/* 1msタイマ割込み初期化関数					*/

/* fi_1ms_inv0_adctrl.c		*/
extern void	fi_1ms_inv0_adctrl			(void);					/* 1msタイマ割込みADデータ処理関数				*/
extern void fb_1ms_inv0_adctrl_init		(void);					/* 1msタイマ割込みADデータ処理初期化関数		*/

/* fi_1ms_inv0_idqcom.c		*/
extern void fi_1ms_inv0_idqcom			(void);					/* 1msタイマ割込みdq軸電流指令値演算関数		*/
extern void	fb_1ms_inv0_idqcom_init		(void);					/* 1msタイマ割込みdq軸電流指令値演算初期化関数	*/

/* fi_1ms_inv0_wrctrl.c		*/
extern void fi_1ms_inv0_wrctrl			(void);					/* 1msタイマ割込み速度制御関数					*/
extern void	fb_1ms_inv0_wrctrl_init		(void);					/* 1msタイマ割込み速度制御初期化関数			*/

/* fi_1ms_inv0_errctrl.c	*/
extern void fi_1ms_inv0_errctrl			(void);					/* 1msタイマ割込みエラー検出関数				*/
extern void fb_1ms_inv0_errctrl_init	(void);					/* 1msタイマ割込みエラー検出初期化関数			*/

/* fi_1ms_inv0_seqctrl.c	*/
extern void	fi_1ms_inv0_seqctrl			(void);					/* 1msタイマ割込みシーケンス制御関数			*/

extern u1	u1_fi_1ms_inv0_seq_runctrl	(void);					/* 1msタイマ割込み運転シーケンス関数			*/
extern u1	u1_fi_1ms_inv0_seq_stopctrl	(void);					/* 1msタイマ割込み停止シーケンス関数			*/
extern u1	u1_fi_1ms_inv0_seq_errctrl	(void);					/* 1msタイマ割込み異常シーケンス関数			*/

extern void	fb_1ms_inv0_seq_flaginit	(void);					/* 1msタイマ割込みシーケンスフラグ初期化関数	*/
extern void	fb_1ms_inv0_seq_modeinit	(void);					/* 1msタイマ割込みシーケンスモード初期化関数	*/

/* fi_1ms_inv0_ifctrl.c			 */
extern void fi_1ms_inv0_ifctrl			(void);					/* タイマ割込みI/F制御関数						*/
extern void fb_1ms_inv0_ifctrl_init		(void);					/* タイマ割込みI/F制御初期化関数				*/

/* fb_hw_ctrl.c				*/
extern void	fb_hw_ctrl_init				(void);					/* システムハードウェア初期化関数				*/

/* mapdata_trq_inv0.c			*/
extern u1 u1_tq_map_get(f4 f4_x, f4 f4_y, f4 f4_z, f4 *f4_a, f4 *f4_b , f4 *f4_c, f4 *f4_d);
																/* トルクマップ取得関数							*/
/* mapdata_trq_inv0_limit.c		*/
extern u1 u1_tq_map_limit(f4 f4_x_2d, f4 f4_z_2d, f4 *f4_a_2d, f4 *f4_b_2d);
																/* トルクマップリミット取得関数					*/
/* mapdata_lm_inv0_1d.c			*/
extern u1 u1_lm_map_1d_get(f4 f4_x_2_2d, f4 *f4_a_2_2d);
																/* 励磁インダクタンス取得関数					*/
/* fb_can0_ctrl.c			*/
extern void		fb_can0_ctrl			(void);					/* CAN0通信パラメータIF関数						*/
extern void		fb_can0_ctrl_init		(void);					/* CAN0通信IFパラメータ初期化関数				*/
extern void		fb_can0_driver_init		(void);					/* CAN0通信ドライバ初期化関数					*/

/* fb_can1_ctrl_init.c			*/
extern void		fb_can1_driver_init		(void);					/* CAN1通信ドライバ初期化関数					*/

/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/
/*											fim_main.c(メイン関数)											*/
/*--------------------------------------------------------------------------------------------------------------*/
/*============================================================*/
/*					エラー判定用変数定義					　*/
/*============================================================*/
extern u4	u4_RESF_reg;										/* リセット要因フラグ							*/
/*============================================================*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_int.c(キャリア割り込み)											*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*					インバータPWM出力状態フラグ				   */
/*=============================================================*/
extern u1	u1_pwm_inv0_status;									/* インバータPWM出力状態フラグ					*/
																/* 0:停止中, 1:出力中							*/
/*=============================================================*/

/*=============================================================*/
/*						PWM/サンプリング周波数設定値		   */
/*=============================================================*/
extern u1	u1_flag_pwm_inv0_source;							/* PWM割込み位置設定							*/
																/* 0:禁止　1:000(山)　2:111(谷)　3：両方		*/

extern u4	u4_fc_inv0_lsb_0;									/* Unit=Hz:PWM周波数設定値						*/

extern f4	f4_fs_inv0_ctrl;									/* Unit=Hz:サンプリング周波数(fc*2)				*/
extern f4	f4_ts_inv0_ctrl;									/* Unit=sec:サンプリング周期					*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_inv0_adctrl.c(キャリア割込みADデータ処理)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						 ADデータバッファ定義				   */
/*=============================================================*/
extern s2	s2_ad000;											/* ADCC0I00 端子　バッファ						*/
extern s2	s2_ad001;											/* ADCC0I01 端子　バッファ						*/
extern s2	s2_ad002;											/* ADCC0I02 端子　バッファ						*/
extern s2	s2_ad003;											/* ADCC0I03 端子　バッファ						*/
extern s2	s2_ad010;											/* ADCC0I10 端子　バッファ						*/
extern s2	s2_ad011;											/* ADCC0I11 端子　バッファ						*/
extern s2	s2_ad012;											/* ADCC0I12 端子　バッファ		 				*/
extern s2	s2_ad013;											/* ADCC0I13 端子　バッファ		 				*/
extern s2	s2_ad020;											/* ADCC0I20 端子　バッファ						*/
extern s2	s2_ad021;											/* ADCC0I21 端子　バッファ						*/
extern s2	s2_ad022;											/* ADCC0I22 端子　バッファ(T&H4) 				*/
extern s2	s2_ad023;											/* ADCC0I23 端子　バッファ(T&H5) 				*/
extern s2	s2_ad030;											/* ADCC0I30 端子　バッファ(T&H0)				*/
extern s2	s2_ad031;											/* ADCC0I31 端子　バッファ(T&H1) 				*/
extern s2	s2_ad032;											/* ADCC0I32 端子　バッファ(T&H2) 				*/
extern s2	s2_ad033;											/* ADCC0I33 端子　バッファ(T&H3) 				*/

extern s2	s2_ad100;											/* ADCC1I00 端子　バッファ						*/
extern s2	s2_ad101;											/* ADCC1I01 端子　バッファ						*/
extern s2	s2_ad102;											/* ADCC1I02 端子　バッファ						*/
extern s2	s2_ad110;											/* ADCC1I10 端子　バッファ						*/
extern s2	s2_ad111;											/* ADCC1I11 端子　バッファ						*/
extern s2	s2_ad112;											/* ADCC1I12 端子　バッファ						*/

extern s2	s2_ad120;											/* ADCC1I20 端子　バッファ						*/
extern s2	s2_ad121;											/* ADCC1I22 端子　バッファ						*/
extern s2	s2_ad122;											/* ADCC1I21 端子　バッファ						*/

extern s2	s2_ad130;											/* ADCC1I30 端子　バッファ(T&H0)				*/
extern s2	s2_ad131;											/* ADCC1I31 端子　バッファ(T&H1) 				*/
extern s2	s2_ad132;											/* ADCC1I32 端子　バッファ(T&H2) 				*/
extern s2	s2_ad140;											/* ADCC1I40 端子　バッファ(T&H3)				*/
extern s2	s2_ad141;											/* ADCC1I41 端子　バッファ(T&H4) 				*/
extern s2	s2_ad142;											/* ADCC1I42 端子　バッファ(T&H5) 				*/

extern s2	s2_ad150;											/* ADCC1I50 端子　バッファ						*/
extern s2	s2_ad151;											/* ADCC1I51 端子　バッファ						*/
extern s2	s2_ad152;											/* ADCC1I52 端子　バッファ						*/
extern s2	s2_ad160;											/* ADCC1I60 端子　バッファ						*/
extern s2	s2_ad161;											/* ADCC1I61 端子　バッファ						*/
extern s2	s2_ad162;											/* ADCC1I62 端子　バッファ						*/

extern s2	s2_ad_inv0_vdc;										/* 直流電圧AD値									*/
extern s2	s2_ad_inv0_idc;										/* 直流電流AD値									*/
extern s2	s2_ad_inv0_iu;										/* U相電流AD値									*/
extern s2	s2_ad_inv0_iv;										/* V相電流AD値									*/
extern s2	s2_ad_inv0_iw;										/* W相電流AD値									*/
extern s2	s2_ad_inv0_vuv;										/* U相電圧AD値									*/
extern s2	s2_ad_inv0_vv;										/* U相電圧AD値									*/
extern s2	s2_ad_inv0_vwv;										/* U相電圧AD値									*/
extern s2	s2_ad_inv0_tmp_igbt_up;								/* IGBT1サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_igbt_un;								/* IGBT2サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_igbt_vp;								/* IGBT3サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_igbt_vn;								/* IGBT4サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_igbt_wp;								/* IGBT5サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_igbt_wn;								/* IGBT6サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_mot1;								/* MOT1サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_mot2;								/* MOT2サーミスタAD値							*/
extern s2	s2_ad_inv0_tmp_int;									/* 内部サーミスタAD値							*/
extern s2	s2_ad_inv0_vctrlbd;									/* 制御電源電圧AD値								*/
extern s2	s2_ad_inv0_tmp_ai0;									/* AI0AD値										*/
extern s2	s2_ad_inv0_tmp_ai1;									/* AI1AD値										*/
extern s2	s2_ad_inv0_tmp_ai2;									/* AI2AD値										*/
extern s2	s2_ad_inv0_tmp_ai3;									/* AI3AD値										*/
extern s2	s2_ad_inv0_tmp_ai4;									/* AI4AD値										*/
extern s2	s2_ad_inv0_tmp_th1;									/* TH1AD値										*/
extern s2	s2_ad_inv0_tmp_th2;									/* TH2AD値										*/
extern s2	s2_ad_inv0_tmp_th3;									/* TH3AD値										*/
extern s2	s2_ad_inv0_tmp_th4;									/* TH4AD値										*/
extern s2	s2_ad_inv0_tmp_th5;									/* TH5AD値										*/
extern s2	s2_ad_inv0_tmp_th6;									/* TH6AD値										*/
extern s2	s2_ad_inv0_tmp_th7;									/* TH7AD値										*/
extern s2	s2_ad_inv0_tmp_th8;									/* TH8AD値										*/
/*=============================================================*/

/*=============================================================*/
/*						ADトリガディレイ定義				   */
/*=============================================================*/
extern s4	s4_adtrig_inv0_delay_ns;							/* Unit=ns:ADトリガディレイ						*/
/*=============================================================*/

/*=============================================================*/
/*							A/D変換変数定義					   */
/*=============================================================*/
extern f4	f4_iu_inv0_ad;										/* Unit=A:U相電流AD値							*/
extern f4	f4_iv_inv0_ad;										/* Unit=A:V相電流AD値							*/
extern f4	f4_iw_inv0_ad;										/* Unit=A:W相電流AD値							*/

extern f4	f4_iu_inv0_ctrl;									/* Unit=A:U相電流(制御用)						*/
extern f4	f4_iv_inv0_ctrl;									/* Unit=A:V相電流(制御用)						*/
extern f4	f4_iw_inv0_ctrl;									/* Unit=A:W相電流(制御用)						*/

extern f4	f4_vdc_inv0_ad;										/* Unit=V:直流電圧AD値							*/
extern f4	f4_vdc_inv0_ad_offset;								/* Unit=V:直流電圧ADオフセット値				*/
extern f4	f4_idc_inv0_ad;										/* Unit=A:直流電流AD値							*/

extern f4	f4_va_inv0_ad;										/* Unit=V:a軸電圧AD値							*/
extern f4	f4_vb_inv0_ad;										/* Unit=V:b軸電圧AD値							*/

extern f4	f4_vctrlbd_inv0_ad;									/* Unit=V:制御電源電圧							*/
/*=============================================================*/

/*=============================================================*/
/*						　直流電圧LPF変数定義				   */
/*=============================================================*/
extern f4	f4_vdc_inv0_lpf;									/* Unit=V:直流電圧LPF値							*/
extern f4	f4_idc_inv0_lpf;									/* Unit=A:直流電流LPF値							*/
/*=============================================================*/

/*=============================================================*/
/*						　1/vdc演算変数定義					   */
/*=============================================================*/
extern f4	f4_dvdc_inv0_ad;									/* Unit=-:1/vdc演算値							*/
/*=============================================================*/

/*=============================================================*/
/*						A/Dオフセット変数定義				   */
/*=============================================================*/
extern s4	s4_offset_iu_inv0_adfs;								/* Unit=A:U相電流オフセット						*/
extern s4	s4_offset_iv_inv0_adfs;								/* Unit=A:V相電流オフセット						*/
extern s4	s4_offset_iw_inv0_adfs;								/* Unit=A:W相電流オフセット						*/
extern s4	s4_offset_idc_inv0_adfs;							/* Unit=A:直流電流オフセット					*/

extern u1	u1_flag_inv0_offsetadj_ok;							/* オフセット調整完了フラグ						*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_inv0_encctrl.c(キャリア割込みエンコーダ処理)						*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*				　エンコーダカウンタ&dq軸角度変数定義		   */
/*=============================================================*/
extern u2	u2_cnt_inv0_ecd_get;								/* エンコーダカウンタ取得値						*/

extern f4	f4_wt_inv0_dq;										/* Unit=rad:dq軸角度							*/
extern f4	f4_wt_inv0_dq_tmp;									/* Unit=rad:dq軸角度(オフセット無)				*/

extern f4	f4_sin_inv0_wtdq;									/* Unit=-:cos(wt_dq)							*/
extern f4	f4_cos_inv0_wtdq;									/* Unit=-:sin(wt_dq)							*/

extern u4	u4_flag_dir_inv0_enc;								/*　エンコーダカウント方向定義値				*/
/*=============================================================*/

/*=============================================================*/
/*						 角速度PLL変数定義					   */
/*=============================================================*/
extern f4	f4_wr_inv0_pll;										/* Unit=rad/s:PLL演算角速度						*/

extern f4	f4_wr_inv0_pll_lpf;									/* Unit=rad/s:PLL演算角速度LPF値				*/
extern f4	f4_wr_inv0_pll_lpf_abs;								/* Unit=rad/s:PLL演算角速度LPF絶対値			*/

extern f4	f4_speed_inv0_lpf;									/* Unit=rpm:モータ速度LPF値						*/
/*=============================================================*/

/*=============================================================*/
/* 			　		　一次周波数&すべり周波数変数定義		　 */
/*=============================================================*/
extern f4	f4_winv_inv0_ref;									/* Unit=rad/s:一次周波数指令値					*/
extern f4	f4_winv_inv0_ref_abs;								/* Unit=rad/s:一次周波数指令絶対値				*/
extern f4	f4_wsl_inv0_ref;									/* Unit=rad/s:すべり周波数指令値				*/
extern f4	f4_fsl_inv0_ref;									/* Unit=Hz:すべり周波数指令値					*/

extern f4	f4_wt_inv0_wsl_ref;									/* Unit=rad:すべり周波数指令値積分値			*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_inv0_vctrlerr.c(キャリア割込み電圧制御誤差補償)					*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						電圧制御誤差補償変数定義			   */
/*=============================================================*/
extern f4	f4_v_vctrlerr_inv0_max;								/* Unit=V:電圧制御誤差飽和電圧					*/

extern f4	f4_k_dfc_inv0_vctrl;								/* Unit=-:PWM変動率補償ゲイン					*/

extern f4	f4_k_dvdc_inv0_vctrl;								/* Unit=-:電圧変動率補償ゲイン					*/

extern f4	f4_vuctrl_inv0_err;									/* Unit=V:U相電圧制御誤差補償値					*/
extern f4	f4_vvctrl_inv0_err;									/* Unit=V:V相電圧制御誤差補償値					*/
extern f4	f4_vwctrl_inv0_err;									/* Unit=V:W相電圧制御誤差補償値					*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_vctrlerrtbl.c(キャリア割込み電圧制御誤差テーブル)					*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_inv0_idqctrl.c(キャリア割込みdq軸電流制御)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						モータパラメータ定義				   */
/*=============================================================*/
extern f4	f4_pf_inv0;											/* Unit=-:極対数								*/
extern f4	f4_dpf_inv0;										/* Unit=-:1.0/極対数							*/

extern f4	f4_r1_inv0;											/* Unit=Ω:一次抵抗(ノミナル値)					*/
extern f4	f4_r2_inv0;											/* Unit=Ω:二次抵抗(ノミナル値)					*/
extern f4	f4_lm_inv0;											/* Unit=H:励磁インダクタンス					*/
extern f4	f4_lm_inv0_const;									/* Unit=H:励磁インダクタンス定常値				*/
extern f4	f4_ls_inv0;											/* Unit=H:漏れインダクタンス					*/
extern f4	f4_rm_inv0;											/* Unit=Ω:鉄損抵抗								*/

extern u1	u1_flag_lm_inv0_mode;								/* 励磁インダクタンス演算モード					*/
																/* 0:固定、1:マップデータ						*/

extern u1	u1_flag_enable_inv0_r2_cmp;							/* Unit=-:二次抵抗補正許可フラグ				*/
extern u1	u1_flag_enable_inv0_r1_cmp;							/* Unit=-:一次抵抗補正許可フラグ				*/

extern f4	f4_tmp_inv0_r1;										/* Unit=-:一次抵抗基準温度						*/
extern f4	f4_tmp_inv0_r2;										/* Unit=-:二次抵抗基準温度						*/
extern f4	f4_r1_inv0_cmp;										/* Unit=Ω一次抵抗温度補正値					*/
extern f4	f4_r2_inv0_cmp;										/* Unit=Ω二次抵抗温度補正値					*/
/*=============================================================*/

/*=============================================================*/
/* 			　　		磁束指令値演算変数定義				　 */
/*=============================================================*/
extern f4	f4_fd_inv0_ref;										/* Unit=Wb:d軸磁束指令値						*/
extern f4	f4_fq_inv0_ref;										/* Unit=Wb:q軸磁束指令値						*/
/*=============================================================*/

/*=============================================================*/
/*							dq軸電流変数定義				   */
/*=============================================================*/
extern f4	f4_id_inv0_ad;										/* Unit=A:d軸電流								*/
extern f4	f4_iq_inv0_ad;										/* Unit=A:q軸電流								*/

extern f4	f4_id_inv0_ref;										/* Unit=A:d軸電流指令値							*/
extern f4	f4_iq_inv0_ref;										/* Unit=A:q軸電流指令値							*/
/*=============================================================*/

/*=============================================================*/
/*						dq軸電流PI制御変数定義				   */
/*=============================================================*/
extern f4	f4_id_inv0_ctrlperr;								/* Unit=A:d軸電流P制御偏差						*/
extern f4	f4_iq_inv0_ctrlperr;								/* Unit=A:q軸電流P制御偏差						*/

extern f4	f4_vd_inv0_ctrl;									/* Unit=V:d軸電流PI制御出力					*/
extern f4	f4_vq_inv0_ctrl;									/* Unit=V:q軸電流PI制御出力					*/
/*=============================================================*/

/*=============================================================*/
/*					dq軸電圧指令値制限変数定義			　　	 */
/*=============================================================*/
extern f4	f4_vdq_inv0_ref;									/* Unit=V:dq軸電圧指令値ベクトル				*/

extern f4	f4_vd_inv0_ref;										/* Unit=V:d軸電圧指令値							*/
extern f4	f4_vq_inv0_ref;										/* Unit=V:q軸電圧指令値							*/
extern f4	f4_wt_inv0_vdq;										/* Unit=rad:電圧進み角							*/
/*=============================================================*/

/*=============================================================*/
/*					PWM変調ゲインテーブル変数定義			　 */
/*=============================================================*/
extern f4	f4_m_inv0_ref;										/* Unit=-:空間ベクトル変調率					*/

extern f4	f4_k_inv0_modu;										/* Unit=%:PWM変調ゲイン(過変調領域)				*/

extern f4	f4_m_inv0_lpf;										/* Unit=-:空間ベクトル変調率LPF値				*/
/*=============================================================*/

/*=============================================================*/
/*						電圧制御モード切替変数定義			   */
/*=============================================================*/
extern u1	u1_flag_inv0_modevctrl;								/* 電圧制御モードフラグ							*/

extern u1	u1_flag_inv0_modetiming;							/* モード切替タイミングフラグ					*/
/*=============================================================*/

/*=============================================================*/
/*						電圧位相変数定義					   */
/*=============================================================*/
extern f4	f4_wt_inv0_delay;									/* Unit=rad:制御遅れ補正角						*/
extern f4	f4_wt_inv0_svctrl;									/* Unit=rad:インバータ電圧位相角				*/

extern f4	f4_sin_inv0_wtsvctrl;								/* Unit=-:sin(wt_ref)          				   	*/
extern f4	f4_cos_inv0_wtsvctrl;								/* Unit=-:cos(wt_ref)          				   	*/

extern s4	s4_wt_inv0_dq_2pi_2_31;								/* lsb=2pi/2^31,Unit=rad:dq軸角度				*/
extern s4	s4_wt_inv0_delay_2pi_2_31;							/* lsb=2pi/2^31,Unit=rad:制御遅れ補正角			*/

extern s4	s4_wt_inv0_vdq_2pi_2_31;							/* lsb=2pi/2^31,Unit=rad:電圧進み角				*/

extern s4	s4_wt_inv0_1pulse_pwm_2pi_2_31;						/* lsb=2pi/2^31,Unit=rad:1パルス電圧位相角@PWM	*/
/*=============================================================*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_inv0_svctrl.c(キャリア割込みSPWM電圧制御)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						三相電圧指令値変数定義				   */
/*=============================================================*/
extern f4	f4_va_inv0_ref;										/* Unit=V:a相電圧指令値							*/
extern f4	f4_vb_inv0_ref;										/* Unit=V:b相電圧指令値							*/
/*=============================================================*/

/*=============================================================*/
/*					 空間ベクトル変調変数定義				   */
/*=============================================================*/
extern f4	f4_m_inv0_max;										/* Unit=-:通常/過変調モード変調率最大値		  */
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_pwm_inv0_1pulse.c(キャリア割込み1パルス制御)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*								  fi_pwm_inv0_errctrl.c(キャリア割込みエラー検出)								*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*							エラーフラグ定義				　 */
/*=============================================================*/
extern u4	u4_flag_inv0_error;									/* エラーフラグ									*/
extern u4	u4_flag_inv0_error1;								/* エラーフラグ									*/
extern u4	u4_flag_inv0_error2;								/* エラーフラグ									*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*								  fi_pwm_inv0_invadjl.c(キャリア割込みパラメータ測定)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						パラメータ測定変数定義				   */
/*=============================================================*/
extern u1	u1_flag_inv0_adj;									/* パラメータ測定モードフラグ					*/

extern f4	f4_f_inv0_adj;										/* Unit=Hz:測定信号周波数						*/
extern f4	f4_f_inv0_adj_tmp;									/* Unit=Hz:測定信号周波数(テンポラリ)			*/

extern f4	f4_wr_inv0_adj;										/* Unit=rad/s:測定信号角速度					*/
extern f4	f4_wt_inv0_adj;										/* Unit=rad:測定信号位相角						*/

extern f4	f4_id_inv0_adj;										/* Unit=A:d軸測定電流指令値						*/
extern f4	f4_iq_inv0_adj;										/* Unit=A:d軸測定電流指令値						*/

extern f4	f4_id_inv0_dc_adj;									/* Unit=A:d軸測定電流指令値(直流分)				*/
extern f4	f4_id_inv0_ac_adj;									/* Unit=A:d軸測定電流指令値(交流分)				*/
extern f4	f4_iq_inv0_dc_adj;									/* Unit=A:q軸測定電流指令値(直流分)				*/
extern f4	f4_iq_inv0_ac_adj;									/* Unit=A:q軸測定電流指令値(交流分)				*/
extern f4	f4_didq_inv0_adj;									/* Unit=A:dq軸測定電流指令値変化率				*/

extern f4	f4_vd_inv0_adj_ref;									/* Unit=V:d軸CVCF電圧指令値						*/
extern f4	f4_vd_inv0_adj_ref_tmp;								/* Unit=V:d軸CVCF電圧指令値						*/
extern f4	f4_vq_inv0_adj_ref;									/* Unit=V:q軸CVCF電圧指令値						*/
extern f4	f4_dvd_inv0_adj_ref;								/* Unit=V:測定電圧指令値変化率					*/

extern f4	f4_wtdq_inv0_adj;									/* Unit=rad:unit=rad:測定dq軸位相角				*/

extern f4	f4_f_inv0_slip_ref;									/* Unit=Hz:滑り周波数							*/
extern f4	f4_f_inv0_slip_ref_diff;							/* Unit=Hz:滑り周波数差分						*/

extern u1	u1_flag_inv0_vctrlerr_adj;							/* 電圧制御誤差確認フラグ						*/

extern f4	f4_rs_inv0_adj;										/* Unit=Ω:電圧制御誤差測定用抵抗値				*/
/*=============================================================*/

/*=============================================================*/
/*					パラメータ測定電圧補正値定義			   */
/*=============================================================*/
extern f4	f4_vd_inv0_plid;									/* Unit=V:d軸微分項(電圧補正値)					*/
extern f4	f4_vq_inv0_plid;									/* Unit=V:q軸微分項(電圧補正値)					*/

extern f4	f4_id_inv0_ad_adj_lpf;								/* Unit=A:d軸測定電流指令値LPF					*/
extern f4	f4_iq_inv0_ad_adj_lpf;								/* Unit=A:q軸測定電流指令値LPF					*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------------------------------*/
/*									   fi_1ms_int.c(タイマ割込み)												*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*					エラー検出許可タイマ変数定義			   */
/*=============================================================*/
extern u1	u1_flag_err_enable;									/* エラー検出許可フラグ							*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_1ms_inv0_adctrl.c(タイマ割込みADデータ処理)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						温度センサ変換変数定義				   */
/*=============================================================*/
extern f4	f4_tmp_inv0_igbt_up;								/* Unit=℃:インバータ温度UP						*/
extern f4	f4_tmp_inv0_igbt_vp;								/* Unit=℃:インバータ温度VP						*/
extern f4	f4_tmp_inv0_igbt_wp;								/* Unit=℃:インバータ温度WP						*/
extern f4	f4_tmp_inv0_igbt_un;								/* Unit=℃:インバータ温度UN						*/
extern f4	f4_tmp_inv0_igbt_vn;								/* Unit=℃:インバータ温度VN						*/
extern f4	f4_tmp_inv0_igbt_wn;								/* Unit=℃:インバータ温度WN						*/

extern f4	f4_tmp_inv0_igbt_max;								/* Unit=℃:IGBT温度最大値						*/

extern f4	f4_tmp_inv0_mot1;									/* Unit=℃:モータ温度							*/
extern f4	f4_tmp_inv0_mot2;									/* Unit=℃:モータ温度							*/
extern f4	f4_tmp_inv0_mot_max;								/* Unit=℃:モータ温度							*/

extern f4	f4_tmp_inv0_int;									/* Unit=℃:内部温度								*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*								  fi_1ms_inv0_idqcom.c(1msタイマ割込みdq軸電流指令値演算)						*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*							 出力制限変数定義				   */
/*=============================================================*/
extern u1	u1_flag_inv0_derating_status;						/* 出力制限状態フラグ							*/
/*=============================================================*/

/*=============================================================*/
/* 					 アクティブ放電演算変数定義				   */
/*=============================================================*/
extern f4	f4_speed_inv0_enable_active_discharge;				/* Unit:rpm アクティブ放電有効回転数			*/
extern f4	f4_irms_inv0_ref_active_discharge;					/* Unit:A アクティブ放電電流指令値				*/
extern u1	u1_flag_inv0_sysctrl_active_discharge;				/* Unit:- アクティブ動作指令フラグ				*/
																/* 0:通常 1:アクティブ放電						*/
extern u1	u1_flag_inv0_sysctrl_active_discharge_tmp;			/* Unit:- アクティブ動作指令フラグ(テンポラリ)	*/
/*=============================================================*/

/*=============================================================*/
/*					 dq軸電流指令値モード定義				   */
/*=============================================================*/
extern u1	u1_flag_mode_inv0_idqcom;							/* dq軸電流指令値設定モード						*/
																/* 0:電流振幅&進角指令, 1:トルクマップ制御		*/

extern f4	f4_id_inv0_ctrl;									/* Unit=A:d軸電流指令値(ランプ後)				*/
extern f4	f4_iq_inv0_ctrl;									/* Unit=A:q軸電流指令値(ランプ後)				*/
/*=============================================================*/

/*=============================================================*/
/*				 電流振幅&進角設定モード変数定義			   */
/*=============================================================*/
extern f4	f4_irms_inv0_ref;									/* Unit=A:相電流実効値指令値(ユーザ設定)		*/
extern f4	f4_theta_inv0_ref;									/* Unit=deg:進角指令値(ユーザ設定)				*/

extern f4	f4_irms_inv0_ref_tmp;								/* Unit=A:相電流実効値指令値(テンポラリ)		*/
extern f4	f4_dirms_inv0_ref_up;								/* Unit=A/sec:電流指令値変化率					*/

extern f4	f4_theta_inv0_ref_tmp;								/* Unit=A:進角指令値(テンポラリ)				*/
extern f4	f4_dtheta_inv0_ref_up;								/* Unit=deg/sec:進角指令値変化率				*/

extern f4	f4_idq_inv0_ctrl;									/* Unit=A:dq軸電流指令値						*/

extern f4	f4_irms_inv0_ref_ctrl;								/* Unit=A:相電流実効値指令値(制御値)			*/
extern f4	f4_theta_inv0_ref_ctrl;								/* Unit=deg:進角指令値(制御値)					*/

extern f4	f4_irms_inv0_ad_lpf;								/* Unit=A:相電流実効値検出値(LPF値)				*/
extern f4	f4_theta_inv0_ad_lpf;								/* Unit=deg:進角検出値(LPF値)					*/
/*=============================================================*/

/*=============================================================*/
/*					トルクマップ制御モード変数定義			   */
/*=============================================================*/
extern f4	f4_tq_inv0_ref;										/* Unit=Nm:トルク指令値	(ユーザ設定)			*/

extern f4	f4_tq_inv0_ref_tmp;									/* Unit=Nm:トルク指令値(ランプ後)				*/
extern f4	f4_dtq_inv0_ref_up;									/* Unit=Nm/sec:トルク指令値変化率				*/

extern f4	f4_tq_inv0_ref_max;									/* Unit=Nm:トルク指令最大値						*/
extern f4	f4_tq_inv0_ref_min;									/* Unit=Nm:トルク指令最小値						*/

extern f4	f4_tq_inv0_ref_max_tmp;								/* Unit=Nm:トルク指令最大値(テンポラリ)			*/
extern f4	f4_tq_inv0_ref_min_tmp;								/* Unit=Nm:トルク指令最小値(テンポラリ)			*/

extern f4	f4_speed_inv0_abs;									/* Unit=min-1:回転数検出値(絶対値)				*/

/*=============================================================*/

/*=============================================================*/
/* 				 	トルク/DC電流推定演算変数定義			   */
/*=============================================================*/
extern f4	f4_wclpf_inv0_p123;									/* Unit=rad/s:インバータ出力電力カットオフ周波数*/
extern f4	f4_power_inv0_p123;									/* Unit=W:インバータ出力						*/
extern f4	f4_power_inv0_p123_lpf;								/* Unit=W:インバータ出力LPF						*/
extern f4	f4_tq_inv0_est;										/* Unit=Nm:トルク出力推定値						*/
extern f4	f4_idc_inv0_est;									/* Unit=A:直流電流推定値						*/
extern f4	f4_lev_inv0_speed_tq_est_ctrl;						/* Unit=rpm:トルク推定方式切り替え回転数		*/
																/* 指定回転数以下はモータパラメータで推定		*/
																/* 指定回転数を超えたら、電力から推定			*/
/*=============================================================*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									fi_1ms_inv0_wrctrl.c(1msタイマ割込み速度制御)								*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/* 					角速度/角速度リミット指令値変数定義		   */
/*=============================================================*/
extern f4	f4_speed_inv0_ref;									/* Unit=min-1:回転数指令値(ユーザ設定)			*/
extern f4	f4_wr_inv0_ref;										/* Unit=rad/s:角速度指令値						*/
extern f4	f4_dspeed_inv0_ref_up;								/* Unit=rpm/s:回転数指令値変化レート			*/
/*=============================================================*/

/*=============================================================*/
/* 					  角速度制御許可設定					   */
/*=============================================================*/
extern u1	u1_flag_enable_inv0_wrctrl;							/* 速度制御許可設定								*/
/*=============================================================*/

/*=============================================================*/
/* 					  角速度リミット制御許可設定			   */
/*=============================================================*/
extern u1	u1_flag_enable_inv0_wrlimitctrl;					/* 速度リミット制御許可設定						*/
/*=============================================================*/

/*=============================================================*/
/* 							速度制御変数定義				   */
/*=============================================================*/
extern f4	f4_tq_inv0_wrctrl;									/* Unit=Nm:速度制御出力							*/
extern f4	f4_iq_inv0_wrctrl;									/* Unit=A:速度制御出力							*/
/*=============================================================*/

/*=============================================================*/
/*						速度リミット制御変数定義			   */
/*=============================================================*/
extern f4	f4_tq_inv0_wrlimitctrl;								/* Unit=A:速度リミット制御出力					*/
extern f4	f4_iq_inv0_wrlimitctrl;								/* Unit=A:速度リミット制御出力					*/

extern f4	f4_idq_inv0_max;									/* Unit=A:dq軸電流制限値						*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_1ms_inv0_errctrl.c(1msタイマ割り込みエラー検出)						*/
/*--------------------------------------------------------------------------------------------------------------*/
/*=============================================================*/
/* 						端子レベル判定変数定義 				　 */
/*=============================================================*/
extern u4	u4_flag_inv0_error_hw;								/* ハードウェアエラー要因フラグ					*/
extern u4	u4_flag_inv0_error_hw_lev;							/* ハードウェア異常レベル要因フラグ				*/
extern u4	u4_flag_inv0_error_can;								/* CAN通信用エラー要因フラグ				*/
/*=============================================================*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*								 fi_1ms_inv0_seqctrl.c(1msタイマ割込みシーケンス制御)							*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/* 					  システム状態制御フラグ定義			   */
/*=============================================================*/
extern u1	u1_mode_inv0_main;									/* モード状態遷移フラグ							*/
/*=============================================================*/

/*=============================================================*/
/*						システム動作設定フラグ				   */
/*=============================================================*/
extern u1	u1_flag_inv0_sysctrl;								/* システム制御フラグ							*/

extern u1	u1_flag_inv0_motctrl;								/* モータ制御フラグ								*/
extern u1	u1_flag_inv0_offsetadjl;							/* オフセット調整許可フラグ						*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*									  fi_1ms_inv0_ifctrl.c(1msタイマ割り込みIF制御)								*/
/*--------------------------------------------------------------------------------------------------------------*/
/*=============================================================*/
/*						I/Fシステム制御フラグ定義			   */
/*=============================================================*/
/*=============================================================*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*										 fb_hw_ctrl.c(ハードウェア制御)											*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*										 fb_kpwm_tbl.c(PWMゲインテーブル)										*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*					PWM出力線形化ゲインテーブル				   */
/*=============================================================*/
extern const f4 f4_k_pwm_tbl[];
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*										 fb_vctrlerr_tbl.c(電圧制御誤差テーブル)								*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*						電圧制御誤差テーブルデータ			   */
/*=============================================================*/
extern const f4 f4_vctrlerr_tbl[];
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*										 fb_can0_ctrl.c(CAN0通信)												*/
/*--------------------------------------------------------------------------------------------------------------*/

/*=============================================================*/
/*					CAN通信受信状態変数定義					   */
/*=============================================================*/
extern u4	u4_status_can0;										/* CAN0バスエラー								*/
/*=============================================================*/

/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/
/*										 fb_can1_ctrl.c(CAN1通信)												*/
/*--------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------*/


/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
/*											システム定数定義/ここまで											*/
/*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/







