/*==============================================================*/
/* 				 ヘッダファイルのインクルード					*/
/*==============================================================*/
#include    <vals_typedef.h>									/* 変数型定義ヘッダファイル						*/
#include    <mathf.h>											/* 数学標準ライブラリ							*/

/* 制御プログラム関係			*/
#include    "fim_gwork_inv0.h"									/* 制御プログラムヘッダファイル					*/
#include    "mapdata_trq_inv0_limit.h"							/* マッププログラムヘッダファイル				*/
/*==============================================================*/

const s2 map_tq_limit[N_Z_2D][2][N_X_2D] =
{
//直流電圧 48V トルクリミット																					
-700	,	-750	,	-700	,	-700	,	-700	,	-650	,	-550	,	-450	,	-400	,	-300	,	-250	,
750	,	700	,	700	,	600	,	450	,	350	,	300	,	250	,	200	,	150	,	150	,

};
